-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\04a_an_descriptive_tables.l
> og
  log type:  text
 opened on:  20 Jul 2020, 22:47:01

. 
. use $tempdir\analysis_dataset, clear

. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 16,074,725    48.74836    18.81031         18        110

. safetab agegroup
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  3,050,588       18.98       18.98
     30-<40 |  2,903,375       18.06       37.04
     40-<50 |  2,568,604       15.98       53.02
     50-<60 |  2,679,596       16.67       69.69
     60-<70 |  2,150,390       13.38       83.07
     70-<80 |  1,744,909       10.85       93.92
        80+ |    977,263        6.08      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00

. safetab age66
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,753,314       79.34       79.34
          1 |  3,321,411       20.66      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00

. safetab male
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,157,942       50.75       50.75
          1 |  7,916,783       49.25      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00

. safetab bmicat
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    296,526        2.33        2.33
  Normal (18.5-24.9) |  4,572,300       35.93       38.26
Overweight (25-29.9) |  4,363,815       34.29       72.55
   Obese I (30-34.9) |  2,206,178       17.34       89.88
  Obese II (35-39.9) |    855,616        6.72       96.61
     Obese III (40+) |    432,034        3.39      100.00
---------------------+-----------------------------------
               Total | 12,726,469      100.00

. safetab bmicat, m
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    296,526        1.84        1.84
  Normal (18.5-24.9) |  4,572,300       28.44       30.29
Overweight (25-29.9) |  4,363,815       27.15       57.44
   Obese I (30-34.9) |  2,206,178       13.72       71.16
  Obese II (35-39.9) |    855,616        5.32       76.48
     Obese III (40+) |    432,034        2.69       79.17
        Unknown (.u) |  3,348,256       20.83      100.00
---------------------+-----------------------------------
               Total | 16,074,725      100.00

. safetab obese4cat
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity | 12,580,897       78.27       78.27
   Obese I (30-34.9) |  2,206,178       13.72       91.99
  Obese II (35-39.9) |    855,616        5.32       97.31
     Obese III (40+) |    432,034        2.69      100.00
---------------------+-----------------------------------
               Total | 16,074,725      100.00

. safetab smoke
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  7,343,683       47.80       47.80
      Former |  5,203,842       33.87       81.68
     Current |  2,815,208       18.32      100.00
-------------+-----------------------------------
       Total | 15,362,733      100.00

. safetab smoke, m
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  7,343,683       45.68       45.68
      Former |  5,203,842       32.37       78.06
     Current |  2,815,208       17.51       95.57
Unknown (.u) |    711,992        4.43      100.00
-------------+-----------------------------------
       Total | 16,074,725      100.00

. safetab bpcat
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,614,651       25.19       25.19
      Elevated |  2,295,640       16.00       41.19
 High, stage I |  5,075,561       35.37       76.57
High, stage II |  3,362,305       23.43      100.00
---------------+-----------------------------------
         Total | 14,348,157      100.00

. safetab bpcat, m
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,614,651       22.49       22.49
      Elevated |  2,295,640       14.28       36.77
 High, stage I |  5,075,561       31.57       68.34
High, stage II |  3,362,305       20.92       89.26
       Unknown |  1,726,568       10.74      100.00
---------------+-----------------------------------
         Total | 16,074,725      100.00

. safetab htdiag_or_highbp
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,739,204       66.81       66.81
          1 |  5,335,521       33.19      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00

. ta shield

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,310,881       76.59       76.59
          1 |  3,763,844       23.41      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00

. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat                            
>                    ///
>                                                 cancer_haem_cat                              
>                    ///
>                                                 other_immuno    ///
>                                                 organ_trans                     /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2.                                                 
. safetab `var'
  3. }
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,423,038       95.95       95.95
          1 |    651,687        4.05      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 13,510,395       84.05       84.05
          1 |  2,564,330       15.95      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,003,489       93.34       93.34
          1 |  1,071,236        6.66      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00
0

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 14,473,298       90.04       90.04
          1 |  1,601,427        9.96      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 15,310,716       95.25       95.25
    Last year |     71,383        0.44       95.69
2-5 years ago |    208,701        1.30       96.99
     5+ years |    483,925        3.01      100.00
--------------+-----------------------------------
        Total | 16,074,725      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 15,984,316       99.44       99.44
    Last year |      8,109        0.05       99.49
2-5 years ago |     25,161        0.16       99.64
     5+ years |     57,139        0.36      100.00
--------------+-----------------------------------
        Total | 16,074,725      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,027,131       99.70       99.70
          1 |     47,594        0.30      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00
0

Solid organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,056,257       99.89       99.89
          1 |     18,468        0.11      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,051,883       99.86       99.86
          1 |     22,842        0.14      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,977,904       99.40       99.40
          1 |     96,821        0.60      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,920,901       99.04       99.04
          1 |    153,824        0.96      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,720,257       97.79       97.79
          1 |    354,468        2.21      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,320        0.11        0.11
         15 |     54,974        0.47        0.58
         30 |    222,842        1.89        2.46
         45 |    664,478        5.62        8.09
         60 | 10,860,652       91.91      100.00
------------+-----------------------------------
      Total | 11,816,266      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None | 15,119,111       94.06       94.06
Stage 3a/3b egfr 30-60       |    887,320        5.52       99.58
           Stage 4/5 egfr<30 |     68,294        0.42      100.00
-----------------------------+-----------------------------------
                       Total | 16,074,725      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,756,904       79.36       79.36
          1 |  3,317,821       20.64      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,269,131       94.99       94.99
          1 |    805,594        5.01      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00

. 
. safetab imd 
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  3,408,922       21.21       21.21
               2 |  3,336,671       20.76       41.96
               3 |  3,306,405       20.57       62.53
               4 |  3,262,522       20.30       82.83
 5 most deprived |  2,760,205       17.17      100.00
-----------------+-----------------------------------
           Total | 16,074,725      100.00

. safetab imd, m
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  3,408,922       21.21       21.21
               2 |  3,336,671       20.76       41.96
               3 |  3,306,405       20.57       62.53
               4 |  3,262,522       20.30       82.83
 5 most deprived |  2,760,205       17.17      100.00
-----------------+-----------------------------------
           Total | 16,074,725      100.00

. safetab ethnicity
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White | 10,326,750       84.82       84.82
                 Mixed |    179,130        1.47       86.29
Asian or Asian British |    979,883        8.05       94.34
                 Black |    354,890        2.91       97.26
                 Other |    333,981        2.74      100.00
-----------------------+-----------------------------------
                 Total | 12,174,634      100.00

. safetab ethnicity, m
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White | 10,326,750       64.24       64.24
                 Mixed |    179,130        1.11       65.36
Asian or Asian British |    979,883        6.10       71.45
                 Black |    354,890        2.21       73.66
                 Other |    333,981        2.08       75.74
               Unknown |  3,900,091       24.26      100.00
-----------------------+-----------------------------------
                 Total | 16,074,725      100.00

. safetab stp
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    177,249        1.10        1.10
          2 |  1,476,406        9.18       10.29
          3 |    693,236        4.31       14.60
          4 |    157,549        0.98       15.58
          5 |    110,722        0.69       16.27
          6 |    745,830        4.64       20.91
          7 |     44,659        0.28       21.19
          8 |    590,625        3.67       24.86
          9 |    480,062        2.99       27.85
         10 |    637,454        3.97       31.81
         11 |    699,674        4.35       36.17
         12 |    228,654        1.42       37.59
         13 |    344,875        2.15       39.73
         14 |    431,923        2.69       42.42
         15 |    558,837        3.48       45.90
         16 |    604,162        3.76       49.66
         17 |    502,359        3.13       52.78
         18 |    680,564        4.23       57.01
         19 |    538,053        3.35       60.36
         20 |    790,033        4.91       65.28
         21 |  1,158,038        7.20       72.48
         22 |     74,990        0.47       72.95
         23 |    622,149        3.87       76.82
         24 |     30,659        0.19       77.01
         25 |    141,348        0.88       77.89
         26 |    535,171        3.33       81.22
         27 |    622,829        3.87       85.09
         28 |    535,326        3.33       88.42
         29 |    421,814        2.62       91.05
         30 |    306,914        1.91       92.95
         31 |     19,476        0.12       93.08
         32 |  1,113,085        6.92      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00

. 
. 
. * Outcomes
. safetab covid_death_itu
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  death/ITU |
       adm. |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,025,720       99.70       99.70
          1 |     49,005        0.30      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00

. safetab covid_tpp_prob_or_susp
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
 prob/susp. |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,445,651       96.09       96.09
          1 |    629,074        3.91      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00

. safetab covid_tpp_prob
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,036,810       99.76       99.76
          1 |     37,915        0.24      100.00
------------+-----------------------------------
      Total | 16,074,725      100.00

. 
. 
. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist covid_tpp_prob covid_death_itu covid_tpp_prob_or_susp {
  2. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                        `outvar', col
  3.         safetab male                                                            `outvar', 
> col
  4.         safetab bmicat                                                          `outvar', 
> col m 
  5.         safetab smoke                                                           `outvar', 
> col m
  6.         safetab obese4cat                                                       `outvar', 
> col m 
  7.         safetab shield                                                          `outvar', 
> col m 
  8. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat                            
>                    ///
>                                                 cancer_haem_cat                              
>                    ///
>                                                 other_immuno    ///
>                                                 organ_trans                     /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  9.         safetab `var'           `outvar', col
 10. }
 11.         
.         safetab imd                                                             `outvar', col
>  m
 12.         safetab ethnicity                                                       `outvar', 
> col m
 13.         *safetab urban                                                          `outvar', 
> col
.         safetab stp                                                             `outvar', col
 14. }
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 3,047,317      3,271 | 3,050,588 
           |     19.00       8.63 |     18.98 
-----------+----------------------+----------
    30-<40 | 2,898,948      4,427 | 2,903,375 
           |     18.08      11.68 |     18.06 
-----------+----------------------+----------
    40-<50 | 2,563,339      5,265 | 2,568,604 
           |     15.98      13.89 |     15.98 
-----------+----------------------+----------
    50-<60 | 2,672,790      6,806 | 2,679,596 
           |     16.67      17.95 |     16.67 
-----------+----------------------+----------
    60-<70 | 2,144,976      5,414 | 2,150,390 
           |     13.38      14.28 |     13.38 
-----------+----------------------+----------
    70-<80 | 1,739,319      5,590 | 1,744,909 
           |     10.85      14.74 |     10.85 
-----------+----------------------+----------
       80+ |   970,121      7,142 |   977,263 
           |      6.05      18.84 |      6.08 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,137,232     20,710 | 8,157,942 
           |     50.74      54.62 |     50.75 
-----------+----------------------+----------
         1 | 7,899,578     17,205 | 7,916,783 
           |     49.26      45.38 |     49.25 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   295,597        929 |   296,526 
                     |      1.84       2.45 |      1.84 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 4,562,733      9,567 | 4,572,300 
                     |     28.45      25.23 |     28.44 
---------------------+----------------------+----------
Overweight (25-29.9) | 4,352,736     11,079 | 4,363,815 
                     |     27.14      29.22 |     27.15 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,199,216      6,962 | 2,206,178 
                     |     13.71      18.36 |     13.72 
---------------------+----------------------+----------
  Obese II (35-39.9) |   852,370      3,246 |   855,616 
                     |      5.32       8.56 |      5.32 
---------------------+----------------------+----------
     Obese III (40+) |   430,079      1,955 |   432,034 
                     |      2.68       5.16 |      2.69 
---------------------+----------------------+----------
        Unknown (.u) | 3,344,079      4,177 | 3,348,256 
                     |     20.85      11.02 |     20.83 
---------------------+----------------------+----------
               Total |16,036,810     37,915 |16,074,725 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 7,326,979     16,704 | 7,343,683 
             |     45.69      44.06 |     45.68 
-------------+----------------------+----------
      Former | 5,187,310     16,532 | 5,203,842 
             |     32.35      43.60 |     32.37 
-------------+----------------------+----------
     Current | 2,811,132      4,076 | 2,815,208 
             |     17.53      10.75 |     17.51 
-------------+----------------------+----------
Unknown (.u) |   711,389        603 |   711,992 
             |      4.44       1.59 |      4.43 
-------------+----------------------+----------
       Total |16,036,810     37,915 |16,074,725 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |12,555,145     25,752 |12,580,897 
                     |     78.29      67.92 |     78.27 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,199,216      6,962 | 2,206,178 
                     |     13.71      18.36 |     13.72 
---------------------+----------------------+----------
  Obese II (35-39.9) |   852,370      3,246 |   855,616 
                     |      5.32       8.56 |      5.32 
---------------------+----------------------+----------
     Obese III (40+) |   430,079      1,955 |   432,034 
                     |      2.68       5.16 |      2.69 
---------------------+----------------------+----------
               Total |16,036,810     37,915 |16,074,725 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |12,287,507     23,374 |12,310,881 
           |     76.62      61.65 |     76.59 
-----------+----------------------+----------
         1 | 3,749,303     14,541 | 3,763,844 
           |     23.38      38.35 |     23.41 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |15,390,029     33,009 |15,423,038 
           |     95.97      87.06 |     95.95 
-----------+----------------------+----------
         1 |   646,781      4,906 |   651,687 
           |      4.03      12.94 |      4.05 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |13,480,043     30,352 |13,510,395 
           |     84.06      80.05 |     84.05 
-----------+----------------------+----------
         1 | 2,556,767      7,563 | 2,564,330 
           |     15.94      19.95 |     15.95 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |14,972,471     31,018 |15,003,489 
           |     93.36      81.81 |     93.34 
-----------+----------------------+----------
         1 | 1,064,339      6,897 | 1,071,236 
           |      6.64      18.19 |      6.66 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |14,444,655     28,643 |14,473,298 
           |     90.07      75.55 |     90.04 
-----------+----------------------+----------
         1 | 1,592,155      9,272 | 1,601,427 
           |      9.93      24.45 |      9.96 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |15,276,361     34,355 |15,310,716 
              |     95.26      90.61 |     95.25 
--------------+----------------------+----------
    Last year |    70,922        461 |    71,383 
              |      0.44       1.22 |      0.44 
--------------+----------------------+----------
2-5 years ago |   207,755        946 |   208,701 
              |      1.30       2.50 |      1.30 
--------------+----------------------+----------
     5+ years |   481,772      2,153 |   483,925 
              |      3.00       5.68 |      3.01 
--------------+----------------------+----------
        Total |16,036,810     37,915 |16,074,725 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |15,947,142     37,174 |15,984,316 
              |     99.44      98.05 |     99.44 
--------------+----------------------+----------
    Last year |     7,996        113 |     8,109 
              |      0.05       0.30 |      0.05 
--------------+----------------------+----------
2-5 years ago |    24,927        234 |    25,161 
              |      0.16       0.62 |      0.16 
--------------+----------------------+----------
     5+ years |    56,745        394 |    57,139 
              |      0.35       1.04 |      0.36 
--------------+----------------------+----------
        Total |16,036,810     37,915 |16,074,725 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |15,989,522     37,609 |16,027,131 
           |     99.71      99.19 |     99.70 
-----------+----------------------+----------
         1 |    47,288        306 |    47,594 
           |      0.29       0.81 |      0.30 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |16,018,579     37,678 |16,056,257 
           |     99.89      99.37 |     99.89 
-----------+----------------------+----------
         1 |    18,231        237 |    18,468 
           |      0.11       0.63 |      0.11 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |16,014,127     37,756 |16,051,883 
           |     99.86      99.58 |     99.86 
-----------+----------------------+----------
         1 |    22,683        159 |    22,842 
           |      0.14       0.42 |      0.14 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,940,583     37,321 |15,977,904 
           |     99.40      98.43 |     99.40 
-----------+----------------------+----------
         1 |    96,227        594 |    96,821 
           |      0.60       1.57 |      0.60 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,884,035     36,866 |15,920,901 
           |     99.05      97.23 |     99.04 
-----------+----------------------+----------
         1 |   152,775      1,049 |   153,824 
           |      0.95       2.77 |      0.96 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |15,685,545     34,712 |15,720,257 
           |     97.81      91.55 |     97.79 
-----------+----------------------+----------
         1 |   351,265      3,203 |   354,468 
           |      2.19       8.45 |      2.21 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,918        402 |    13,320 
           |      0.11       1.19 |      0.11 
-----------+----------------------+----------
        15 |    54,292        682 |    54,974 
           |      0.46       2.02 |      0.47 
-----------+----------------------+----------
        30 |   220,932      1,910 |   222,842 
           |      1.88       5.65 |      1.89 
-----------+----------------------+----------
        45 |   661,027      3,451 |   664,478 
           |      5.61      10.20 |      5.62 
-----------+----------------------+----------
        60 |10,833,279     27,373 |10,860,652 
           |     91.94      80.94 |     91.91 
-----------+----------------------+----------
     Total |11,782,448     33,818 |11,816,266 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |15,087,641     31,470 |15,119,111 
                      |     94.08      83.00 |     94.06 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   881,959      5,361 |   887,320 
                      |      5.50      14.14 |      5.52 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    67,210      1,084 |    68,294 
                      |      0.42       2.86 |      0.42 
----------------------+----------------------+----------
                Total |16,036,810     37,915 |16,074,725 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |12,733,869     23,035 |12,756,904 
           |     79.40      60.75 |     79.36 
-----------+----------------------+----------
         1 | 3,302,941     14,880 | 3,317,821 
           |     20.60      39.25 |     20.64 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,234,262     34,869 |15,269,131 
           |     95.00      91.97 |     94.99 
-----------+----------------------+----------
         1 |   802,548      3,046 |   805,594 
           |      5.00       8.03 |      5.01 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 3,402,189      6,733 | 3,408,922 
                 |     21.21      17.76 |     21.21 
-----------------+----------------------+----------
               2 | 3,329,401      7,270 | 3,336,671 
                 |     20.76      19.17 |     20.76 
-----------------+----------------------+----------
               3 | 3,299,180      7,225 | 3,306,405 
                 |     20.57      19.06 |     20.57 
-----------------+----------------------+----------
               4 | 3,254,082      8,440 | 3,262,522 
                 |     20.29      22.26 |     20.30 
-----------------+----------------------+----------
 5 most deprived | 2,751,958      8,247 | 2,760,205 
                 |     17.16      21.75 |     17.17 
-----------------+----------------------+----------
           Total |16,036,810     37,915 |16,074,725 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |10,303,896     22,854 |10,326,750 
                      |     64.25      60.28 |     64.24 
----------------------+----------------------+----------
                Mixed |   178,694        436 |   179,130 
                      |      1.11       1.15 |      1.11 
----------------------+----------------------+----------
Asian or Asian Britis |   975,620      4,263 |   979,883 
                      |      6.08      11.24 |      6.10 
----------------------+----------------------+----------
                Black |   353,597      1,293 |   354,890 
                      |      2.20       3.41 |      2.21 
----------------------+----------------------+----------
                Other |   333,277        704 |   333,981 
                      |      2.08       1.86 |      2.08 
----------------------+----------------------+----------
              Unknown | 3,891,726      8,365 | 3,900,091 
                      |     24.27      22.06 |     24.26 
----------------------+----------------------+----------
                Total |16,036,810     37,915 |16,074,725 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |   176,747        502 |   177,249 
           |      1.10       1.32 |      1.10 
-----------+----------------------+----------
         2 | 1,472,008      4,398 | 1,476,406 
           |      9.18      11.60 |      9.18 
-----------+----------------------+----------
         3 |   691,786      1,450 |   693,236 
           |      4.31       3.82 |      4.31 
-----------+----------------------+----------
         4 |   157,135        414 |   157,549 
           |      0.98       1.09 |      0.98 
-----------+----------------------+----------
         5 |   110,216        506 |   110,722 
           |      0.69       1.33 |      0.69 
-----------+----------------------+----------
         6 |   743,475      2,355 |   745,830 
           |      4.64       6.21 |      4.64 
-----------+----------------------+----------
         7 |    44,523        136 |    44,659 
           |      0.28       0.36 |      0.28 
-----------+----------------------+----------
         8 |   589,207      1,418 |   590,625 
           |      3.67       3.74 |      3.67 
-----------+----------------------+----------
         9 |   479,266        796 |   480,062 
           |      2.99       2.10 |      2.99 
-----------+----------------------+----------
        10 |   636,110      1,344 |   637,454 
           |      3.97       3.54 |      3.97 
-----------+----------------------+----------
        11 |   697,412      2,262 |   699,674 
           |      4.35       5.97 |      4.35 
-----------+----------------------+----------
        12 |   227,949        705 |   228,654 
           |      1.42       1.86 |      1.42 
-----------+----------------------+----------
        13 |   344,177        698 |   344,875 
           |      2.15       1.84 |      2.15 
-----------+----------------------+----------
        14 |   431,029        894 |   431,923 
           |      2.69       2.36 |      2.69 
-----------+----------------------+----------
        15 |   557,787      1,050 |   558,837 
           |      3.48       2.77 |      3.48 
-----------+----------------------+----------
        16 |   602,899      1,263 |   604,162 
           |      3.76       3.33 |      3.76 
-----------+----------------------+----------
        17 |   501,534        825 |   502,359 
           |      3.13       2.18 |      3.13 
-----------+----------------------+----------
        18 |   677,918      2,646 |   680,564 
           |      4.23       6.98 |      4.23 
-----------+----------------------+----------
        19 |   537,133        920 |   538,053 
           |      3.35       2.43 |      3.35 
-----------+----------------------+----------
        20 |   786,886      3,147 |   790,033 
           |      4.91       8.30 |      4.91 
-----------+----------------------+----------
        21 | 1,155,476      2,562 | 1,158,038 
           |      7.21       6.76 |      7.20 
-----------+----------------------+----------
        22 |    74,843        147 |    74,990 
           |      0.47       0.39 |      0.47 
-----------+----------------------+----------
        23 |   621,059      1,090 |   622,149 
           |      3.87       2.87 |      3.87 
-----------+----------------------+----------
        24 |    30,581         78 |    30,659 
           |      0.19       0.21 |      0.19 
-----------+----------------------+----------
        25 |   141,186        162 |   141,348 
           |      0.88       0.43 |      0.88 
-----------+----------------------+----------
        26 |   534,235        936 |   535,171 
           |      3.33       2.47 |      3.33 
-----------+----------------------+----------
        27 |   622,047        782 |   622,829 
           |      3.88       2.06 |      3.87 
-----------+----------------------+----------
        28 |   534,816        510 |   535,326 
           |      3.33       1.35 |      3.33 
-----------+----------------------+----------
        29 |   421,005        809 |   421,814 
           |      2.63       2.13 |      2.62 
-----------+----------------------+----------
        30 |   306,431        483 |   306,914 
           |      1.91       1.27 |      1.91 
-----------+----------------------+----------
        31 |    19,457         19 |    19,476 
           |      0.12       0.05 |      0.12 
-----------+----------------------+----------
        32 | 1,110,477      2,608 | 1,113,085 
           |      6.92       6.88 |      6.92 
-----------+----------------------+----------
     Total |16,036,810     37,915 |16,074,725 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |    death/ITU adm.
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 3,050,432        156 | 3,050,588 
           |     19.03       0.32 |     18.98 
-----------+----------------------+----------
    30-<40 | 2,902,925        450 | 2,903,375 
           |     18.11       0.92 |     18.06 
-----------+----------------------+----------
    40-<50 | 2,567,377      1,227 | 2,568,604 
           |     16.02       2.50 |     15.98 
-----------+----------------------+----------
    50-<60 | 2,676,236      3,360 | 2,679,596 
           |     16.70       6.86 |     16.67 
-----------+----------------------+----------
    60-<70 | 2,143,929      6,461 | 2,150,390 
           |     13.38      13.18 |     13.38 
-----------+----------------------+----------
    70-<80 | 1,732,878     12,031 | 1,744,909 
           |     10.81      24.55 |     10.85 
-----------+----------------------+----------
       80+ |   951,943     25,320 |   977,263 
           |      5.94      51.67 |      6.08 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    death/ITU adm.
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,134,654     23,288 | 8,157,942 
           |     50.76      47.52 |     50.75 
-----------+----------------------+----------
         1 | 7,891,066     25,717 | 7,916,783 
           |     49.24      52.48 |     49.25 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |    death/ITU adm.
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   293,397      3,129 |   296,526 
                     |      1.83       6.39 |      1.84 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 4,555,321     16,979 | 4,572,300 
                     |     28.43      34.65 |     28.44 
---------------------+----------------------+----------
Overweight (25-29.9) | 4,350,804     13,011 | 4,363,815 
                     |     27.15      26.55 |     27.15 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,199,612      6,566 | 2,206,178 
                     |     13.73      13.40 |     13.72 
---------------------+----------------------+----------
  Obese II (35-39.9) |   853,067      2,549 |   855,616 
                     |      5.32       5.20 |      5.32 
---------------------+----------------------+----------
     Obese III (40+) |   430,645      1,389 |   432,034 
                     |      2.69       2.83 |      2.69 
---------------------+----------------------+----------
        Unknown (.u) | 3,342,874      5,382 | 3,348,256 
                     |     20.86      10.98 |     20.83 
---------------------+----------------------+----------
               Total |16,025,720     49,005 |16,074,725 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |    death/ITU adm.
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 7,328,518     15,165 | 7,343,683 
             |     45.73      30.95 |     45.68 
-------------+----------------------+----------
      Former | 5,177,461     26,381 | 5,203,842 
             |     32.31      53.83 |     32.37 
-------------+----------------------+----------
     Current | 2,808,161      7,047 | 2,815,208 
             |     17.52      14.38 |     17.51 
-------------+----------------------+----------
Unknown (.u) |   711,580        412 |   711,992 
             |      4.44       0.84 |      4.43 
-------------+----------------------+----------
       Total |16,025,720     49,005 |16,074,725 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |    death/ITU adm.
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |12,542,396     38,501 |12,580,897 
                     |     78.26      78.57 |     78.27 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,199,612      6,566 | 2,206,178 
                     |     13.73      13.40 |     13.72 
---------------------+----------------------+----------
  Obese II (35-39.9) |   853,067      2,549 |   855,616 
                     |      5.32       5.20 |      5.32 
---------------------+----------------------+----------
     Obese III (40+) |   430,645      1,389 |   432,034 
                     |      2.69       2.83 |      2.69 
---------------------+----------------------+----------
               Total |16,025,720     49,005 |16,074,725 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
  Probable |    death/ITU adm.
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |12,290,892     19,989 |12,310,881 
           |     76.69      40.79 |     76.59 
-----------+----------------------+----------
         1 | 3,734,828     29,016 | 3,763,844 
           |     23.31      59.21 |     23.41 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |    death/ITU adm.
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |15,385,452     37,586 |15,423,038 
           |     96.00      76.70 |     95.95 
-----------+----------------------+----------
         1 |   640,268     11,419 |   651,687 
           |      4.00      23.30 |      4.05 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |    death/ITU adm.
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |13,468,008     42,387 |13,510,395 
           |     84.04      86.50 |     84.05 
-----------+----------------------+----------
         1 | 2,557,712      6,618 | 2,564,330 
           |     15.96      13.50 |     15.95 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |    death/ITU adm.
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |14,972,479     31,010 |15,003,489 
           |     93.43      63.28 |     93.34 
-----------+----------------------+----------
         1 | 1,053,241     17,995 | 1,071,236 
           |      6.57      36.72 |      6.66 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    death/ITU adm.
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |14,439,231     34,067 |14,473,298 
           |     90.10      69.52 |     90.04 
-----------+----------------------+----------
         1 | 1,586,489     14,938 | 1,601,427 
           |      9.90      30.48 |      9.96 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |    death/ITU adm.
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |15,277,116     33,600 |15,310,716 
              |     95.33      68.56 |     95.25 
--------------+----------------------+----------
    Last year |    67,021      4,362 |    71,383 
              |      0.42       8.90 |      0.44 
--------------+----------------------+----------
2-5 years ago |   204,128      4,573 |   208,701 
              |      1.27       9.33 |      1.30 
--------------+----------------------+----------
     5+ years |   477,455      6,470 |   483,925 
              |      2.98      13.20 |      3.01 
--------------+----------------------+----------
        Total |16,025,720     49,005 |16,074,725 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |    death/ITU adm.
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |15,937,143     47,173 |15,984,316 
              |     99.45      96.26 |     99.44 
--------------+----------------------+----------
    Last year |     7,719        390 |     8,109 
              |      0.05       0.80 |      0.05 
--------------+----------------------+----------
2-5 years ago |    24,555        606 |    25,161 
              |      0.15       1.24 |      0.16 
--------------+----------------------+----------
     5+ years |    56,303        836 |    57,139 
              |      0.35       1.71 |      0.36 
--------------+----------------------+----------
        Total |16,025,720     49,005 |16,074,725 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |    death/ITU adm.
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |15,978,423     48,708 |16,027,131 
           |     99.70      99.39 |     99.70 
-----------+----------------------+----------
         1 |    47,297        297 |    47,594 
           |      0.30       0.61 |      0.30 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |    outcome: covid
     organ |    death/ITU adm.
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |16,007,452     48,805 |16,056,257 
           |     99.89      99.59 |     99.89 
-----------+----------------------+----------
         1 |    18,268        200 |    18,468 
           |      0.11       0.41 |      0.11 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    death/ITU adm.
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |16,003,123     48,760 |16,051,883 
           |     99.86      99.50 |     99.86 
-----------+----------------------+----------
         1 |    22,597        245 |    22,842 
           |      0.14       0.50 |      0.14 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |    death/ITU adm.
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,930,520     47,384 |15,977,904 
           |     99.41      96.69 |     99.40 
-----------+----------------------+----------
         1 |    95,200      1,621 |    96,821 
           |      0.59       3.31 |      0.60 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |    death/ITU adm.
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,874,223     46,678 |15,920,901 
           |     99.05      95.25 |     99.04 
-----------+----------------------+----------
         1 |   151,497      2,327 |   153,824 
           |      0.95       4.75 |      0.96 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |    death/ITU adm.
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |15,679,978     40,279 |15,720,257 
           |     97.84      82.19 |     97.79 
-----------+----------------------+----------
         1 |   345,742      8,726 |   354,468 
           |      2.16      17.81 |      2.21 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |    death/ITU adm.
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,445        875 |    13,320 
           |      0.11       1.87 |      0.11 
-----------+----------------------+----------
        15 |    52,073      2,901 |    54,974 
           |      0.44       6.19 |      0.47 
-----------+----------------------+----------
        30 |   216,447      6,395 |   222,842 
           |      1.84      13.64 |      1.89 
-----------+----------------------+----------
        45 |   655,612      8,866 |   664,478 
           |      5.57      18.91 |      5.62 
-----------+----------------------+----------
        60 |10,832,809     27,843 |10,860,652 
           |     92.04      59.39 |     91.91 
-----------+----------------------+----------
     Total |11,769,386     46,880 |11,816,266 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |    death/ITU adm.
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |15,089,143     29,968 |15,119,111 
                      |     94.16      61.15 |     94.06 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   872,059     15,261 |   887,320 
                      |      5.44      31.14 |      5.52 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    64,518      3,776 |    68,294 
                      |      0.40       7.71 |      0.42 
----------------------+----------------------+----------
                Total |16,025,720     49,005 |16,074,725 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |    death/ITU adm.
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |12,738,201     18,703 |12,756,904 
           |     79.49      38.17 |     79.36 
-----------+----------------------+----------
         1 | 3,287,519     30,302 | 3,317,821 
           |     20.51      61.83 |     20.64 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |    death/ITU adm.
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,224,299     44,832 |15,269,131 
           |     95.00      91.48 |     94.99 
-----------+----------------------+----------
         1 |   801,421      4,173 |   805,594 
           |      5.00       8.52 |      5.01 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |    death/ITU adm.
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 3,398,966      9,956 | 3,408,922 
                 |     21.21      20.32 |     21.21 
-----------------+----------------------+----------
               2 | 3,326,554     10,117 | 3,336,671 
                 |     20.76      20.64 |     20.76 
-----------------+----------------------+----------
               3 | 3,296,173     10,232 | 3,306,405 
                 |     20.57      20.88 |     20.57 
-----------------+----------------------+----------
               4 | 3,252,759      9,763 | 3,262,522 
                 |     20.30      19.92 |     20.30 
-----------------+----------------------+----------
 5 most deprived | 2,751,268      8,937 | 2,760,205 
                 |     17.17      18.24 |     17.17 
-----------------+----------------------+----------
           Total |16,025,720     49,005 |16,074,725 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |    death/ITU adm.
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |10,293,910     32,840 |10,326,750 
                      |     64.23      67.01 |     64.24 
----------------------+----------------------+----------
                Mixed |   178,962        168 |   179,130 
                      |      1.12       0.34 |      1.11 
----------------------+----------------------+----------
Asian or Asian Britis |   978,492      1,391 |   979,883 
                      |      6.11       2.84 |      6.10 
----------------------+----------------------+----------
                Black |   354,327        563 |   354,890 
                      |      2.21       1.15 |      2.21 
----------------------+----------------------+----------
                Other |   333,706        275 |   333,981 
                      |      2.08       0.56 |      2.08 
----------------------+----------------------+----------
              Unknown | 3,886,323     13,768 | 3,900,091 
                      |     24.25      28.10 |     24.26 
----------------------+----------------------+----------
                Total |16,025,720     49,005 |16,074,725 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |    outcome: covid
Partnershi |    death/ITU adm.
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |   176,802        447 |   177,249 
           |      1.10       0.91 |      1.10 
-----------+----------------------+----------
         2 | 1,471,965      4,441 | 1,476,406 
           |      9.19       9.06 |      9.18 
-----------+----------------------+----------
         3 |   690,899      2,337 |   693,236 
           |      4.31       4.77 |      4.31 
-----------+----------------------+----------
         4 |   157,010        539 |   157,549 
           |      0.98       1.10 |      0.98 
-----------+----------------------+----------
         5 |   110,327        395 |   110,722 
           |      0.69       0.81 |      0.69 
-----------+----------------------+----------
         6 |   743,349      2,481 |   745,830 
           |      4.64       5.06 |      4.64 
-----------+----------------------+----------
         7 |    44,479        180 |    44,659 
           |      0.28       0.37 |      0.28 
-----------+----------------------+----------
         8 |   588,716      1,909 |   590,625 
           |      3.67       3.90 |      3.67 
-----------+----------------------+----------
         9 |   478,255      1,807 |   480,062 
           |      2.98       3.69 |      2.99 
-----------+----------------------+----------
        10 |   635,484      1,970 |   637,454 
           |      3.97       4.02 |      3.97 
-----------+----------------------+----------
        11 |   697,671      2,003 |   699,674 
           |      4.35       4.09 |      4.35 
-----------+----------------------+----------
        12 |   227,851        803 |   228,654 
           |      1.42       1.64 |      1.42 
-----------+----------------------+----------
        13 |   343,750      1,125 |   344,875 
           |      2.14       2.30 |      2.15 
-----------+----------------------+----------
        14 |   430,806      1,117 |   431,923 
           |      2.69       2.28 |      2.69 
-----------+----------------------+----------
        15 |   557,437      1,400 |   558,837 
           |      3.48       2.86 |      3.48 
-----------+----------------------+----------
        16 |   602,002      2,160 |   604,162 
           |      3.76       4.41 |      3.76 
-----------+----------------------+----------
        17 |   500,743      1,616 |   502,359 
           |      3.12       3.30 |      3.13 
-----------+----------------------+----------
        18 |   678,881      1,683 |   680,564 
           |      4.24       3.43 |      4.23 
-----------+----------------------+----------
        19 |   536,466      1,587 |   538,053 
           |      3.35       3.24 |      3.35 
-----------+----------------------+----------
        20 |   787,435      2,598 |   790,033 
           |      4.91       5.30 |      4.91 
-----------+----------------------+----------
        21 | 1,156,200      1,838 | 1,158,038 
           |      7.21       3.75 |      7.20 
-----------+----------------------+----------
        22 |    74,854        136 |    74,990 
           |      0.47       0.28 |      0.47 
-----------+----------------------+----------
        23 |   620,168      1,981 |   622,149 
           |      3.87       4.04 |      3.87 
-----------+----------------------+----------
        24 |    30,550        109 |    30,659 
           |      0.19       0.22 |      0.19 
-----------+----------------------+----------
        25 |   140,882        466 |   141,348 
           |      0.88       0.95 |      0.88 
-----------+----------------------+----------
        26 |   533,280      1,891 |   535,171 
           |      3.33       3.86 |      3.33 
-----------+----------------------+----------
        27 |   620,911      1,918 |   622,829 
           |      3.87       3.91 |      3.87 
-----------+----------------------+----------
        28 |   533,439      1,887 |   535,326 
           |      3.33       3.85 |      3.33 
-----------+----------------------+----------
        29 |   420,542      1,272 |   421,814 
           |      2.62       2.60 |      2.62 
-----------+----------------------+----------
        30 |   305,931        983 |   306,914 
           |      1.91       2.01 |      1.91 
-----------+----------------------+----------
        31 |    19,421         55 |    19,476 
           |      0.12       0.11 |      0.12 
-----------+----------------------+----------
        32 | 1,109,214      3,871 | 1,113,085 
           |      6.92       7.90 |      6.92 
-----------+----------------------+----------
     Total |16,025,720     49,005 |16,074,725 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |    prob/susp. case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 2,974,403     76,185 | 3,050,588 
           |     19.26      12.11 |     18.98 
-----------+----------------------+----------
    30-<40 | 2,819,384     83,991 | 2,903,375 
           |     18.25      13.35 |     18.06 
-----------+----------------------+----------
    40-<50 | 2,483,381     85,223 | 2,568,604 
           |     16.08      13.55 |     15.98 
-----------+----------------------+----------
    50-<60 | 2,574,322    105,274 | 2,679,596 
           |     16.67      16.73 |     16.67 
-----------+----------------------+----------
    60-<70 | 2,054,179     96,211 | 2,150,390 
           |     13.30      15.29 |     13.38 
-----------+----------------------+----------
    70-<80 | 1,644,352    100,557 | 1,744,909 
           |     10.65      15.98 |     10.85 
-----------+----------------------+----------
       80+ |   895,630     81,633 |   977,263 
           |      5.80      12.98 |      6.08 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,790,518    367,424 | 8,157,942 
           |     50.44      58.41 |     50.75 
-----------+----------------------+----------
         1 | 7,655,133    261,650 | 7,916,783 
           |     49.56      41.59 |     49.25 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |    prob/susp. case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   282,633     13,893 |   296,526 
                     |      1.83       2.21 |      1.84 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 4,397,085    175,215 | 4,572,300 
                     |     28.47      27.85 |     28.44 
---------------------+----------------------+----------
Overweight (25-29.9) | 4,177,233    186,582 | 4,363,815 
                     |     27.04      29.66 |     27.15 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,095,459    110,719 | 2,206,178 
                     |     13.57      17.60 |     13.72 
---------------------+----------------------+----------
  Obese II (35-39.9) |   806,236     49,380 |   855,616 
                     |      5.22       7.85 |      5.32 
---------------------+----------------------+----------
     Obese III (40+) |   403,375     28,659 |   432,034 
                     |      2.61       4.56 |      2.69 
---------------------+----------------------+----------
        Unknown (.u) | 3,283,630     64,626 | 3,348,256 
                     |     21.26      10.27 |     20.83 
---------------------+----------------------+----------
               Total |15,445,651    629,074 |16,074,725 
                     |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |    prob/susp. case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 7,095,183    248,500 | 7,343,683 
             |     45.94      39.50 |     45.68 
-------------+----------------------+----------
      Former | 4,942,093    261,749 | 5,203,842 
             |     32.00      41.61 |     32.37 
-------------+----------------------+----------
     Current | 2,705,647    109,561 | 2,815,208 
             |     17.52      17.42 |     17.51 
-------------+----------------------+----------
Unknown (.u) |   702,728      9,264 |   711,992 
             |      4.55       1.47 |      4.43 
-------------+----------------------+----------
       Total |15,445,651    629,074 |16,074,725 
             |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |    prob/susp. case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |12,140,581    440,316 |12,580,897 
                     |     78.60      69.99 |     78.27 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,095,459    110,719 | 2,206,178 
                     |     13.57      17.60 |     13.72 
---------------------+----------------------+----------
  Obese II (35-39.9) |   806,236     49,380 |   855,616 
                     |      5.22       7.85 |      5.32 
---------------------+----------------------+----------
     Obese III (40+) |   403,375     28,659 |   432,034 
                     |      2.61       4.56 |      2.69 
---------------------+----------------------+----------
               Total |15,445,651    629,074 |16,074,725 
                     |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
  Probable |    prob/susp. case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |11,943,460    367,421 |12,310,881 
           |     77.33      58.41 |     76.59 
-----------+----------------------+----------
         1 | 3,502,191    261,653 | 3,763,844 
           |     22.67      41.59 |     23.41 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
51

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |    prob/susp. case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |14,878,833    544,205 |15,423,038 
           |     96.33      86.51 |     95.95 
-----------+----------------------+----------
         1 |   566,818     84,869 |   651,687 
           |      3.67      13.49 |      4.05 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |    prob/susp. case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |13,028,753    481,642 |13,510,395 
           |     84.35      76.56 |     84.05 
-----------+----------------------+----------
         1 | 2,416,898    147,432 | 2,564,330 
           |     15.65      23.44 |     15.95 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
47

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |    prob/susp. case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |14,468,990    534,499 |15,003,489 
           |     93.68      84.97 |     93.34 
-----------+----------------------+----------
         1 |   976,661     94,575 | 1,071,236 
           |      6.32      15.03 |      6.66 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |13,968,627    504,671 |14,473,298 
           |     90.44      80.22 |     90.04 
-----------+----------------------+----------
         1 | 1,477,024    124,403 | 1,601,427 
           |      9.56      19.78 |      9.96 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
41

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |    prob/susp. case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |14,740,847    569,869 |15,310,716 
              |     95.44      90.59 |     95.25 
--------------+----------------------+----------
    Last year |    63,244      8,139 |    71,383 
              |      0.41       1.29 |      0.44 
--------------+----------------------+----------
2-5 years ago |   191,644     17,057 |   208,701 
              |      1.24       2.71 |      1.30 
--------------+----------------------+----------
     5+ years |   449,916     34,009 |   483,925 
              |      2.91       5.41 |      3.01 
--------------+----------------------+----------
        Total |15,445,651    629,074 |16,074,725 
              |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |    prob/susp. case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |15,367,375    616,941 |15,984,316 
              |     99.49      98.07 |     99.44 
--------------+----------------------+----------
    Last year |     6,721      1,388 |     8,109 
              |      0.04       0.22 |      0.05 
--------------+----------------------+----------
2-5 years ago |    21,250      3,911 |    25,161 
              |      0.14       0.62 |      0.16 
--------------+----------------------+----------
     5+ years |    50,305      6,834 |    57,139 
              |      0.33       1.09 |      0.36 
--------------+----------------------+----------
        Total |15,445,651    629,074 |16,074,725 
              |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |    prob/susp. case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |15,402,330    624,801 |16,027,131 
           |     99.72      99.32 |     99.70 
-----------+----------------------+----------
         1 |    43,321      4,273 |    47,594 
           |      0.28       0.68 |      0.30 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
35

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |    outcome: covid
     organ |    prob/susp. case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |15,430,698    625,559 |16,056,257 
           |     99.90      99.44 |     99.89 
-----------+----------------------+----------
         1 |    14,953      3,515 |    18,468 
           |      0.10       0.56 |      0.11 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |15,427,110    624,773 |16,051,883 
           |     99.88      99.32 |     99.86 
-----------+----------------------+----------
         1 |    18,541      4,301 |    22,842 
           |      0.12       0.68 |      0.14 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
45

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |    prob/susp. case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,357,871    620,033 |15,977,904 
           |     99.43      98.56 |     99.40 
-----------+----------------------+----------
         1 |    87,780      9,041 |    96,821 
           |      0.57       1.44 |      0.60 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
35

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |    prob/susp. case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,304,968    615,933 |15,920,901 
           |     99.09      97.91 |     99.04 
-----------+----------------------+----------
         1 |   140,683     13,141 |   153,824 
           |      0.91       2.09 |      0.96 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |    prob/susp. case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |15,124,617    595,640 |15,720,257 
           |     97.92      94.69 |     97.79 
-----------+----------------------+----------
         1 |   321,034     33,434 |   354,468 
           |      2.08       5.31 |      2.21 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |    prob/susp. case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,875      2,445 |    13,320 
           |      0.10       0.44 |      0.11 
-----------+----------------------+----------
        15 |    48,200      6,774 |    54,974 
           |      0.43       1.22 |      0.47 
-----------+----------------------+----------
        30 |   200,715     22,127 |   222,842 
           |      1.78       3.98 |      1.89 
-----------+----------------------+----------
        45 |   616,784     47,694 |   664,478 
           |      5.48       8.57 |      5.62 
-----------+----------------------+----------
        60 |10,383,384    477,268 |10,860,652 
           |     92.22      85.79 |     91.91 
-----------+----------------------+----------
     Total |11,259,958    556,308 |11,816,266 
           |    100.00     100.00 |    100.00 
47

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |    prob/susp. case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |14,569,077    550,034 |15,119,111 
                      |     94.32      87.44 |     94.06 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   817,499     69,821 |   887,320 
                      |      5.29      11.10 |      5.52 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    59,075      9,219 |    68,294 
                      |      0.38       1.47 |      0.42 
----------------------+----------------------+----------
                Total |15,445,651    629,074 |16,074,725 
                      |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |    prob/susp. case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |12,343,371    413,533 |12,756,904 
           |     79.91      65.74 |     79.36 
-----------+----------------------+----------
         1 | 3,102,280    215,541 | 3,317,821 
           |     20.09      34.26 |     20.64 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |    prob/susp. case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |14,697,004    572,127 |15,269,131 
           |     95.15      90.95 |     94.99 
-----------+----------------------+----------
         1 |   748,647     56,947 |   805,594 
           |      4.85       9.05 |      5.01 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |    prob/susp. case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 3,286,880    122,042 | 3,408,922 
                 |     21.28      19.40 |     21.21 
-----------------+----------------------+----------
               2 | 3,212,003    124,668 | 3,336,671 
                 |     20.80      19.82 |     20.76 
-----------------+----------------------+----------
               3 | 3,174,618    131,787 | 3,306,405 
                 |     20.55      20.95 |     20.57 
-----------------+----------------------+----------
               4 | 3,128,933    133,589 | 3,262,522 
                 |     20.26      21.24 |     20.30 
-----------------+----------------------+----------
 5 most deprived | 2,643,217    116,988 | 2,760,205 
                 |     17.11      18.60 |     17.17 
-----------------+----------------------+----------
           Total |15,445,651    629,074 |16,074,725 
                 |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |    prob/susp. case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 9,900,013    426,737 |10,326,750 
                      |     64.10      67.84 |     64.24 
----------------------+----------------------+----------
                Mixed |   172,926      6,204 |   179,130 
                      |      1.12       0.99 |      1.11 
----------------------+----------------------+----------
Asian or Asian Britis |   942,202     37,681 |   979,883 
                      |      6.10       5.99 |      6.10 
----------------------+----------------------+----------
                Black |   340,391     14,499 |   354,890 
                      |      2.20       2.30 |      2.21 
----------------------+----------------------+----------
                Other |   325,862      8,119 |   333,981 
                      |      2.11       1.29 |      2.08 
----------------------+----------------------+----------
              Unknown | 3,764,257    135,834 | 3,900,091 
                      |     24.37      21.59 |     24.26 
----------------------+----------------------+----------
                Total |15,445,651    629,074 |16,074,725 
                      |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |    outcome: covid
Partnershi |    prob/susp. case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |   171,747      5,502 |   177,249 
           |      1.11       0.87 |      1.10 
-----------+----------------------+----------
         2 | 1,402,978     73,428 | 1,476,406 
           |      9.08      11.67 |      9.18 
-----------+----------------------+----------
         3 |   660,300     32,936 |   693,236 
           |      4.27       5.24 |      4.31 
-----------+----------------------+----------
         4 |   154,294      3,255 |   157,549 
           |      1.00       0.52 |      0.98 
-----------+----------------------+----------
         5 |   105,933      4,789 |   110,722 
           |      0.69       0.76 |      0.69 
-----------+----------------------+----------
         6 |   720,742     25,088 |   745,830 
           |      4.67       3.99 |      4.64 
-----------+----------------------+----------
         7 |    44,239        420 |    44,659 
           |      0.29       0.07 |      0.28 
-----------+----------------------+----------
         8 |   572,858     17,767 |   590,625 
           |      3.71       2.82 |      3.67 
-----------+----------------------+----------
         9 |   463,632     16,430 |   480,062 
           |      3.00       2.61 |      2.99 
-----------+----------------------+----------
        10 |   616,150     21,304 |   637,454 
           |      3.99       3.39 |      3.97 
-----------+----------------------+----------
        11 |   677,144     22,530 |   699,674 
           |      4.38       3.58 |      4.35 
-----------+----------------------+----------
        12 |   222,445      6,209 |   228,654 
           |      1.44       0.99 |      1.42 
-----------+----------------------+----------
        13 |   326,040     18,835 |   344,875 
           |      2.11       2.99 |      2.15 
-----------+----------------------+----------
        14 |   416,625     15,298 |   431,923 
           |      2.70       2.43 |      2.69 
-----------+----------------------+----------
        15 |   539,222     19,615 |   558,837 
           |      3.49       3.12 |      3.48 
-----------+----------------------+----------
        16 |   571,326     32,836 |   604,162 
           |      3.70       5.22 |      3.76 
-----------+----------------------+----------
        17 |   490,831     11,528 |   502,359 
           |      3.18       1.83 |      3.13 
-----------+----------------------+----------
        18 |   647,994     32,570 |   680,564 
           |      4.20       5.18 |      4.23 
-----------+----------------------+----------
        19 |   505,674     32,379 |   538,053 
           |      3.27       5.15 |      3.35 
-----------+----------------------+----------
        20 |   757,394     32,639 |   790,033 
           |      4.90       5.19 |      4.91 
-----------+----------------------+----------
        21 | 1,119,982     38,056 | 1,158,038 
           |      7.25       6.05 |      7.20 
-----------+----------------------+----------
        22 |    74,319        671 |    74,990 
           |      0.48       0.11 |      0.47 
-----------+----------------------+----------
        23 |   599,531     22,618 |   622,149 
           |      3.88       3.60 |      3.87 
-----------+----------------------+----------
        24 |    30,122        537 |    30,659 
           |      0.20       0.09 |      0.19 
-----------+----------------------+----------
        25 |   137,089      4,259 |   141,348 
           |      0.89       0.68 |      0.88 
-----------+----------------------+----------
        26 |   518,611     16,560 |   535,171 
           |      3.36       2.63 |      3.33 
-----------+----------------------+----------
        27 |   596,501     26,328 |   622,829 
           |      3.86       4.19 |      3.87 
-----------+----------------------+----------
        28 |   510,966     24,360 |   535,326 
           |      3.31       3.87 |      3.33 
-----------+----------------------+----------
        29 |   403,051     18,763 |   421,814 
           |      2.61       2.98 |      2.62 
-----------+----------------------+----------
        30 |   291,448     15,466 |   306,914 
           |      1.89       2.46 |      1.91 
-----------+----------------------+----------
        31 |    18,954        522 |    19,476 
           |      0.12       0.08 |      0.12 
-----------+----------------------+----------
        32 | 1,077,509     35,576 | 1,113,085 
           |      6.98       5.66 |      6.92 
-----------+----------------------+----------
     Total |15,445,651    629,074 |16,074,725 
           |    100.00     100.00 |    100.00 

. 
. 
. ********************************************
. *  Cumulative incidence of ONS COVID DEATH /ICNARC ITU ADM.*
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_death_itu.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_death_itu
   analysis time _t:  (stime_covid_death_itu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.6e+06       31              0.0000    0.0000     0.0000    0.0000
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80   1.5e+06       82              0.0001    0.0000     0.0000    0.0001
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.5e+06      150              0.0001    0.0000     0.0001    0.0001
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06      188              0.0001    0.0000     0.0001    0.0001
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.2e+06      376              0.0003    0.0000     0.0003    0.0003
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06      539              0.0004    0.0000     0.0004    0.0004
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06      975              0.0007    0.0000     0.0007    0.0008
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06     1498              0.0011    0.0000     0.0011    0.0012
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80   1.1e+06     1764              0.0016    0.0000     0.0015    0.0017
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80   1.1e+06     2836              0.0027    0.0001     0.0026    0.0028
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    909792     3582              0.0039    0.0001     0.0038    0.0041
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    825386     4873              0.0059    0.0001     0.0057    0.0060
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    557258     9486              0.0167    0.0002     0.0164    0.0170
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    399465     8374              0.0205    0.0002     0.0200    0.0209
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. ***************************************
. *  Cumulative incidence of TPP COVID PROB/SUSP CASES *
. ***************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob_or_susp.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_tpp_prob_or_susp
   analysis time _t:  (stime_covid_tpp_prob_or_susp-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.5e+06    32278              0.0208    0.0001     0.0205    0.0210
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80   1.5e+06    16369              0.0109    0.0001     0.0108    0.0111
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.4e+06    35376              0.0243    0.0001     0.0241    0.0246
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06    20348              0.0140    0.0001     0.0139    0.0142
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.2e+06    34755              0.0278    0.0001     0.0275    0.0281
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06    22646              0.0172    0.0001     0.0170    0.0174
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06    40972              0.0309    0.0002     0.0306    0.0312
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06    29557              0.0218    0.0001     0.0216    0.0221
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80   1.1e+06    34012              0.0312    0.0002     0.0309    0.0315
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80   1.0e+06    30110              0.0285    0.0002     0.0282    0.0288
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    876123    34074              0.0374    0.0002     0.0370    0.0378
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    794283    31899              0.0386    0.0002     0.0382    0.0390
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    527820    30366              0.0542    0.0003     0.0537    0.0548
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    377336    23295              0.0579    0.0004     0.0572    0.0587
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. ***************************************
. *  Cumulative incidence of TPP COVID PROBABLE CASES *
. ***************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.6e+06      903              0.0006    0.0000     0.0005    0.0006
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80   1.5e+06      430              0.0003    0.0000     0.0003    0.0003
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.5e+06     1348              0.0009    0.0000     0.0009    0.0010
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06      839              0.0006    0.0000     0.0005    0.0006
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.2e+06     1616              0.0013    0.0000     0.0012    0.0014
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     1167              0.0009    0.0000     0.0008    0.0009
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     2085              0.0016    0.0000     0.0015    0.0016
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06     1890              0.0014    0.0000     0.0013    0.0015
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80   1.1e+06     1529              0.0014    0.0000     0.0013    0.0015
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80   1.1e+06     1779              0.0017    0.0000     0.0016    0.0018
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    908405     1593              0.0017    0.0000     0.0017    0.0018
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    823860     2010              0.0024    0.0001     0.0023    0.0025
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    555474     2191              0.0039    0.0001     0.0038    0.0041
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    397901     2159              0.0054    0.0001     0.0052    0.0056
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\04a_an_descriptive_tables.l
> og
  log type:  text
 closed on:  20 Jul 2020, 23:11:02
-----------------------------------------------------------------------------------------------
