-----------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_non_co
> vid_death.log
  log type:  text
 opened on:  20 Jul 2020, 23:23:58

. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(strin
> g)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                                        ///
>                         i.male                                                  ///
>                         `bmi'                                   ///
>                         `smoking'                                       ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         i.tot_people_hh                         ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_size)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. foreach exposure_type in kids_cat3  ///
>                 gp_number_kids {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(
> i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.obese4cat) smoking(
> i.smoke_nomiss)
  9. if _rc==0{
 10. estimates
 11. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth, replace
 12. *estat concordance /*c-statistic*/
.  }
 13.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 14. 
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.bmicat) smoking(i.s
> moke)
 15. if _rc==0{
 16. estimates
 17. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth_bmi_smok, 
> replace
 18. *estat concordance /*c-statistic*/
.  }
 19.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 20.  
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.bmicat) smoking(i.s
> moke)
 21. if _rc==0{
 22. estimates
 23. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCnoeth_bmi_smok
> , replace
 24. *estat concordance /*c-statistic*/
.  }
 25.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 26.  
. }
   1:   4414.55 /        1 =    4414.5510

-----------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,074,725             Number of obs    =  16,074,725
No. of failures      =       47,270
Time at risk         =   2181955118
                                                Wald chi2(9)     =    42428.44
Log pseudolikelihood =   -563277.23             Prob > chi2      =      0.0000

                               (Std. Err. adjusted for 10 clusters in household_size)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   .4223373   .0879514    -4.14   0.000     .2808002    .6352162
     Kids under 18  |   .5077891   .0858347    -4.01   0.000     .3645856    .7072407
                    |
               age1 |    1.19053   .0605389     3.43   0.001     1.077597    1.315298
               age2 |   .8352135   .1055206    -1.43   0.154     .6520141    1.069887
               age3 |    1.56775   .4577699     1.54   0.124     .8845718    2.778565
             1.male |   1.340922   .0975808     4.03   0.000      1.16268    1.546488
                    |
          obese4cat |
 Obese I (30-34.9)  |   .8330214   .0115321   -13.20   0.000     .8107228    .8559333
Obese II (35-39.9)  |   1.021789   .0158508     1.39   0.165     .9911895    1.053333
   Obese III (40+)  |   1.492481   .0476348    12.55   0.000     1.401979    1.588825
                    |
       smoke_nomiss |
            Former  |   1.420793   .0317859    15.70   0.000      1.35984    1.484478
           Current  |   2.513093    .070398    32.90   0.000     2.378835    2.654928
                    |
                imd |
                 2  |   1.105302   .0234912     4.71   0.000     1.060206    1.152316
                 3  |   1.215072   .0360864     6.56   0.000     1.146363    1.287899
                 4  |   1.338933   .0560916     6.97   0.000     1.233387     1.45351
   5 most deprived  |   1.602442   .0997098     7.58   0.000     1.418461    1.810286
                    |
      tot_people_hh |
                 2  |   .8980716    .037782    -2.56   0.011      .826991    .9752616
                 3  |   1.149658   .0689389     2.33   0.020     1.022178    1.293037
                 4  |   1.395463   .0988494     4.70   0.000      1.21457    1.603298
                 5  |   2.508547   .3891311     5.93   0.000     1.850896    3.399871
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth.ster saved
   1:   4121.87 /        1 =    4121.8740

-----------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,174,634             Number of obs    =  12,174,634
No. of failures      =       33,837
Time at risk         =   1652718458
                                                Wald chi2(9)     =     1298.80
Log pseudolikelihood =   -394043.16             Prob > chi2      =      0.0000

                                   (Std. Err. adjusted for 10 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              kids_cat3 |
         Kids under 12  |   .4418015   .0849977    -4.25   0.000      .303016    .6441528
         Kids under 18  |   .5121359   .0808049    -4.24   0.000     .3759088    .6977308
                        |
                   age1 |   1.213011   .0653514     3.58   0.000     1.091455    1.348104
                   age2 |   .7986468   .1075186    -1.67   0.095     .6134242    1.039797
                   age3 |   1.745217   .5455637     1.78   0.075     .9457132    3.220619
                 1.male |   1.386953   .0933497     4.86   0.000     1.215545    1.582531
                        |
              obese4cat |
     Obese I (30-34.9)  |   .8255553   .0119164   -13.28   0.000     .8025269    .8492444
    Obese II (35-39.9)  |   1.022569   .0290705     0.79   0.432     .9671498    1.081163
       Obese III (40+)  |   1.472303   .0595267     9.57   0.000     1.360136    1.593721
                        |
           smoke_nomiss |
                Former  |    1.41068   .0409149    11.86   0.000     1.332725    1.493195
               Current  |   2.510493   .1024165    22.56   0.000     2.317576    2.719469
                        |
              ethnicity |
                 Mixed  |   .8092139   .1061816    -1.61   0.107     .6257088    1.046536
Asian or Asian British  |   .7755421   .0782838    -2.52   0.012      .636333    .9452057
                 Black  |    .837472   .0404932    -3.67   0.000     .7617514    .9207196
                 Other  |   .6120527   .0717688    -4.19   0.000     .4863821    .7701939
                        |
                    imd |
                     2  |   1.129825    .018594     7.42   0.000     1.093963    1.166863
                     3  |   1.226424   .0357274     7.01   0.000     1.158361    1.298486
                     4  |   1.370075   .0588777     7.33   0.000     1.259403    1.490473
       5 most deprived  |   1.659843   .1119744     7.51   0.000     1.454267    1.894479
                        |
          tot_people_hh |
                     2  |   .8851352   .0358295    -3.01   0.003     .8176241    .9582207
                     3  |   1.165366    .069507     2.57   0.010     1.036796    1.309879
                     4  |   1.431227   .1054401     4.87   0.000     1.238795     1.65355
                     5  |   2.555308    .384015     6.24   0.000     1.903371    3.430543
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth.ster saved
   1:   3841.91 /        1 =    3841.9100

-----------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   10,271,116             Number of obs    =  10,271,116
No. of failures      =       31,091
Time at risk         =   1394083104
                                                Wald chi2(9)     =     1657.42
Log pseudolikelihood =   -358237.55             Prob > chi2      =      0.0000

                                   (Std. Err. adjusted for 10 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              kids_cat3 |
         Kids under 12  |   .4811075   .0901654    -3.90   0.000     .3332089    .6946526
         Kids under 18  |   .5199875   .0835534    -4.07   0.000     .3795062    .7124705
                        |
                   age1 |    1.23844   .0542052     4.89   0.000      1.13663    1.349371
                   age2 |   .7682847   .0880158    -2.30   0.021     .6137723    .9616943
                   age3 |   1.877452   .5065977     2.33   0.020     1.106335    3.186036
                 1.male |   1.517652   .0942905     6.71   0.000     1.343654    1.714181
                        |
                 bmicat |
    Normal (18.5-24.9)  |   .4186171   .0191022   -19.08   0.000     .3828029    .4577819
  Overweight (25-29.9)  |   .2797284   .0152889   -23.31   0.000     .2513119    .3113581
     Obese I (30-34.9)  |   .3013942   .0198305   -18.23   0.000     .2649288    .3428788
    Obese II (35-39.9)  |   .3741074   .0254137   -14.47   0.000     .3274711    .4273854
       Obese III (40+)  |   .5384317   .0264536   -12.60   0.000     .4890017    .5928583
                        |
                  smoke |
                Former  |   1.428982   .0399848    12.76   0.000     1.352723    1.509539
               Current  |   2.332156    .085643    23.06   0.000     2.170197    2.506202
                        |
              ethnicity |
                 Mixed  |   .8305058   .0911206    -1.69   0.091     .6698096    1.029755
Asian or Asian British  |   .7799141   .0749377    -2.59   0.010     .6460401    .9415299
                 Black  |   .8942818   .0426313    -2.34   0.019     .8145107    .9818654
                 Other  |   .6378778   .0763716    -3.76   0.000     .5044583    .8065844
                        |
                    imd |
                     2  |   1.130084   .0177588     7.78   0.000     1.095808    1.165432
                     3  |   1.223822   .0356432     6.93   0.000     1.155919    1.295713
                     4  |   1.366476   .0582685     7.32   0.000     1.256914    1.485588
       5 most deprived  |   1.649724   .1149176     7.19   0.000     1.439188    1.891058
                        |
          tot_people_hh |
                     2  |   .8941019   .0349544    -2.86   0.004     .8281514    .9653044
                     3  |   1.167227   .0664896     2.71   0.007     1.043921    1.305097
                     4  |   1.436754   .0994185     5.24   0.000     1.254534    1.645443
                     5  |   2.475907    .337249     6.66   0.000      1.89579    3.233542
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok.ster not 
> found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:   3884.74 /        1 =    3884.7360

-----------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,626,021             Number of obs    =  12,626,021
No. of failures      =       41,986
Time at risk         =   1713391104
                                                Wald chi2(9)     =   172812.25
Log pseudolikelihood =   -493421.45             Prob > chi2      =      0.0000

                                 (Std. Err. adjusted for 10 clusters in household_size)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
            kids_cat3 |
       Kids under 12  |   .4605502   .0931999    -3.83   0.000     .3097579    .6847494
       Kids under 18  |   .5200932   .0896308    -3.79   0.000     .3710125    .7290777
                      |
                 age1 |   1.219002   .0527284     4.58   0.000     1.119916    1.326855
                 age2 |     .79769   .0899476    -2.00   0.045     .6395177    .9949831
                 age3 |   1.714372   .4532335     2.04   0.041     1.021105    2.878324
               1.male |   1.478484   .0978915     5.91   0.000     1.298548    1.683353
                      |
               bmicat |
  Normal (18.5-24.9)  |    .419968   .0221206   -16.47   0.000     .3787752    .4656405
Overweight (25-29.9)  |   .2820644   .0189708   -18.82   0.000     .2472288    .3218085
   Obese I (30-34.9)  |   .3030728   .0231717   -15.61   0.000     .2608961    .3520677
  Obese II (35-39.9)  |   .3720386   .0252851   -14.55   0.000     .3256395    .4250489
     Obese III (40+)  |   .5423572   .0280456   -11.83   0.000     .4900826    .6002077
                      |
                smoke |
              Former  |   1.431265   .0317084    16.18   0.000     1.370448    1.494782
             Current  |   2.334154   .0611595    32.35   0.000     2.217309    2.457155
                      |
                  imd |
                   2  |   1.102997   .0208225     5.19   0.000     1.062931    1.144572
                   3  |    1.21471   .0344272     6.86   0.000     1.149074    1.284095
                   4  |   1.336917    .055191     7.03   0.000     1.233005    1.449586
     5 most deprived  |   1.600026   .1053887     7.14   0.000     1.406245     1.82051
                      |
        tot_people_hh |
                   2  |   .9033221   .0369378    -2.49   0.013     .8337505     .978699
                   3  |   1.164804     .06709     2.65   0.008      1.04046    1.304007
                   4  |   1.420312   .0947896     5.26   0.000     1.246165    1.618794
                   5  |   2.459896   .3406524     6.50   0.000     1.875168    3.226957
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok.ster no
> t found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok.ster saved
   1:   4582.93 /        1 =    4582.9340

-----------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,074,725             Number of obs    =  16,074,725
No. of failures      =       47,270
Time at risk         =   2181955118
                                                Wald chi2(9)     =    12863.55
Log pseudolikelihood =    -563259.1             Prob > chi2      =      0.0000

                               (Std. Err. adjusted for 10 clusters in household_size)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
     gp_number_kids |
    only >12 years  |   .5058384   .0848262    -4.06   0.000     .3641415    .7026734
       1 child <12  |   .4803179   .0903976    -3.90   0.000     .3321464    .6945891
    2 children <12  |    .362107   .0822275    -4.47   0.000     .2320307     .565104
   3+ children <12  |   .3096626   .0726499    -5.00   0.000     .1955188    .4904434
                    |
               age1 |   1.188695    .060381     3.40   0.001     1.076051    1.313131
               age2 |   .8374104    .105404    -1.41   0.159     .6543324    1.071712
               age3 |   1.559616   .4531967     1.53   0.126      .882417    2.756524
             1.male |   1.341326    .097369     4.05   0.000     1.163441    1.546409
                    |
          obese4cat |
 Obese I (30-34.9)  |   .8330476   .0115353   -13.19   0.000     .8107429     .855966
Obese II (35-39.9)  |   1.021674   .0158988     1.38   0.168     .9909838    1.053315
   Obese III (40+)  |   1.491997   .0477904    12.49   0.000     1.401209    1.588667
                    |
       smoke_nomiss |
            Former  |   1.420698   .0317563    15.71   0.000     1.359801    1.484323
           Current  |   2.511917   .0708712    32.65   0.000     2.376783    2.654735
                    |
                imd |
                 2  |   1.105216   .0234686     4.71   0.000     1.060163    1.152185
                 3  |   1.214886    .036035     6.56   0.000     1.146272    1.287607
                 4  |    1.33879    .056031     6.97   0.000     1.233355    1.453239
   5 most deprived  |   1.602942   .0997591     7.58   0.000     1.418872    1.810891
                    |
      tot_people_hh |
                 2  |   .8978412   .0377049    -2.57   0.010     .8269005     .974868
                 3  |   1.145971   .0688237     2.27   0.023     1.018715    1.289123
                 4  |   1.389477   .0977916     4.67   0.000     1.210441    1.594994
                 5  |    2.52896    .398655     5.89   0.000     1.856787    3.444466
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_noeth.ster not foun
> d)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_noeth.ster saved
   1:   4219.80 /        1 =    4219.7950

-----------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,174,634             Number of obs    =  12,174,634
No. of failures      =       33,837
Time at risk         =   1652718458
                                                Wald chi2(9)     =      341.16
Log pseudolikelihood =   -394032.22             Prob > chi2      =      0.0000

                                   (Std. Err. adjusted for 10 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |   .5102254   .0799379    -4.29   0.000      .375321    .6936195
           1 child <12  |   .4961778    .086427    -4.02   0.000     .3526715    .6980787
        2 children <12  |    .376528    .079691    -4.62   0.000     .2486813    .5701005
       3+ children <12  |   .3588979   .0812488    -4.53   0.000     .2302886    .5593318
                        |
                   age1 |   1.210902   .0652541     3.55   0.000     1.089529    1.345796
                   age2 |   .8010843   .1075245    -1.65   0.098     .6157817    1.042149
                   age3 |   1.734553     .53992     1.77   0.077      .942391    3.192595
                 1.male |   1.387332   .0931507     4.88   0.000     1.216263    1.582462
                        |
              obese4cat |
     Obese I (30-34.9)  |    .825561   .0119118   -13.29   0.000     .8025412     .849241
    Obese II (35-39.9)  |   1.022487   .0290866     0.78   0.434      .967038    1.081114
       Obese III (40+)  |   1.471791   .0596538     9.54   0.000     1.359395     1.59348
                        |
           smoke_nomiss |
                Former  |   1.410779   .0409114    11.87   0.000      1.33283    1.493286
               Current  |   2.509523   .1027533    22.47   0.000        2.316    2.719218
                        |
              ethnicity |
                 Mixed  |   .8097905   .1059419    -1.61   0.107     .6266328    1.046483
Asian or Asian British  |    .777529   .0783599    -2.50   0.013     .6381635      .94733
                 Black  |   .8385841   .0404286    -3.65   0.000      .762974    .9216871
                 Other  |   .6124456   .0716113    -4.19   0.000     .4870116    .7701862
                        |
                    imd |
                     2  |    1.12973   .0185685     7.42   0.000     1.093917    1.166717
                     3  |   1.226138    .035662     7.01   0.000     1.158197    1.298065
                     4  |   1.369678   .0587233     7.34   0.000     1.259285    1.489747
       5 most deprived  |   1.659775   .1119152     7.51   0.000     1.454302     1.89428
                        |
          tot_people_hh |
                     2  |   .8848798   .0357455    -3.03   0.002     .8175216     .957788
                     3  |   1.161499   .0694708     2.50   0.012     1.033017    1.305962
                     4  |   1.426776   .1044834     4.85   0.000      1.23601    1.646985
                     5  |   2.573231   .3914095     6.21   0.000     1.909871    3.466997
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth.ster not foun
> d)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth.ster saved
   1:   3896.02 /        1 =    3896.0200

-----------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   10,271,116             Number of obs    =  10,271,116
No. of failures      =       31,091
Time at risk         =   1394083104
                                                Wald chi2(9)     =     1684.72
Log pseudolikelihood =   -358229.54             Prob > chi2      =      0.0000

                                   (Std. Err. adjusted for 10 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |   .5182607   .0827353    -4.12   0.000     .3790201    .7086542
           1 child <12  |   .5338364   .0914238    -3.67   0.000     .3816217    .7467639
        2 children <12  |   .4139733   .0866196    -4.22   0.000     .2747055    .6238459
       3+ children <12  |    .405245   .0897087    -4.08   0.000      .262596    .6253847
                        |
                   age1 |    1.23571   .0544156     4.81   0.000      1.13353    1.347101
                   age2 |   .7713998   .0885518    -2.26   0.024     .6159806    .9660332
                   age3 |   1.861845   .5026409     2.30   0.021     1.096845    3.160398
                 1.male |   1.518004   .0941054     6.73   0.000     1.344326    1.714121
                        |
                 bmicat |
    Normal (18.5-24.9)  |   .4187408   .0191045   -19.08   0.000      .382922    .4579101
  Overweight (25-29.9)  |   .2798251   .0152993   -23.29   0.000     .2513898    .3114768
     Obese I (30-34.9)  |   .3014794   .0198225   -18.24   0.000     .2650272    .3429453
    Obese II (35-39.9)  |   .3741804   .0253954   -14.48   0.000     .3275749    .4274167
       Obese III (40+)  |   .5384011   .0264313   -12.61   0.000     .4890109    .5927797
                        |
                  smoke |
                Former  |   1.429064   .0399731    12.76   0.000     1.352827    1.509597
               Current  |   2.331416   .0859215    22.97   0.000     2.168952    2.506051
                        |
              ethnicity |
                 Mixed  |   .8311358    .090868    -1.69   0.091     .6708265    1.029755
Asian or Asian British  |   .7819671   .0751443    -2.56   0.010     .6477255    .9440304
                 Black  |   .8953416   .0425355    -2.33   0.020     .8157372    .9827142
                 Other  |   .6382705   .0762191    -3.76   0.000      .505078    .8065867
                        |
                    imd |
                     2  |   1.129996   .0177332     7.79   0.000     1.095769    1.165293
                     3  |   1.223514   .0355703     6.94   0.000     1.155747    1.295255
                     4  |   1.366068   .0581107     7.33   0.000     1.256792    1.484846
       5 most deprived  |   1.649612    .114853     7.19   0.000     1.439188    1.890802
                        |
          tot_people_hh |
                     2  |    .893842   .0348715    -2.88   0.004     .8280429    .9648698
                     3  |    1.16369   .0665902     2.65   0.008     1.040229    1.301805
                     4  |    1.43312   .0987556     5.22   0.000     1.252065    1.640357
                     5  |   2.491631   .3439567     6.61   0.000      1.90099    3.265786
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster
>  not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:   4148.12 /        1 =    4148.1220

-----------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,626,021             Number of obs    =  12,626,021
No. of failures      =       41,986
Time at risk         =   1713391104
                                                Wald chi2(9)     =    51408.13
Log pseudolikelihood =   -493407.26             Prob > chi2      =      0.0000

                                 (Std. Err. adjusted for 10 clusters in household_size)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
       gp_number_kids |
      only >12 years  |   .5182164   .0886553    -3.84   0.000     .3705864    .7246575
         1 child <12  |   .5187471   .0954081    -3.57   0.000      .361745    .7438901
      2 children <12  |   .4008674     .08872    -4.13   0.000     .2597842    .6185698
     3+ children <12  |   .3383522   .0784767    -4.67   0.000     .2147549    .5330831
                      |
                 age1 |   1.216004   .0531106     4.48   0.000     1.116241    1.324684
                 age2 |    .801286   .0907392    -1.96   0.050     .6417942    1.000413
                 age3 |   1.698566   .4501339     2.00   0.046     1.010432     2.85534
               1.male |   1.478935   .0976517     5.93   0.000     1.299408    1.683265
                      |
               bmicat |
  Normal (18.5-24.9)  |    .420117   .0221204   -16.47   0.000      .378924    .4657882
Overweight (25-29.9)  |   .2821832   .0189772   -18.81   0.000     .2473357    .3219404
   Obese I (30-34.9)  |   .3031808    .023165   -15.62   0.000     .2610144    .3521592
  Obese II (35-39.9)  |    .372117   .0252693   -14.56   0.000     .3257445    .4250911
     Obese III (40+)  |    .542359   .0280265   -11.84   0.000     .4901182     .600168
                      |
                smoke |
              Former  |    1.43115   .0316886    16.19   0.000      1.37037    1.494626
             Current  |   2.333138   .0616013    32.09   0.000     2.215473    2.457053
                      |
                  imd |
                   2  |   1.102904   .0207986     5.19   0.000     1.062883    1.144431
                   3  |   1.214506    .034371     6.87   0.000     1.148975    1.283775
                   4  |    1.33674   .0551263     7.04   0.000     1.232946    1.449272
     5 most deprived  |   1.600534   .1054697     7.14   0.000      1.40661    1.821194
                      |
        tot_people_hh |
                   2  |    .903074   .0368499    -2.50   0.012     .8336622    .9782652
                   3  |   1.161218   .0670753     2.59   0.010     1.036921    1.300414
                   4  |   1.414419   .0938607     5.22   0.000     1.241917    1.610882
                   5  |   2.479635   .3497717     6.44   0.000     1.880698    3.269311
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.st
> er not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster save
> d

. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
(0 observations deleted)

. foreach exposure_type in kids_cat3   {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(
> i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_12mo, repl
> ace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. 
. 
. *Which variable is flipping the ORs
. 
. *Add obesity
. capture stcox   `exposure' age1 age2 age3 i.male i.obese4cat, strata(stp) vce(cluster household_size)
  9. 
. *Add smoking
. capture stcox   `exposure' age1 age2 age3 i.male  i.smoke_nomiss ///
>                         , strata(stp) vce(cluster household_size)
 10. 
. *Add imd
. capture stcox   `exposure' age1 age2 age3 i.male ///
>                         i.imd, strata(stp) vce(cluster household_size)
 11.                         
. *Add total in hh
. capture stcox   `exposure' age1 age2 age3 i.male ///
>                         i.tot_people_hh, strata(stp) vce(cluster household_size)
 12. 
. }                       
   1:   4429.94 /        1 =    4429.9370

-----------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,074,725             Number of obs    =  16,074,725
No. of failures      =       47,270
Time at risk         =   2181955118
                                                Wald chi2(9)     =    42428.44
Log pseudolikelihood =   -563277.23             Prob > chi2      =      0.0000

                               (Std. Err. adjusted for 10 clusters in household_size)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   .4223373   .0879514    -4.14   0.000     .2808002    .6352162
     Kids under 18  |   .5077891   .0858347    -4.01   0.000     .3645856    .7072407
                    |
               age1 |    1.19053   .0605389     3.43   0.001     1.077597    1.315298
               age2 |   .8352135   .1055206    -1.43   0.154     .6520141    1.069887
               age3 |    1.56775   .4577699     1.54   0.124     .8845718    2.778565
             1.male |   1.340922   .0975808     4.03   0.000      1.16268    1.546488
                    |
          obese4cat |
 Obese I (30-34.9)  |   .8330214   .0115321   -13.20   0.000     .8107228    .8559333
Obese II (35-39.9)  |   1.021789   .0158508     1.39   0.165     .9911895    1.053333
   Obese III (40+)  |   1.492481   .0476348    12.55   0.000     1.401979    1.588825
                    |
       smoke_nomiss |
            Former  |   1.420793   .0317859    15.70   0.000      1.35984    1.484478
           Current  |   2.513093    .070398    32.90   0.000     2.378835    2.654928
                    |
                imd |
                 2  |   1.105302   .0234912     4.71   0.000     1.060206    1.152316
                 3  |   1.215072   .0360864     6.56   0.000     1.146363    1.287899
                 4  |   1.338933   .0560916     6.97   0.000     1.233387     1.45351
   5 most deprived  |   1.602442   .0997098     7.58   0.000     1.418461    1.810286
                    |
      tot_people_hh |
                 2  |   .8980716    .037782    -2.56   0.011      .826991    .9752616
                 3  |   1.149658   .0689389     2.33   0.020     1.022178    1.293037
                 4  |   1.395463   .0988494     4.70   0.000      1.21457    1.603298
                 5  |   2.508547   .3891311     5.93   0.000     1.850896    3.399871
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_12mo.ster not foun
> d)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_12mo.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_non_co
> vid_death.log
  log type:  text
 closed on:  21 Jul 2020, 10:43:50
-----------------------------------------------------------------------------------------------------------
