----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\03a_an_descriptive_tables.log
  log type:  text
 opened on:  24 Jul 2020, 14:02:38

. 
. use $tempdir\analysis_dataset, clear

. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 12,490,808    41.22704     13.4166         18         65

. safetab agegroup
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  3,032,196       24.28       24.28
     30-<40 |  2,886,627       23.11       47.39
     40-<50 |  2,557,818       20.48       67.86
     50-<60 |  2,673,513       21.40       89.27
     60-<70 |  1,340,654       10.73      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. safetab age66
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,490,808      100.00      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. safetab male
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  6,237,792       49.94       49.94
          1 |  6,253,016       50.06      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. safetab bmicat
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    235,047        2.48        2.48
  Normal (18.5-24.9) |  3,556,712       37.52       40.00
Overweight (25-29.9) |  3,099,671       32.70       72.70
   Obese I (30-34.9) |  1,584,164       16.71       89.42
  Obese II (35-39.9) |    650,755        6.87       96.28
     Obese III (40+) |    352,451        3.72      100.00
---------------------+-----------------------------------
               Total |  9,478,800      100.00

. safetab bmicat, m
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    235,047        1.88        1.88
  Normal (18.5-24.9) |  3,556,712       28.47       30.36
Overweight (25-29.9) |  3,099,671       24.82       55.17
   Obese I (30-34.9) |  1,584,164       12.68       67.85
  Obese II (35-39.9) |    650,755        5.21       73.06
     Obese III (40+) |    352,451        2.82       75.89
        Unknown (.u) |  3,012,008       24.11      100.00
---------------------+-----------------------------------
               Total | 12,490,808      100.00

. safetab obese4cat
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  9,903,438       79.29       79.29
   Obese I (30-34.9) |  1,584,164       12.68       91.97
  Obese II (35-39.9) |    650,755        5.21       97.18
     Obese III (40+) |    352,451        2.82      100.00
---------------------+-----------------------------------
               Total | 12,490,808      100.00

. safetab smoke
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,909,499       50.03       50.03
      Former |  3,390,537       28.70       78.73
     Current |  2,512,130       21.27      100.00
-------------+-----------------------------------
       Total | 11,812,166      100.00

. safetab smoke, m
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,909,499       47.31       47.31
      Former |  3,390,537       27.14       74.46
     Current |  2,512,130       20.11       94.57
Unknown (.u) |    678,642        5.43      100.00
-------------+-----------------------------------
       Total | 12,490,808      100.00

. safetab bpcat
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,199,610       29.59       29.59
      Elevated |  1,751,078       16.19       45.78
 High, stage I |  3,780,732       34.96       80.74
High, stage II |  2,082,585       19.26      100.00
---------------+-----------------------------------
         Total | 10,814,005      100.00

. safetab bpcat, m
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,199,610       25.62       25.62
      Elevated |  1,751,078       14.02       39.63
 High, stage I |  3,780,732       30.27       69.90
High, stage II |  2,082,585       16.67       86.58
       Unknown |  1,676,803       13.42      100.00
---------------+-----------------------------------
         Total | 12,490,808      100.00

. safetab htdiag_or_highbp
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,619,484       77.01       77.01
          1 |  2,871,324       22.99      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. ta shield

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,939,194       79.57       79.57
          1 |  2,551,614       20.43      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 organ_trans                     /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2.                                                 
. safetab `var'
  3. }
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,256,342       98.12       98.12
          1 |    234,466        1.88      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,387,693       83.16       83.16
          1 |  2,103,115       16.84      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,152,097       97.29       97.29
          1 |    338,711        2.71      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,702,112       93.69       93.69
          1 |    788,696        6.31      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 12,229,896       97.91       97.91
    Last year |     29,183        0.23       98.14
2-5 years ago |     83,551        0.67       98.81
     5+ years |    148,178        1.19      100.00
--------------+-----------------------------------
        Total | 12,490,808      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 12,452,252       99.69       99.69
    Last year |      3,124        0.03       99.72
2-5 years ago |      9,686        0.08       99.79
     5+ years |     25,746        0.21      100.00
--------------+-----------------------------------
        Total | 12,490,808      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,450,198       99.67       99.67
          1 |     40,610        0.33      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

Solid organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,477,296       99.89       99.89
          1 |     13,512        0.11      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,476,632       99.89       99.89
          1 |     14,176        0.11      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,426,397       99.48       99.48
          1 |     64,411        0.52      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,406,715       99.33       99.33
          1 |     84,093        0.67      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,397,867       99.26       99.26
          1 |     92,941        0.74      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,087        0.06        0.06
         15 |      7,060        0.08        0.14
         30 |     17,029        0.20        0.34
         45 |    106,611        1.26        1.61
         60 |  8,321,857       98.39      100.00
------------+-----------------------------------
      Total |  8,457,644      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None | 12,355,021       98.91       98.91
Stage 3a/3b egfr 30-60       |    123,640        0.99       99.90
           Stage 4/5 egfr<30 |     12,147        0.10      100.00
-----------------------------+-----------------------------------
                       Total | 12,490,808      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,134,389       89.14       89.14
          1 |  1,356,419       10.86      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,953,921       95.70       95.70
          1 |    536,887        4.30      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. 
. safetab imd 
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,483,181       19.88       19.88
               2 |  2,497,480       19.99       39.87
               3 |  2,549,752       20.41       60.29
               4 |  2,638,293       21.12       81.41
 5 most deprived |  2,322,102       18.59      100.00
-----------------+-----------------------------------
           Total | 12,490,808      100.00

. safetab imd, m
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,483,181       19.88       19.88
               2 |  2,497,480       19.99       39.87
               3 |  2,549,752       20.41       60.29
               4 |  2,638,293       21.12       81.41
 5 most deprived |  2,322,102       18.59      100.00
-----------------+-----------------------------------
           Total | 12,490,808      100.00

. safetab ethnicity
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,855,794       82.46       82.46
                 Mixed |    167,890        1.76       84.22
Asian or Asian British |    870,824        9.14       93.36
                 Black |    323,524        3.40       96.76
                 Other |    308,906        3.24      100.00
-----------------------+-----------------------------------
                 Total |  9,526,938      100.00

. safetab ethnicity, m
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,855,794       62.89       62.89
                 Mixed |    167,890        1.34       64.24
Asian or Asian British |    870,824        6.97       71.21
                 Black |    323,524        2.59       73.80
                 Other |    308,906        2.47       76.27
               Unknown |  2,963,870       23.73      100.00
-----------------------+-----------------------------------
                 Total | 12,490,808      100.00

. safetab stp
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    162,029        1.30        1.30
          2 |  1,177,008        9.42       10.72
          3 |    533,785        4.27       14.99
          4 |    122,481        0.98       15.97
          5 |     86,420        0.69       16.67
          6 |    580,169        4.64       21.31
          7 |     35,089        0.28       21.59
          8 |    450,834        3.61       25.20
          9 |    348,585        2.79       27.99
         10 |    492,894        3.95       31.94
         11 |    551,791        4.42       36.36
         12 |    187,899        1.50       37.86
         13 |    274,840        2.20       40.06
         14 |    344,462        2.76       42.82
         15 |    442,434        3.54       46.36
         16 |    435,215        3.48       49.84
         17 |    376,362        3.01       52.86
         18 |    549,926        4.40       57.26
         19 |    425,691        3.41       60.67
         20 |    607,310        4.86       65.53
         21 |  1,008,035        8.07       73.60
         22 |     64,859        0.52       74.12
         23 |    468,270        3.75       77.87
         24 |     22,359        0.18       78.05
         25 |    102,244        0.82       78.87
         26 |    379,885        3.04       81.91
         27 |    473,103        3.79       85.69
         28 |    381,995        3.06       88.75
         29 |    321,514        2.57       91.33
         30 |    229,049        1.83       93.16
         31 |     14,492        0.12       93.28
         32 |    839,779        6.72      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. 
. 
. * Outcomes
. foreach var in covid_death non_covid_death  ///
> covid_tpp_prob_or_susp covid_tpp_prob {
  2. safetab `var'
  3. safetab `var' kids_cat3, col row
  4. }
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,489,428       99.99       99.99
          1 |      1,380        0.01      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
     covid |     people in the household
     death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,901,046  3,397,347  1,191,035 |12,489,428 
           |     63.26      27.20       9.54 |    100.00 
           |     99.99     100.00      99.99 |     99.99 
-----------+---------------------------------+----------
         1 |     1,127        151        102 |     1,380 
           |     81.67      10.94       7.39 |    100.00 
           |      0.01       0.00       0.01 |      0.01 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |     63.26      27.20       9.54 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,483,360       99.94       99.94
          1 |      7,448        0.06      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
 non-covid |     people in the household
     death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,895,743  3,396,873  1,190,744 |12,483,360 
           |     63.25      27.21       9.54 |    100.00 
           |     99.92      99.98      99.97 |     99.94 
-----------+---------------------------------+----------
         1 |     6,430        625        393 |     7,448 
           |     86.33       8.39       5.28 |    100.00 
           |      0.08       0.02       0.03 |      0.06 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |     63.26      27.20       9.54 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
 prob/susp. |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,082,228       96.73       96.73
          1 |    408,580        3.27      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
     covid |  Presence of children or young
prob/susp. |     people in the household
      case |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,641,930  3,287,728  1,152,570 |12,082,228 
           |     63.25      27.21       9.54 |    100.00 
           |     96.71      96.77      96.76 |     96.73 
-----------+---------------------------------+----------
         1 |   260,243    109,770     38,567 |   408,580 
           |     63.69      26.87       9.44 |    100.00 
           |      3.29       3.23       3.24 |      3.27 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |     63.26      27.20       9.54 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,467,753       99.82       99.82
          1 |     23,055        0.18      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
covid prob |     people in the household
      case |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,887,779  3,391,341  1,188,633 |12,467,753 
           |     63.27      27.20       9.53 |    100.00 
           |     99.82      99.82      99.79 |     99.82 
-----------+---------------------------------+----------
         1 |    14,394      6,157      2,504 |    23,055 
           |     62.43      26.71      10.86 |    100.00 
           |      0.18       0.18       0.21 |      0.18 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |     63.26      27.20       9.54 |    100.00 
           |    100.00     100.00     100.00 |    100.00 

. 
. 
. 
. 
. **********************************
. *  Number (%) with each exposure  *
. **********************************
. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                        kids_cat3, col
74

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
   Grouped |     people in the household
       age |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
    18-<30 | 2,061,055    687,528    283,613 | 3,032,196 
           |     26.08      20.24      23.81 |     24.28 
-----------+---------------------------------+----------
    30-<40 | 1,339,011  1,430,359    117,257 | 2,886,627 
           |     16.94      42.10       9.84 |     23.11 
-----------+---------------------------------+----------
    40-<50 | 1,156,579    963,655    437,584 | 2,557,818 
           |     14.64      28.36      36.74 |     20.48 
-----------+---------------------------------+----------
    50-<60 | 2,105,108    248,349    320,056 | 2,673,513 
           |     26.64       7.31      26.87 |     21.40 
-----------+---------------------------------+----------
    60-<70 | 1,240,420     67,607     32,627 | 1,340,654 
           |     15.70       1.99       2.74 |     10.73 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 

.         safetab male                                                            kids_cat3, col
74

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
      Male |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,690,426  1,912,882    634,484 | 6,237,792 
           |     46.70      56.30      53.27 |     49.94 
-----------+---------------------------------+----------
         1 | 4,211,747  1,484,616    556,653 | 6,253,016 
           |     53.30      43.70      46.73 |     50.06 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 

.         safetab bmicat                                                          kids_cat3, col m 
74

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
                     |     people in the household
         Grouped BMI |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |   156,473     60,187     18,387 |   235,047 
                     |      1.98       1.77       1.54 |      1.88 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) | 2,236,625  1,023,709    296,378 | 3,556,712 
                     |     28.30      30.13      24.88 |     28.47 
---------------------+---------------------------------+----------
Overweight (25-29.9) | 1,919,758    889,544    290,369 | 3,099,671 
                     |     24.29      26.18      24.38 |     24.82 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   997,595    432,736    153,833 | 1,584,164 
                     |     12.62      12.74      12.91 |     12.68 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   412,847    175,022     62,886 |   650,755 
                     |      5.22       5.15       5.28 |      5.21 
---------------------+---------------------------------+----------
     Obese III (40+) |   227,206     91,409     33,836 |   352,451 
                     |      2.88       2.69       2.84 |      2.82 
---------------------+---------------------------------+----------
        Unknown (.u) | 1,951,669    724,891    335,448 | 3,012,008 
                     |     24.70      21.34      28.16 |     24.11 
---------------------+---------------------------------+----------
               Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
                     |    100.00     100.00     100.00 |    100.00 

.         safetab smoke                                                           kids_cat3, col m
74

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |  Presence of children or young
     Smoking |     people in the household
      status |   No kids  Kids unde  Kids unde |     Total
-------------+---------------------------------+----------
       Never | 3,742,798  1,596,772    569,929 | 5,909,499 
             |     47.36      47.00      47.85 |     47.31 
-------------+---------------------------------+----------
      Former | 2,100,574    968,073    321,890 | 3,390,537 
             |     26.58      28.49      27.02 |     27.14 
-------------+---------------------------------+----------
     Current | 1,629,218    680,028    202,884 | 2,512,130 
             |     20.62      20.02      17.03 |     20.11 
-------------+---------------------------------+----------
Unknown (.u) |   429,583    152,625     96,434 |   678,642 
             |      5.44       4.49       8.10 |      5.43 
-------------+---------------------------------+----------
       Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
             |    100.00     100.00     100.00 |    100.00 

.         safetab obese4cat                                                       kids_cat3, col m 
74

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
 Evidence of obesity |     people in the household
      (4 categories) |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
No record of obesity | 6,264,525  2,698,331    940,582 | 9,903,438 
                     |     79.28      79.42      78.97 |     79.29 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   997,595    432,736    153,833 | 1,584,164 
                     |     12.62      12.74      12.91 |     12.68 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   412,847    175,022     62,886 |   650,755 
                     |      5.22       5.15       5.28 |      5.21 
---------------------+---------------------------------+----------
     Obese III (40+) |   227,206     91,409     33,836 |   352,451 
                     |      2.88       2.69       2.84 |      2.82 
---------------------+---------------------------------+----------
               Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
                     |    100.00     100.00     100.00 |    100.00 

.         safetab shield                                                          kids_cat3, col m 
74

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
  Probable |     people in the household
 shielding |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 6,242,802  2,743,896    952,496 | 9,939,194 
           |     79.00      80.76      79.97 |     79.57 
-----------+---------------------------------+----------
         1 | 1,659,371    653,602    238,641 | 2,551,614 
           |     21.00      19.24      20.03 |     20.43 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 

. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 organ_trans                     /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2.         safetab `var'           kids_cat3, col
  3. }
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
Respirator |     people in the household
y Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,711,742  3,369,503  1,175,097 |12,256,342 
           |     97.59      99.18      98.65 |     98.12 
-----------+---------------------------------+----------
         1 |   190,431     27,995     16,040 |   234,466 
           |      2.41       0.82       1.35 |      1.88 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
    Asthma |     people in the household
  category |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 6,592,765  2,806,860    988,068 |10,387,693 
           |     83.43      82.62      82.95 |     83.16 
-----------+---------------------------------+----------
         1 | 1,309,408    590,638    203,069 | 2,103,115 
           |     16.57      17.38      17.05 |     16.84 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
   Cardiac |     people in the household
  Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,635,565  3,351,401  1,165,131 |12,152,097 
           |     96.63      98.64      97.82 |     97.29 
-----------+---------------------------------+----------
         1 |   266,608     46,097     26,006 |   338,711 
           |      3.37       1.36       2.18 |      2.71 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
  Diabetes |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,336,413  3,246,550  1,119,149 |11,702,112 
           |     92.84      95.56      93.96 |     93.69 
-----------+---------------------------------+----------
         1 |   565,760    150,948     71,988 |   788,696 
           |      7.16       4.44       6.04 |      6.31 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Non-haematolo |     people in the household
 gical cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 7,699,253  3,362,137  1,168,506 |12,229,896 
              |     97.43      98.96      98.10 |     97.91 
--------------+---------------------------------+----------
    Last year |    22,171      4,386      2,626 |    29,183 
              |      0.28       0.13       0.22 |      0.23 
--------------+---------------------------------+----------
2-5 years ago |    63,660     12,306      7,585 |    83,551 
              |      0.81       0.36       0.64 |      0.67 
--------------+---------------------------------+----------
     5+ years |   117,089     18,669     12,420 |   148,178 
              |      1.48       0.55       1.04 |      1.19 
--------------+---------------------------------+----------
        Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
              |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Haematologica |     people in the household
     l cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 7,873,661  3,390,660  1,187,931 |12,452,252 
              |     99.64      99.80      99.73 |     99.69 
--------------+---------------------------------+----------
    Last year |     2,326        550        248 |     3,124 
              |      0.03       0.02       0.02 |      0.03 
--------------+---------------------------------+----------
2-5 years ago |     7,320      1,579        787 |     9,686 
              |      0.09       0.05       0.07 |      0.08 
--------------+---------------------------------+----------
     5+ years |    18,866      4,709      2,171 |    25,746 
              |      0.24       0.14       0.18 |      0.21 
--------------+---------------------------------+----------
        Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
              |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |  Presence of children or young
        on |     people in the household
algorithm) |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,873,647  3,388,626  1,187,925 |12,450,198 
           |     99.64      99.74      99.73 |     99.67 
-----------+---------------------------------+----------
         1 |    28,526      8,872      3,212 |    40,610 
           |      0.36       0.26       0.27 |      0.33 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Solid |  Presence of children or young
     organ |     people in the household
transplant |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,891,957  3,395,297  1,190,042 |12,477,296 
           |     99.87      99.94      99.91 |     99.89 
-----------+---------------------------------+----------
         1 |    10,216      2,201      1,095 |    13,512 
           |      0.13       0.06       0.09 |      0.11 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
  Asplenia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,891,895  3,394,859  1,189,878 |12,476,632 
           |     99.87      99.92      99.89 |     99.89 
-----------+---------------------------------+----------
         1 |    10,278      2,639      1,259 |    14,176 
           |      0.13       0.08       0.11 |      0.11 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
     liver |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,852,687  3,386,823  1,186,887 |12,426,397 
           |     99.37      99.69      99.64 |     99.48 
-----------+---------------------------------+----------
         1 |    49,486     10,675      4,250 |    64,411 
           |      0.63       0.31       0.36 |      0.52 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Neurologic |     people in the household
al disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,837,704  3,384,653  1,184,358 |12,406,715 
           |     99.18      99.62      99.43 |     99.33 
-----------+---------------------------------+----------
         1 |    64,469     12,845      6,779 |    84,093 
           |      0.82       0.38       0.57 |      0.67 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
 Stroke or |     people in the household
  dementia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,827,173  3,386,080  1,184,614 |12,397,867 
           |     99.05      99.66      99.45 |     99.26 
-----------+---------------------------------+----------
         1 |    75,000     11,418      6,523 |    92,941 
           |      0.95       0.34       0.55 |      0.74 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Calculated |     people in the household
      eGFR |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 |     3,983        716        388 |     5,087 
           |      0.07       0.03       0.05 |      0.06 
-----------+---------------------------------+----------
        15 |     5,572        947        541 |     7,060 
           |      0.10       0.04       0.06 |      0.08 
-----------+---------------------------------+----------
        30 |    14,060      1,893      1,076 |    17,029 
           |      0.26       0.08       0.13 |      0.20 
-----------+---------------------------------+----------
        45 |    89,310     10,228      7,073 |   106,611 
           |      1.67       0.45       0.84 |      1.26 
-----------+---------------------------------+----------
        60 | 5,248,999  2,239,481    833,377 | 8,321,857 
           |     97.89      99.39      98.92 |     98.39 
-----------+---------------------------------+----------
     Total | 5,361,924  2,253,265    842,455 | 8,457,644 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
       Reduced kidney |     people in the household
             function |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                 None | 7,789,248  3,383,714  1,182,059 |12,355,021 
                      |     98.57      99.59      99.24 |     98.91 
----------------------+---------------------------------+----------
Stage 3a/3b egfr 30-6 |   103,370     12,121      8,149 |   123,640 
                      |      1.31       0.36       0.68 |      0.99 
----------------------+---------------------------------+----------
    Stage 4/5 egfr<30 |     9,555      1,663        929 |    12,147 
                      |      0.12       0.05       0.08 |      0.10 
----------------------+---------------------------------+----------
                Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
                      |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |  Presence of children or young
hypertensi |     people in the household
        on |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 6,855,697  3,205,870  1,072,822 |11,134,389 
           |     86.76      94.36      90.07 |     89.14 
-----------+---------------------------------+----------
         1 | 1,046,476    191,628    118,315 | 1,356,419 
           |     13.24       5.64       9.93 |     10.86 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Autoimmune |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,552,469  3,262,765  1,138,687 |11,953,921 
           |     95.57      96.03      95.60 |     95.70 
-----------+---------------------------------+----------
         1 |   349,704    134,733     52,450 |   536,887 
           |      4.43       3.97       4.40 |      4.30 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 

.         
.         safetab imd                                                             kids_cat3, col m
74

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |  Presence of children or young
     Deprivation |     people in the household
           (IMD) |   No kids  Kids unde  Kids unde |     Total
-----------------+---------------------------------+----------
1 least deprived | 1,558,984    648,250    275,947 | 2,483,181 
                 |     19.73      19.08      23.17 |     19.88 
-----------------+---------------------------------+----------
               2 | 1,632,613    624,920    239,947 | 2,497,480 
                 |     20.66      18.39      20.14 |     19.99 
-----------------+---------------------------------+----------
               3 | 1,668,533    652,814    228,405 | 2,549,752 
                 |     21.11      19.21      19.18 |     20.41 
-----------------+---------------------------------+----------
               4 | 1,669,821    735,142    233,330 | 2,638,293 
                 |     21.13      21.64      19.59 |     21.12 
-----------------+---------------------------------+----------
 5 most deprived | 1,372,222    736,372    213,508 | 2,322,102 
                 |     17.37      21.67      17.92 |     18.59 
-----------------+---------------------------------+----------
           Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
                 |    100.00     100.00     100.00 |    100.00 

.         safetab ethnicity                                                       kids_cat3, col m
74

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
                      |     people in the household
            Ethnicity |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                White | 5,037,927  2,126,397    691,470 | 7,855,794 
                      |     63.75      62.59      58.05 |     62.89 
----------------------+---------------------------------+----------
                Mixed |    99,147     54,042     14,701 |   167,890 
                      |      1.25       1.59       1.23 |      1.34 
----------------------+---------------------------------+----------
Asian or Asian Britis |   404,256    366,134    100,434 |   870,824 
                      |      5.12      10.78       8.43 |      6.97 
----------------------+---------------------------------+----------
                Black |   174,047    115,667     33,810 |   323,524 
                      |      2.20       3.40       2.84 |      2.59 
----------------------+---------------------------------+----------
                Other |   192,342     93,719     22,845 |   308,906 
                      |      2.43       2.76       1.92 |      2.47 
----------------------+---------------------------------+----------
              Unknown | 1,994,454    641,539    327,877 | 2,963,870 
                      |     25.24      18.88      27.53 |     23.73 
----------------------+---------------------------------+----------
                Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
                      |    100.00     100.00     100.00 |    100.00 

.         *safetab urban                                                          kids_cat3, col
.         safetab stp                                                             kids_cat3, col
74

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |
      tion |  Presence of children or young
Partnershi |     people in the household
         p |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 |   116,462     36,825      8,742 |   162,029 
           |      1.47       1.08       0.73 |      1.30 
-----------+---------------------------------+----------
         2 |   700,441    359,725    116,842 | 1,177,008 
           |      8.86      10.59       9.81 |      9.42 
-----------+---------------------------------+----------
         3 |   343,413    140,768     49,604 |   533,785 
           |      4.35       4.14       4.16 |      4.27 
-----------+---------------------------------+----------
         4 |    75,274     34,377     12,830 |   122,481 
           |      0.95       1.01       1.08 |      0.98 
-----------+---------------------------------+----------
         5 |    53,953     23,456      9,011 |    86,420 
           |      0.68       0.69       0.76 |      0.69 
-----------+---------------------------------+----------
         6 |   370,160    155,906     54,103 |   580,169 
           |      4.68       4.59       4.54 |      4.64 
-----------+---------------------------------+----------
         7 |    22,947      9,189      2,953 |    35,089 
           |      0.29       0.27       0.25 |      0.28 
-----------+---------------------------------+----------
         8 |   285,106    122,594     43,134 |   450,834 
           |      3.61       3.61       3.62 |      3.61 
-----------+---------------------------------+----------
         9 |   226,891     88,207     33,487 |   348,585 
           |      2.87       2.60       2.81 |      2.79 
-----------+---------------------------------+----------
        10 |   305,522    141,111     46,261 |   492,894 
           |      3.87       4.15       3.88 |      3.95 
-----------+---------------------------------+----------
        11 |   340,399    155,995     55,397 |   551,791 
           |      4.31       4.59       4.65 |      4.42 
-----------+---------------------------------+----------
        12 |   109,904     59,230     18,765 |   187,899 
           |      1.39       1.74       1.58 |      1.50 
-----------+---------------------------------+----------
        13 |   164,235     81,841     28,764 |   274,840 
           |      2.08       2.41       2.41 |      2.20 
-----------+---------------------------------+----------
        14 |   204,047    104,963     35,452 |   344,462 
           |      2.58       3.09       2.98 |      2.76 
-----------+---------------------------------+----------
        15 |   265,541    133,666     43,227 |   442,434 
           |      3.36       3.93       3.63 |      3.54 
-----------+---------------------------------+----------
        16 |   280,365    114,070     40,780 |   435,215 
           |      3.55       3.36       3.42 |      3.48 
-----------+---------------------------------+----------
        17 |   239,318    100,217     36,827 |   376,362 
           |      3.03       2.95       3.09 |      3.01 
-----------+---------------------------------+----------
        18 |   310,067    181,180     58,679 |   549,926 
           |      3.92       5.33       4.93 |      4.40 
-----------+---------------------------------+----------
        19 |   258,225    124,693     42,773 |   425,691 
           |      3.27       3.67       3.59 |      3.41 
-----------+---------------------------------+----------
        20 |   358,895    182,261     66,154 |   607,310 
           |      4.54       5.36       5.55 |      4.86 
-----------+---------------------------------+----------
        21 |   707,761    225,144     75,130 | 1,008,035 
           |      8.96       6.63       6.31 |      8.07 
-----------+---------------------------------+----------
        22 |    36,797     21,462      6,600 |    64,859 
           |      0.47       0.63       0.55 |      0.52 
-----------+---------------------------------+----------
        23 |   302,723    120,028     45,519 |   468,270 
           |      3.83       3.53       3.82 |      3.75 
-----------+---------------------------------+----------
        24 |    14,883      5,185      2,291 |    22,359 
           |      0.19       0.15       0.19 |      0.18 
-----------+---------------------------------+----------
        25 |    71,063     22,219      8,962 |   102,244 
           |      0.90       0.65       0.75 |      0.82 
-----------+---------------------------------+----------
        26 |   252,722     91,503     35,660 |   379,885 
           |      3.20       2.69       2.99 |      3.04 
-----------+---------------------------------+----------
        27 |   303,665    121,945     47,493 |   473,103 
           |      3.84       3.59       3.99 |      3.79 
-----------+---------------------------------+----------
        28 |   257,173     89,808     35,014 |   381,995 
           |      3.25       2.64       2.94 |      3.06 
-----------+---------------------------------+----------
        29 |   218,974     76,147     26,393 |   321,514 
           |      2.77       2.24       2.22 |      2.57 
-----------+---------------------------------+----------
        30 |   151,042     56,075     21,932 |   229,049 
           |      1.91       1.65       1.84 |      1.83 
-----------+---------------------------------+----------
        31 |     9,465      3,526      1,501 |    14,492 
           |      0.12       0.10       0.13 |      0.12 
-----------+---------------------------------+----------
        32 |   544,740    214,182     80,857 |   839,779 
           |      6.89       6.30       6.79 |      6.72 
-----------+---------------------------------+----------
     Total | 7,902,173  3,397,498  1,191,137 |12,490,808 
           |    100.00     100.00     100.00 |    100.00 

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\03a_an_descriptive_tables.log
  log type:  text
 closed on:  24 Jul 2020, 14:10:36
----------------------------------------------------------------------------------------------------------------------------------
