----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\04a_an_descriptive_tables.log
  log type:  text
 opened on:  24 Jul 2020, 14:13:18

. 
. use $tempdir\analysis_dataset, clear

. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 12,490,808    41.22704     13.4166         18         65

. safetab agegroup
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  3,032,196       24.28       24.28
     30-<40 |  2,886,627       23.11       47.39
     40-<50 |  2,557,818       20.48       67.86
     50-<60 |  2,673,513       21.40       89.27
     60-<70 |  1,340,654       10.73      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. safetab age66
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,490,808      100.00      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. safetab male
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  6,237,792       49.94       49.94
          1 |  6,253,016       50.06      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. safetab bmicat
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    235,047        2.48        2.48
  Normal (18.5-24.9) |  3,556,712       37.52       40.00
Overweight (25-29.9) |  3,099,671       32.70       72.70
   Obese I (30-34.9) |  1,584,164       16.71       89.42
  Obese II (35-39.9) |    650,755        6.87       96.28
     Obese III (40+) |    352,451        3.72      100.00
---------------------+-----------------------------------
               Total |  9,478,800      100.00

. safetab bmicat, m
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    235,047        1.88        1.88
  Normal (18.5-24.9) |  3,556,712       28.47       30.36
Overweight (25-29.9) |  3,099,671       24.82       55.17
   Obese I (30-34.9) |  1,584,164       12.68       67.85
  Obese II (35-39.9) |    650,755        5.21       73.06
     Obese III (40+) |    352,451        2.82       75.89
        Unknown (.u) |  3,012,008       24.11      100.00
---------------------+-----------------------------------
               Total | 12,490,808      100.00

. safetab obese4cat
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  9,903,438       79.29       79.29
   Obese I (30-34.9) |  1,584,164       12.68       91.97
  Obese II (35-39.9) |    650,755        5.21       97.18
     Obese III (40+) |    352,451        2.82      100.00
---------------------+-----------------------------------
               Total | 12,490,808      100.00

. safetab smoke
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,909,499       50.03       50.03
      Former |  3,390,537       28.70       78.73
     Current |  2,512,130       21.27      100.00
-------------+-----------------------------------
       Total | 11,812,166      100.00

. safetab smoke, m
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,909,499       47.31       47.31
      Former |  3,390,537       27.14       74.46
     Current |  2,512,130       20.11       94.57
Unknown (.u) |    678,642        5.43      100.00
-------------+-----------------------------------
       Total | 12,490,808      100.00

. safetab bpcat
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,199,610       29.59       29.59
      Elevated |  1,751,078       16.19       45.78
 High, stage I |  3,780,732       34.96       80.74
High, stage II |  2,082,585       19.26      100.00
---------------+-----------------------------------
         Total | 10,814,005      100.00

. safetab bpcat, m
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,199,610       25.62       25.62
      Elevated |  1,751,078       14.02       39.63
 High, stage I |  3,780,732       30.27       69.90
High, stage II |  2,082,585       16.67       86.58
       Unknown |  1,676,803       13.42      100.00
---------------+-----------------------------------
         Total | 12,490,808      100.00

. safetab htdiag_or_highbp
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,619,484       77.01       77.01
          1 |  2,871,324       22.99      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. ta shield

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,939,194       79.57       79.57
          1 |  2,551,614       20.43      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 organ_trans                     /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2.                                                 
. safetab `var'
  3. }
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,256,342       98.12       98.12
          1 |    234,466        1.88      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,387,693       83.16       83.16
          1 |  2,103,115       16.84      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,152,097       97.29       97.29
          1 |    338,711        2.71      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,702,112       93.69       93.69
          1 |    788,696        6.31      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 12,229,896       97.91       97.91
    Last year |     29,183        0.23       98.14
2-5 years ago |     83,551        0.67       98.81
     5+ years |    148,178        1.19      100.00
--------------+-----------------------------------
        Total | 12,490,808      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 12,452,252       99.69       99.69
    Last year |      3,124        0.03       99.72
2-5 years ago |      9,686        0.08       99.79
     5+ years |     25,746        0.21      100.00
--------------+-----------------------------------
        Total | 12,490,808      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,450,198       99.67       99.67
          1 |     40,610        0.33      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

Solid organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,477,296       99.89       99.89
          1 |     13,512        0.11      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,476,632       99.89       99.89
          1 |     14,176        0.11      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,426,397       99.48       99.48
          1 |     64,411        0.52      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,406,715       99.33       99.33
          1 |     84,093        0.67      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,397,867       99.26       99.26
          1 |     92,941        0.74      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,087        0.06        0.06
         15 |      7,060        0.08        0.14
         30 |     17,029        0.20        0.34
         45 |    106,611        1.26        1.61
         60 |  8,321,857       98.39      100.00
------------+-----------------------------------
      Total |  8,457,644      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None | 12,355,021       98.91       98.91
Stage 3a/3b egfr 30-60       |    123,640        0.99       99.90
           Stage 4/5 egfr<30 |     12,147        0.10      100.00
-----------------------------+-----------------------------------
                       Total | 12,490,808      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,134,389       89.14       89.14
          1 |  1,356,419       10.86      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,953,921       95.70       95.70
          1 |    536,887        4.30      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. 
. safetab imd 
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,483,181       19.88       19.88
               2 |  2,497,480       19.99       39.87
               3 |  2,549,752       20.41       60.29
               4 |  2,638,293       21.12       81.41
 5 most deprived |  2,322,102       18.59      100.00
-----------------+-----------------------------------
           Total | 12,490,808      100.00

. safetab imd, m
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,483,181       19.88       19.88
               2 |  2,497,480       19.99       39.87
               3 |  2,549,752       20.41       60.29
               4 |  2,638,293       21.12       81.41
 5 most deprived |  2,322,102       18.59      100.00
-----------------+-----------------------------------
           Total | 12,490,808      100.00

. safetab ethnicity
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,855,794       82.46       82.46
                 Mixed |    167,890        1.76       84.22
Asian or Asian British |    870,824        9.14       93.36
                 Black |    323,524        3.40       96.76
                 Other |    308,906        3.24      100.00
-----------------------+-----------------------------------
                 Total |  9,526,938      100.00

. safetab ethnicity, m
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,855,794       62.89       62.89
                 Mixed |    167,890        1.34       64.24
Asian or Asian British |    870,824        6.97       71.21
                 Black |    323,524        2.59       73.80
                 Other |    308,906        2.47       76.27
               Unknown |  2,963,870       23.73      100.00
-----------------------+-----------------------------------
                 Total | 12,490,808      100.00

. safetab stp
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    162,029        1.30        1.30
          2 |  1,177,008        9.42       10.72
          3 |    533,785        4.27       14.99
          4 |    122,481        0.98       15.97
          5 |     86,420        0.69       16.67
          6 |    580,169        4.64       21.31
          7 |     35,089        0.28       21.59
          8 |    450,834        3.61       25.20
          9 |    348,585        2.79       27.99
         10 |    492,894        3.95       31.94
         11 |    551,791        4.42       36.36
         12 |    187,899        1.50       37.86
         13 |    274,840        2.20       40.06
         14 |    344,462        2.76       42.82
         15 |    442,434        3.54       46.36
         16 |    435,215        3.48       49.84
         17 |    376,362        3.01       52.86
         18 |    549,926        4.40       57.26
         19 |    425,691        3.41       60.67
         20 |    607,310        4.86       65.53
         21 |  1,008,035        8.07       73.60
         22 |     64,859        0.52       74.12
         23 |    468,270        3.75       77.87
         24 |     22,359        0.18       78.05
         25 |    102,244        0.82       78.87
         26 |    379,885        3.04       81.91
         27 |    473,103        3.79       85.69
         28 |    381,995        3.06       88.75
         29 |    321,514        2.57       91.33
         30 |    229,049        1.83       93.16
         31 |     14,492        0.12       93.28
         32 |    839,779        6.72      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. 
. 
. * Outcomes
. safetab non_covid_death
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,483,360       99.94       99.94
          1 |      7,448        0.06      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. safetab covid_death
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,489,428       99.99       99.99
          1 |      1,380        0.01      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. safetab covid_tpp_prob_or_susp
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
 prob/susp. |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,082,228       96.73       96.73
          1 |    408,580        3.27      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. safetab covid_tpp_prob
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,467,753       99.82       99.82
          1 |     23,055        0.18      100.00
------------+-----------------------------------
      Total | 12,490,808      100.00

. 
. 
. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist covid_tpp_prob covid_death non_covid_death covid_tpp_prob_or_susp {
  2. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                        `outvar', col
  3.         safetab male                                                            `outvar', col
  4.         safetab bmicat                                                          `outvar', col m 
  5.         safetab smoke                                                           `outvar', col m
  6.         safetab obese4cat                                                       `outvar', col m 
  7.         safetab shield                                                          `outvar', col m 
  8. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 organ_trans                     /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  9.         safetab `var'           `outvar', col
 10. }
 11.         
.         safetab imd                                                             `outvar', col m
 12.         safetab ethnicity                                                       `outvar', col m
 13.         *safetab urban                                                          `outvar', col
.         safetab stp                                                             `outvar', col
 14. }
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 3,028,956      3,240 | 3,032,196 
           |     24.29      14.05 |     24.28 
-----------+----------------------+----------
    30-<40 | 2,882,238      4,389 | 2,886,627 
           |     23.12      19.04 |     23.11 
-----------+----------------------+----------
    40-<50 | 2,552,583      5,235 | 2,557,818 
           |     20.47      22.71 |     20.48 
-----------+----------------------+----------
    50-<60 | 2,666,734      6,779 | 2,673,513 
           |     21.39      29.40 |     21.40 
-----------+----------------------+----------
    60-<70 | 1,337,242      3,412 | 1,340,654 
           |     10.73      14.80 |     10.73 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,224,437     13,355 | 6,237,792 
           |     49.92      57.93 |     49.94 
-----------+----------------------+----------
         1 | 6,243,316      9,700 | 6,253,016 
           |     50.08      42.07 |     50.06 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   234,708        339 |   235,047 
                     |      1.88       1.47 |      1.88 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,551,474      5,238 | 3,556,712 
                     |     28.49      22.72 |     28.47 
---------------------+----------------------+----------
Overweight (25-29.9) | 3,093,279      6,392 | 3,099,671 
                     |     24.81      27.73 |     24.82 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,579,896      4,268 | 1,584,164 
                     |     12.67      18.51 |     12.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |   648,560      2,195 |   650,755 
                     |      5.20       9.52 |      5.21 
---------------------+----------------------+----------
     Obese III (40+) |   350,988      1,463 |   352,451 
                     |      2.82       6.35 |      2.82 
---------------------+----------------------+----------
        Unknown (.u) | 3,008,848      3,160 | 3,012,008 
                     |     24.13      13.71 |     24.11 
---------------------+----------------------+----------
               Total |12,467,753     23,055 |12,490,808 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,897,694     11,805 | 5,909,499 
             |     47.30      51.20 |     47.31 
-------------+----------------------+----------
      Former | 3,382,805      7,732 | 3,390,537 
             |     27.13      33.54 |     27.14 
-------------+----------------------+----------
     Current | 2,509,114      3,016 | 2,512,130 
             |     20.12      13.08 |     20.11 
-------------+----------------------+----------
Unknown (.u) |   678,140        502 |   678,642 
             |      5.44       2.18 |      5.43 
-------------+----------------------+----------
       Total |12,467,753     23,055 |12,490,808 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,888,309     15,129 | 9,903,438 
                     |     79.31      65.62 |     79.29 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,579,896      4,268 | 1,584,164 
                     |     12.67      18.51 |     12.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |   648,560      2,195 |   650,755 
                     |      5.20       9.52 |      5.21 
---------------------+----------------------+----------
     Obese III (40+) |   350,988      1,463 |   352,451 
                     |      2.82       6.35 |      2.82 
---------------------+----------------------+----------
               Total |12,467,753     23,055 |12,490,808 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,923,094     16,100 | 9,939,194 
           |     79.59      69.83 |     79.57 
-----------+----------------------+----------
         1 | 2,544,659      6,955 | 2,551,614 
           |     20.41      30.17 |     20.43 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |12,234,497     21,845 |12,256,342 
           |     98.13      94.75 |     98.12 
-----------+----------------------+----------
         1 |   233,256      1,210 |   234,466 
           |      1.87       5.25 |      1.88 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |10,369,646     18,047 |10,387,693 
           |     83.17      78.28 |     83.16 
-----------+----------------------+----------
         1 | 2,098,107      5,008 | 2,103,115 
           |     16.83      21.72 |     16.84 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |12,130,505     21,592 |12,152,097 
           |     97.30      93.65 |     97.29 
-----------+----------------------+----------
         1 |   337,248      1,463 |   338,711 
           |      2.70       6.35 |      2.71 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |11,682,874     19,238 |11,702,112 
           |     93.70      83.44 |     93.69 
-----------+----------------------+----------
         1 |   784,879      3,817 |   788,696 
           |      6.30      16.56 |      6.31 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |12,207,680     22,216 |12,229,896 
              |     97.91      96.36 |     97.91 
--------------+----------------------+----------
    Last year |    29,030        153 |    29,183 
              |      0.23       0.66 |      0.23 
--------------+----------------------+----------
2-5 years ago |    83,270        281 |    83,551 
              |      0.67       1.22 |      0.67 
--------------+----------------------+----------
     5+ years |   147,773        405 |   148,178 
              |      1.19       1.76 |      1.19 
--------------+----------------------+----------
        Total |12,467,753     23,055 |12,490,808 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |12,429,432     22,820 |12,452,252 
              |     99.69      98.98 |     99.69 
--------------+----------------------+----------
    Last year |     3,089         35 |     3,124 
              |      0.02       0.15 |      0.03 
--------------+----------------------+----------
2-5 years ago |     9,608         78 |     9,686 
              |      0.08       0.34 |      0.08 
--------------+----------------------+----------
     5+ years |    25,624        122 |    25,746 
              |      0.21       0.53 |      0.21 
--------------+----------------------+----------
        Total |12,467,753     23,055 |12,490,808 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |12,427,382     22,816 |12,450,198 
           |     99.68      98.96 |     99.67 
-----------+----------------------+----------
         1 |    40,371        239 |    40,610 
           |      0.32       1.04 |      0.33 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |12,454,411     22,885 |12,477,296 
           |     99.89      99.26 |     99.89 
-----------+----------------------+----------
         1 |    13,342        170 |    13,512 
           |      0.11       0.74 |      0.11 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |12,453,672     22,960 |12,476,632 
           |     99.89      99.59 |     99.89 
-----------+----------------------+----------
         1 |    14,081         95 |    14,176 
           |      0.11       0.41 |      0.11 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,403,674     22,723 |12,426,397 
           |     99.49      98.56 |     99.48 
-----------+----------------------+----------
         1 |    64,079        332 |    64,411 
           |      0.51       1.44 |      0.52 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,383,993     22,722 |12,406,715 
           |     99.33      98.56 |     99.33 
-----------+----------------------+----------
         1 |    83,760        333 |    84,093 
           |      0.67       1.44 |      0.67 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |12,375,310     22,557 |12,397,867 
           |     99.26      97.84 |     99.26 
-----------+----------------------+----------
         1 |    92,443        498 |    92,941 
           |      0.74       2.16 |      0.74 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,932        155 |     5,087 
           |      0.06       0.80 |      0.06 
-----------+----------------------+----------
        15 |     6,977         83 |     7,060 
           |      0.08       0.43 |      0.08 
-----------+----------------------+----------
        30 |    16,891        138 |    17,029 
           |      0.20       0.71 |      0.20 
-----------+----------------------+----------
        45 |   106,191        420 |   106,611 
           |      1.26       2.16 |      1.26 
-----------+----------------------+----------
        60 | 8,303,190     18,667 | 8,321,857 
           |     98.40      95.91 |     98.39 
-----------+----------------------+----------
     Total | 8,438,181     19,463 | 8,457,644 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |12,332,762     22,259 |12,355,021 
                      |     98.92      96.55 |     98.91 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   123,082        558 |   123,640 
                      |      0.99       2.42 |      0.99 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    11,909        238 |    12,147 
                      |      0.10       1.03 |      0.10 
----------------------+----------------------+----------
                Total |12,467,753     23,055 |12,490,808 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |11,116,253     18,136 |11,134,389 
           |     89.16      78.66 |     89.14 
-----------+----------------------+----------
         1 | 1,351,500      4,919 | 1,356,419 
           |     10.84      21.34 |     10.86 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,932,346     21,575 |11,953,921 
           |     95.71      93.58 |     95.70 
-----------+----------------------+----------
         1 |   535,407      1,480 |   536,887 
           |      4.29       6.42 |      4.30 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,479,353      3,828 | 2,483,181 
                 |     19.89      16.60 |     19.88 
-----------------+----------------------+----------
               2 | 2,493,285      4,195 | 2,497,480 
                 |     20.00      18.20 |     19.99 
-----------------+----------------------+----------
               3 | 2,545,431      4,321 | 2,549,752 
                 |     20.42      18.74 |     20.41 
-----------------+----------------------+----------
               4 | 2,633,060      5,233 | 2,638,293 
                 |     21.12      22.70 |     21.12 
-----------------+----------------------+----------
 5 most deprived | 2,316,624      5,478 | 2,322,102 
                 |     18.58      23.76 |     18.59 
-----------------+----------------------+----------
           Total |12,467,753     23,055 |12,490,808 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,842,914     12,880 | 7,855,794 
                      |     62.91      55.87 |     62.89 
----------------------+----------------------+----------
                Mixed |   167,505        385 |   167,890 
                      |      1.34       1.67 |      1.34 
----------------------+----------------------+----------
Asian or Asian Britis |   867,280      3,544 |   870,824 
                      |      6.96      15.37 |      6.97 
----------------------+----------------------+----------
                Black |   322,456      1,068 |   323,524 
                      |      2.59       4.63 |      2.59 
----------------------+----------------------+----------
                Other |   308,300        606 |   308,906 
                      |      2.47       2.63 |      2.47 
----------------------+----------------------+----------
              Unknown | 2,959,298      4,572 | 2,963,870 
                      |     23.74      19.83 |     23.73 
----------------------+----------------------+----------
                Total |12,467,753     23,055 |12,490,808 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |   161,716        313 |   162,029 
           |      1.30       1.36 |      1.30 
-----------+----------------------+----------
         2 | 1,173,994      3,014 | 1,177,008 
           |      9.42      13.07 |      9.42 
-----------+----------------------+----------
         3 |   532,976        809 |   533,785 
           |      4.27       3.51 |      4.27 
-----------+----------------------+----------
         4 |   122,261        220 |   122,481 
           |      0.98       0.95 |      0.98 
-----------+----------------------+----------
         5 |    86,150        270 |    86,420 
           |      0.69       1.17 |      0.69 
-----------+----------------------+----------
         6 |   578,609      1,560 |   580,169 
           |      4.64       6.77 |      4.64 
-----------+----------------------+----------
         7 |    35,002         87 |    35,089 
           |      0.28       0.38 |      0.28 
-----------+----------------------+----------
         8 |   450,021        813 |   450,834 
           |      3.61       3.53 |      3.61 
-----------+----------------------+----------
         9 |   348,137        448 |   348,585 
           |      2.79       1.94 |      2.79 
-----------+----------------------+----------
        10 |   492,076        818 |   492,894 
           |      3.95       3.55 |      3.95 
-----------+----------------------+----------
        11 |   550,116      1,675 |   551,791 
           |      4.41       7.27 |      4.42 
-----------+----------------------+----------
        12 |   187,505        394 |   187,899 
           |      1.50       1.71 |      1.50 
-----------+----------------------+----------
        13 |   274,446        394 |   274,840 
           |      2.20       1.71 |      2.20 
-----------+----------------------+----------
        14 |   343,917        545 |   344,462 
           |      2.76       2.36 |      2.76 
-----------+----------------------+----------
        15 |   441,780        654 |   442,434 
           |      3.54       2.84 |      3.54 
-----------+----------------------+----------
        16 |   434,477        738 |   435,215 
           |      3.48       3.20 |      3.48 
-----------+----------------------+----------
        17 |   375,898        464 |   376,362 
           |      3.01       2.01 |      3.01 
-----------+----------------------+----------
        18 |   548,461      1,465 |   549,926 
           |      4.40       6.35 |      4.40 
-----------+----------------------+----------
        19 |   425,149        542 |   425,691 
           |      3.41       2.35 |      3.41 
-----------+----------------------+----------
        20 |   605,641      1,669 |   607,310 
           |      4.86       7.24 |      4.86 
-----------+----------------------+----------
        21 | 1,006,353      1,682 | 1,008,035 
           |      8.07       7.30 |      8.07 
-----------+----------------------+----------
        22 |    64,765         94 |    64,859 
           |      0.52       0.41 |      0.52 
-----------+----------------------+----------
        23 |   467,605        665 |   468,270 
           |      3.75       2.88 |      3.75 
-----------+----------------------+----------
        24 |    22,319         40 |    22,359 
           |      0.18       0.17 |      0.18 
-----------+----------------------+----------
        25 |   102,145         99 |   102,244 
           |      0.82       0.43 |      0.82 
-----------+----------------------+----------
        26 |   379,379        506 |   379,885 
           |      3.04       2.19 |      3.04 
-----------+----------------------+----------
        27 |   472,646        457 |   473,103 
           |      3.79       1.98 |      3.79 
-----------+----------------------+----------
        28 |   381,662        333 |   381,995 
           |      3.06       1.44 |      3.06 
-----------+----------------------+----------
        29 |   321,058        456 |   321,514 
           |      2.58       1.98 |      2.57 
-----------+----------------------+----------
        30 |   228,762        287 |   229,049 
           |      1.83       1.24 |      1.83 
-----------+----------------------+----------
        31 |    14,480         12 |    14,492 
           |      0.12       0.05 |      0.12 
-----------+----------------------+----------
        32 |   838,247      1,532 |   839,779 
           |      6.72       6.64 |      6.72 
-----------+----------------------+----------
     Total |12,467,753     23,055 |12,490,808 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped | outcome: covid death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 3,032,183         13 | 3,032,196 
           |     24.28       0.94 |     24.28 
-----------+----------------------+----------
    30-<40 | 2,886,577         50 | 2,886,627 
           |     23.11       3.62 |     23.11 
-----------+----------------------+----------
    40-<50 | 2,557,649        169 | 2,557,818 
           |     20.48      12.25 |     20.48 
-----------+----------------------+----------
    50-<60 | 2,672,960        553 | 2,673,513 
           |     21.40      40.07 |     21.40 
-----------+----------------------+----------
    60-<70 | 1,340,059        595 | 1,340,654 
           |     10.73      43.12 |     10.73 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,237,326        466 | 6,237,792 
           |     49.94      33.77 |     49.94 
-----------+----------------------+----------
         1 | 6,252,102        914 | 6,253,016 
           |     50.06      66.23 |     50.06 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     | outcome: covid death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   235,021         26 |   235,047 
                     |      1.88       1.88 |      1.88 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,556,500        212 | 3,556,712 
                     |     28.48      15.36 |     28.47 
---------------------+----------------------+----------
Overweight (25-29.9) | 3,099,338        333 | 3,099,671 
                     |     24.82      24.13 |     24.82 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,583,872        292 | 1,584,164 
                     |     12.68      21.16 |     12.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |   650,551        204 |   650,755 
                     |      5.21      14.78 |      5.21 
---------------------+----------------------+----------
     Obese III (40+) |   352,316        135 |   352,451 
                     |      2.82       9.78 |      2.82 
---------------------+----------------------+----------
        Unknown (.u) | 3,011,830        178 | 3,012,008 
                     |     24.12      12.90 |     24.11 
---------------------+----------------------+----------
               Total |12,489,428      1,380 |12,490,808 
                     |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking | outcome: covid death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,908,922        577 | 5,909,499 
             |     47.31      41.81 |     47.31 
-------------+----------------------+----------
      Former | 3,389,957        580 | 3,390,537 
             |     27.14      42.03 |     27.14 
-------------+----------------------+----------
     Current | 2,511,917        213 | 2,512,130 
             |     20.11      15.43 |     20.11 
-------------+----------------------+----------
Unknown (.u) |   678,632         10 |   678,642 
             |      5.43       0.72 |      5.43 
-------------+----------------------+----------
       Total |12,489,428      1,380 |12,490,808 
             |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity | outcome: covid death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,902,689        749 | 9,903,438 
                     |     79.29      54.28 |     79.29 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,583,872        292 | 1,584,164 
                     |     12.68      21.16 |     12.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |   650,551        204 |   650,755 
                     |      5.21      14.78 |      5.21 
---------------------+----------------------+----------
     Obese III (40+) |   352,316        135 |   352,451 
                     |      2.82       9.78 |      2.82 
---------------------+----------------------+----------
               Total |12,489,428      1,380 |12,490,808 
                     |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,938,399        795 | 9,939,194 
           |     79.57      57.61 |     79.57 
-----------+----------------------+----------
         1 | 2,551,029        585 | 2,551,614 
           |     20.43      42.39 |     20.43 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator | outcome: covid death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |12,255,162      1,180 |12,256,342 
           |     98.12      85.51 |     98.12 
-----------+----------------------+----------
         1 |   234,266        200 |   234,466 
           |      1.88      14.49 |      1.88 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma | outcome: covid death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |10,386,580      1,113 |10,387,693 
           |     83.16      80.65 |     83.16 
-----------+----------------------+----------
         1 | 2,102,848        267 | 2,103,115 
           |     16.84      19.35 |     16.84 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac | outcome: covid death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |12,150,993      1,104 |12,152,097 
           |     97.29      80.00 |     97.29 
-----------+----------------------+----------
         1 |   338,435        276 |   338,711 
           |      2.71      20.00 |      2.71 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |11,701,295        817 |11,702,112 
           |     93.69      59.20 |     93.69 
-----------+----------------------+----------
         1 |   788,133        563 |   788,696 
           |      6.31      40.80 |      6.31 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo | outcome: covid death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |12,228,652      1,244 |12,229,896 
              |     97.91      90.14 |     97.91 
--------------+----------------------+----------
    Last year |    29,148         35 |    29,183 
              |      0.23       2.54 |      0.23 
--------------+----------------------+----------
2-5 years ago |    83,497         54 |    83,551 
              |      0.67       3.91 |      0.67 
--------------+----------------------+----------
     5+ years |   148,131         47 |   148,178 
              |      1.19       3.41 |      1.19 
--------------+----------------------+----------
        Total |12,489,428      1,380 |12,490,808 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica | outcome: covid death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |12,450,914      1,338 |12,452,252 
              |     99.69      96.96 |     99.69 
--------------+----------------------+----------
    Last year |     3,118          6 |     3,124 
              |      0.02       0.43 |      0.03 
--------------+----------------------+----------
2-5 years ago |     9,665         21 |     9,686 
              |      0.08       1.52 |      0.08 
--------------+----------------------+----------
     5+ years |    25,731         15 |    25,746 
              |      0.21       1.09 |      0.21 
--------------+----------------------+----------
        Total |12,489,428      1,380 |12,490,808 
              |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on | outcome: covid death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |12,448,844      1,354 |12,450,198 
           |     99.68      98.12 |     99.67 
-----------+----------------------+----------
         1 |    40,584         26 |    40,610 
           |      0.32       1.88 |      0.33 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Solid |     indicator for
     organ | outcome: covid death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |12,475,949      1,347 |12,477,296 
           |     99.89      97.61 |     99.89 
-----------+----------------------+----------
         1 |    13,479         33 |    13,512 
           |      0.11       2.39 |      0.11 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
21

**TABLE OF asplenia covid_death REDACTED DUE TO SMALL N**

34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,425,095      1,302 |12,426,397 
           |     99.48      94.35 |     99.48 
-----------+----------------------+----------
         1 |    64,333         78 |    64,411 
           |      0.52       5.65 |      0.52 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic | outcome: covid death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,405,414      1,301 |12,406,715 
           |     99.33      94.28 |     99.33 
-----------+----------------------+----------
         1 |    84,014         79 |    84,093 
           |      0.67       5.72 |      0.67 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or | outcome: covid death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |12,396,591      1,276 |12,397,867 
           |     99.26      92.46 |     99.26 
-----------+----------------------+----------
         1 |    92,837        104 |    92,941 
           |      0.74       7.54 |      0.74 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Calculated | outcome: covid death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     5,048         39 |     5,087 
           |      0.06       3.03 |      0.06 
-----------+----------------------+----------
        15 |     7,017         43 |     7,060 
           |      0.08       3.34 |      0.08 
-----------+----------------------+----------
        30 |    16,978         51 |    17,029 
           |      0.20       3.96 |      0.20 
-----------+----------------------+----------
        45 |   106,526         85 |   106,611 
           |      1.26       6.59 |      1.26 
-----------+----------------------+----------
        60 | 8,320,786      1,071 | 8,321,857 
           |     98.40      83.09 |     98.39 
-----------+----------------------+----------
     Total | 8,456,355      1,289 | 8,457,644 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney | outcome: covid death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |12,353,859      1,162 |12,355,021 
                      |     98.91      84.20 |     98.91 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   123,504        136 |   123,640 
                      |      0.99       9.86 |      0.99 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    12,065         82 |    12,147 
                      |      0.10       5.94 |      0.10 
----------------------+----------------------+----------
                Total |12,489,428      1,380 |12,490,808 
                      |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi | outcome: covid death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |11,133,643        746 |11,134,389 
           |     89.14      54.06 |     89.14 
-----------+----------------------+----------
         1 | 1,355,785        634 | 1,356,419 
           |     10.86      45.94 |     10.86 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,952,660      1,261 |11,953,921 
           |     95.70      91.38 |     95.70 
-----------+----------------------+----------
         1 |   536,768        119 |   536,887 
           |      4.30       8.62 |      4.30 
-----------+----------------------+----------
     Total |12,489,428      1,380 |12,490,808 
           |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation | outcome: covid death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,483,009        172 | 2,483,181 
                 |     19.88      12.46 |     19.88 
-----------------+----------------------+----------
               2 | 2,497,273        207 | 2,497,480 
                 |     20.00      15.00 |     19.99 
-----------------+----------------------+----------
               3 | 2,549,503        249 | 2,549,752 
                 |     20.41      18.04 |     20.41 
-----------------+----------------------+----------
               4 | 2,637,903        390 | 2,638,293 
                 |     21.12      28.26 |     21.12 
-----------------+----------------------+----------
 5 most deprived | 2,321,740        362 | 2,322,102 
                 |     18.59      26.23 |     18.59 
-----------------+----------------------+----------
           Total |12,489,428      1,380 |12,490,808 
                 |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      | outcome: covid death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,855,038        756 | 7,855,794 
                      |     62.89      54.78 |     62.89 
----------------------+----------------------+----------
                Mixed |   167,863         27 |   167,890 
                      |      1.34       1.96 |      1.34 
----------------------+----------------------+----------
Asian or Asian Britis |   870,636        188 |   870,824 
                      |      6.97      13.62 |      6.97 
----------------------+----------------------+----------
                Black |   323,426         98 |   323,524 
                      |      2.59       7.10 |      2.59 
----------------------+----------------------+----------
                Other |   308,867         39 |   308,906 
                      |      2.47       2.83 |      2.47 
----------------------+----------------------+----------
              Unknown | 2,963,598        272 | 2,963,870 
                      |     23.73      19.71 |     23.73 
----------------------+----------------------+----------
                Total |12,489,428      1,380 |12,490,808 
                      |    100.00     100.00 |    100.00 
16

**TABLE OF stp covid_death REDACTED DUE TO SMALL N**

25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 3,032,071        125 | 3,032,196 
           |     24.29       1.68 |     24.28 
-----------+----------------------+----------
    30-<40 | 2,886,285        342 | 2,886,627 
           |     23.12       4.59 |     23.11 
-----------+----------------------+----------
    40-<50 | 2,556,802      1,016 | 2,557,818 
           |     20.48      13.64 |     20.48 
-----------+----------------------+----------
    50-<60 | 2,670,637      2,876 | 2,673,513 
           |     21.39      38.61 |     21.40 
-----------+----------------------+----------
    60-<70 | 1,337,565      3,089 | 1,340,654 
           |     10.71      41.47 |     10.73 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,234,694      3,098 | 6,237,792 
           |     49.94      41.60 |     49.94 
-----------+----------------------+----------
         1 | 6,248,666      4,350 | 6,253,016 
           |     50.06      58.40 |     50.06 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   234,640        407 |   235,047 
                     |      1.88       5.46 |      1.88 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,554,599      2,113 | 3,556,712 
                     |     28.47      28.37 |     28.47 
---------------------+----------------------+----------
Overweight (25-29.9) | 3,097,906      1,765 | 3,099,671 
                     |     24.82      23.70 |     24.82 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,583,042      1,122 | 1,584,164 
                     |     12.68      15.06 |     12.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |   650,221        534 |   650,755 
                     |      5.21       7.17 |      5.21 
---------------------+----------------------+----------
     Obese III (40+) |   352,045        406 |   352,451 
                     |      2.82       5.45 |      2.82 
---------------------+----------------------+----------
        Unknown (.u) | 3,010,907      1,101 | 3,012,008 
                     |     24.12      14.78 |     24.11 
---------------------+----------------------+----------
               Total |12,483,360      7,448 |12,490,808 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,907,433      2,066 | 5,909,499 
             |     47.32      27.74 |     47.31 
-------------+----------------------+----------
      Former | 3,387,920      2,617 | 3,390,537 
             |     27.14      35.14 |     27.14 
-------------+----------------------+----------
     Current | 2,509,466      2,664 | 2,512,130 
             |     20.10      35.77 |     20.11 
-------------+----------------------+----------
Unknown (.u) |   678,541        101 |   678,642 
             |      5.44       1.36 |      5.43 
-------------+----------------------+----------
       Total |12,483,360      7,448 |12,490,808 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,898,052      5,386 | 9,903,438 
                     |     79.29      72.31 |     79.29 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,583,042      1,122 | 1,584,164 
                     |     12.68      15.06 |     12.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |   650,221        534 |   650,755 
                     |      5.21       7.17 |      5.21 
---------------------+----------------------+----------
     Obese III (40+) |   352,045        406 |   352,451 
                     |      2.82       5.45 |      2.82 
---------------------+----------------------+----------
               Total |12,483,360      7,448 |12,490,808 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,936,499      2,695 | 9,939,194 
           |     79.60      36.18 |     79.57 
-----------+----------------------+----------
         1 | 2,546,861      4,753 | 2,551,614 
           |     20.40      63.82 |     20.43 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |12,250,166      6,176 |12,256,342 
           |     98.13      82.92 |     98.12 
-----------+----------------------+----------
         1 |   233,194      1,272 |   234,466 
           |      1.87      17.08 |      1.88 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |10,381,517      6,176 |10,387,693 
           |     83.16      82.92 |     83.16 
-----------+----------------------+----------
         1 | 2,101,843      1,272 | 2,103,115 
           |     16.84      17.08 |     16.84 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |12,145,986      6,111 |12,152,097 
           |     97.30      82.05 |     97.29 
-----------+----------------------+----------
         1 |   337,374      1,337 |   338,711 
           |      2.70      17.95 |      2.71 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |11,696,441      5,671 |11,702,112 
           |     93.70      76.14 |     93.69 
-----------+----------------------+----------
         1 |   786,919      1,777 |   788,696 
           |      6.30      23.86 |      6.31 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |12,225,205      4,691 |12,229,896 
              |     97.93      62.98 |     97.91 
--------------+----------------------+----------
    Last year |    28,087      1,096 |    29,183 
              |      0.22      14.72 |      0.23 
--------------+----------------------+----------
2-5 years ago |    82,480      1,071 |    83,551 
              |      0.66      14.38 |      0.67 
--------------+----------------------+----------
     5+ years |   147,588        590 |   148,178 
              |      1.18       7.92 |      1.19 
--------------+----------------------+----------
        Total |12,483,360      7,448 |12,490,808 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |12,445,043      7,209 |12,452,252 
              |     99.69      96.79 |     99.69 
--------------+----------------------+----------
    Last year |     3,060         64 |     3,124 
              |      0.02       0.86 |      0.03 
--------------+----------------------+----------
2-5 years ago |     9,594         92 |     9,686 
              |      0.08       1.24 |      0.08 
--------------+----------------------+----------
     5+ years |    25,663         83 |    25,746 
              |      0.21       1.11 |      0.21 
--------------+----------------------+----------
        Total |12,483,360      7,448 |12,490,808 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |12,442,850      7,348 |12,450,198 
           |     99.68      98.66 |     99.67 
-----------+----------------------+----------
         1 |    40,510        100 |    40,610 
           |      0.32       1.34 |      0.33 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |12,469,937      7,359 |12,477,296 
           |     99.89      98.81 |     99.89 
-----------+----------------------+----------
         1 |    13,423         89 |    13,512 
           |      0.11       1.19 |      0.11 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |12,469,247      7,385 |12,476,632 
           |     99.89      99.15 |     99.89 
-----------+----------------------+----------
         1 |    14,113         63 |    14,176 
           |      0.11       0.85 |      0.11 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,419,650      6,747 |12,426,397 
           |     99.49      90.59 |     99.48 
-----------+----------------------+----------
         1 |    63,710        701 |    64,411 
           |      0.51       9.41 |      0.52 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,399,591      7,124 |12,406,715 
           |     99.33      95.65 |     99.33 
-----------+----------------------+----------
         1 |    83,769        324 |    84,093 
           |      0.67       4.35 |      0.67 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |12,390,958      6,909 |12,397,867 
           |     99.26      92.76 |     99.26 
-----------+----------------------+----------
         1 |    92,402        539 |    92,941 
           |      0.74       7.24 |      0.74 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Calculated |         death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,964        123 |     5,087 
           |      0.06       1.82 |      0.06 
-----------+----------------------+----------
        15 |     6,938        122 |     7,060 
           |      0.08       1.81 |      0.08 
-----------+----------------------+----------
        30 |    16,852        177 |    17,029 
           |      0.20       2.62 |      0.20 
-----------+----------------------+----------
        45 |   106,254        357 |   106,611 
           |      1.26       5.28 |      1.26 
-----------+----------------------+----------
        60 | 8,315,879      5,978 | 8,321,857 
           |     98.40      88.47 |     98.39 
-----------+----------------------+----------
     Total | 8,450,887      6,757 | 8,457,644 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |12,348,352      6,669 |12,355,021 
                      |     98.92      89.54 |     98.91 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   123,106        534 |   123,640 
                      |      0.99       7.17 |      0.99 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    11,902        245 |    12,147 
                      |      0.10       3.29 |      0.10 
----------------------+----------------------+----------
                Total |12,483,360      7,448 |12,490,808 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |11,129,482      4,907 |11,134,389 
           |     89.15      65.88 |     89.14 
-----------+----------------------+----------
         1 | 1,353,878      2,541 | 1,356,419 
           |     10.85      34.12 |     10.86 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,947,041      6,880 |11,953,921 
           |     95.70      92.37 |     95.70 
-----------+----------------------+----------
         1 |   536,319        568 |   536,887 
           |      4.30       7.63 |      4.30 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,482,065      1,116 | 2,483,181 
                 |     19.88      14.98 |     19.88 
-----------------+----------------------+----------
               2 | 2,496,274      1,206 | 2,497,480 
                 |     20.00      16.19 |     19.99 
-----------------+----------------------+----------
               3 | 2,548,301      1,451 | 2,549,752 
                 |     20.41      19.48 |     20.41 
-----------------+----------------------+----------
               4 | 2,636,631      1,662 | 2,638,293 
                 |     21.12      22.31 |     21.12 
-----------------+----------------------+----------
 5 most deprived | 2,320,089      2,013 | 2,322,102 
                 |     18.59      27.03 |     18.59 
-----------------+----------------------+----------
           Total |12,483,360      7,448 |12,490,808 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,850,674      5,120 | 7,855,794 
                      |     62.89      68.74 |     62.89 
----------------------+----------------------+----------
                Mixed |   167,844         46 |   167,890 
                      |      1.34       0.62 |      1.34 
----------------------+----------------------+----------
Asian or Asian Britis |   870,554        270 |   870,824 
                      |      6.97       3.63 |      6.97 
----------------------+----------------------+----------
                Black |   323,350        174 |   323,524 
                      |      2.59       2.34 |      2.59 
----------------------+----------------------+----------
                Other |   308,853         53 |   308,906 
                      |      2.47       0.71 |      2.47 
----------------------+----------------------+----------
              Unknown | 2,962,085      1,785 | 2,963,870 
                      |     23.73      23.97 |     23.73 
----------------------+----------------------+----------
                Total |12,483,360      7,448 |12,490,808 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: non-covid
Partnershi |         death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |   161,953         76 |   162,029 
           |      1.30       1.02 |      1.30 
-----------+----------------------+----------
         2 | 1,176,235        773 | 1,177,008 
           |      9.42      10.38 |      9.42 
-----------+----------------------+----------
         3 |   533,407        378 |   533,785 
           |      4.27       5.08 |      4.27 
-----------+----------------------+----------
         4 |   122,393         88 |   122,481 
           |      0.98       1.18 |      0.98 
-----------+----------------------+----------
         5 |    86,353         67 |    86,420 
           |      0.69       0.90 |      0.69 
-----------+----------------------+----------
         6 |   579,763        406 |   580,169 
           |      4.64       5.45 |      4.64 
-----------+----------------------+----------
         7 |    35,053         36 |    35,089 
           |      0.28       0.48 |      0.28 
-----------+----------------------+----------
         8 |   450,519        315 |   450,834 
           |      3.61       4.23 |      3.61 
-----------+----------------------+----------
         9 |   348,339        246 |   348,585 
           |      2.79       3.30 |      2.79 
-----------+----------------------+----------
        10 |   492,619        275 |   492,894 
           |      3.95       3.69 |      3.95 
-----------+----------------------+----------
        11 |   551,474        317 |   551,791 
           |      4.42       4.26 |      4.42 
-----------+----------------------+----------
        12 |   187,728        171 |   187,899 
           |      1.50       2.30 |      1.50 
-----------+----------------------+----------
        13 |   274,647        193 |   274,840 
           |      2.20       2.59 |      2.20 
-----------+----------------------+----------
        14 |   344,264        198 |   344,462 
           |      2.76       2.66 |      2.76 
-----------+----------------------+----------
        15 |   442,239        195 |   442,434 
           |      3.54       2.62 |      3.54 
-----------+----------------------+----------
        16 |   434,937        278 |   435,215 
           |      3.48       3.73 |      3.48 
-----------+----------------------+----------
        17 |   376,155        207 |   376,362 
           |      3.01       2.78 |      3.01 
-----------+----------------------+----------
        18 |   549,659        267 |   549,926 
           |      4.40       3.58 |      4.40 
-----------+----------------------+----------
        19 |   425,471        220 |   425,691 
           |      3.41       2.95 |      3.41 
-----------+----------------------+----------
        20 |   606,968        342 |   607,310 
           |      4.86       4.59 |      4.86 
-----------+----------------------+----------
        21 | 1,007,713        322 | 1,008,035 
           |      8.07       4.32 |      8.07 
-----------+----------------------+----------
        22 |    64,829         30 |    64,859 
           |      0.52       0.40 |      0.52 
-----------+----------------------+----------
        23 |   467,984        286 |   468,270 
           |      3.75       3.84 |      3.75 
-----------+----------------------+----------
        24 |    22,343         16 |    22,359 
           |      0.18       0.21 |      0.18 
-----------+----------------------+----------
        25 |   102,181         63 |   102,244 
           |      0.82       0.85 |      0.82 
-----------+----------------------+----------
        26 |   379,644        241 |   379,885 
           |      3.04       3.24 |      3.04 
-----------+----------------------+----------
        27 |   472,834        269 |   473,103 
           |      3.79       3.61 |      3.79 
-----------+----------------------+----------
        28 |   381,750        245 |   381,995 
           |      3.06       3.29 |      3.06 
-----------+----------------------+----------
        29 |   321,354        160 |   321,514 
           |      2.57       2.15 |      2.57 
-----------+----------------------+----------
        30 |   228,906        143 |   229,049 
           |      1.83       1.92 |      1.83 
-----------+----------------------+----------
        31 |    14,485          7 |    14,492 
           |      0.12       0.09 |      0.12 
-----------+----------------------+----------
        32 |   839,161        618 |   839,779 
           |      6.72       8.30 |      6.72 
-----------+----------------------+----------
     Total |12,483,360      7,448 |12,490,808 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |    prob/susp. case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 2,956,341     75,855 | 3,032,196 
           |     24.47      18.57 |     24.28 
-----------+----------------------+----------
    30-<40 | 2,803,024     83,603 | 2,886,627 
           |     23.20      20.46 |     23.11 
-----------+----------------------+----------
    40-<50 | 2,472,867     84,951 | 2,557,818 
           |     20.47      20.79 |     20.48 
-----------+----------------------+----------
    50-<60 | 2,568,452    105,061 | 2,673,513 
           |     21.26      25.71 |     21.40 
-----------+----------------------+----------
    60-<70 | 1,281,544     59,110 | 1,340,654 
           |     10.61      14.47 |     10.73 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,988,851    248,941 | 6,237,792 
           |     49.57      60.93 |     49.94 
-----------+----------------------+----------
         1 | 6,093,377    159,639 | 6,253,016 
           |     50.43      39.07 |     50.06 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |    prob/susp. case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   226,811      8,236 |   235,047 
                     |      1.88       2.02 |      1.88 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,445,776    110,936 | 3,556,712 
                     |     28.52      27.15 |     28.47 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,988,547    111,124 | 3,099,671 
                     |     24.74      27.20 |     24.82 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,514,779     69,385 | 1,584,164 
                     |     12.54      16.98 |     12.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |   616,536     34,219 |   650,755 
                     |      5.10       8.38 |      5.21 
---------------------+----------------------+----------
     Obese III (40+) |   330,427     22,024 |   352,451 
                     |      2.73       5.39 |      2.82 
---------------------+----------------------+----------
        Unknown (.u) | 2,959,352     52,656 | 3,012,008 
                     |     24.49      12.89 |     24.11 
---------------------+----------------------+----------
               Total |12,082,228    408,580 |12,490,808 
                     |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |    prob/susp. case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,735,079    174,420 | 5,909,499 
             |     47.47      42.69 |     47.31 
-------------+----------------------+----------
      Former | 3,254,609    135,928 | 3,390,537 
             |     26.94      33.27 |     27.14 
-------------+----------------------+----------
     Current | 2,422,446     89,684 | 2,512,130 
             |     20.05      21.95 |     20.11 
-------------+----------------------+----------
Unknown (.u) |   670,094      8,548 |   678,642 
             |      5.55       2.09 |      5.43 
-------------+----------------------+----------
       Total |12,082,228    408,580 |12,490,808 
             |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |    prob/susp. case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,620,486    282,952 | 9,903,438 
                     |     79.63      69.25 |     79.29 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,514,779     69,385 | 1,584,164 
                     |     12.54      16.98 |     12.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |   616,536     34,219 |   650,755 
                     |      5.10       8.38 |      5.21 
---------------------+----------------------+----------
     Obese III (40+) |   330,427     22,024 |   352,451 
                     |      2.73       5.39 |      2.82 
---------------------+----------------------+----------
               Total |12,082,228    408,580 |12,490,808 
                     |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
  Probable |    prob/susp. case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,674,977    264,217 | 9,939,194 
           |     80.08      64.67 |     79.57 
-----------+----------------------+----------
         1 | 2,407,251    144,363 | 2,551,614 
           |     19.92      35.33 |     20.43 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
51

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |    prob/susp. case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,875,669    380,673 |12,256,342 
           |     98.29      93.17 |     98.12 
-----------+----------------------+----------
         1 |   206,559     27,907 |   234,466 
           |      1.71       6.83 |      1.88 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |    prob/susp. case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |10,085,202    302,491 |10,387,693 
           |     83.47      74.03 |     83.16 
-----------+----------------------+----------
         1 | 1,997,026    106,089 | 2,103,115 
           |     16.53      25.97 |     16.84 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
47

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |    prob/susp. case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,767,730    384,367 |12,152,097 
           |     97.40      94.07 |     97.29 
-----------+----------------------+----------
         1 |   314,498     24,213 |   338,711 
           |      2.60       5.93 |      2.71 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |11,348,159    353,953 |11,702,112 
           |     93.92      86.63 |     93.69 
-----------+----------------------+----------
         1 |   734,069     54,627 |   788,696 
           |      6.08      13.37 |      6.31 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
41

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |    prob/susp. case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,838,333    391,563 |12,229,896 
              |     97.98      95.84 |     97.91 
--------------+----------------------+----------
    Last year |    26,016      3,167 |    29,183 
              |      0.22       0.78 |      0.23 
--------------+----------------------+----------
2-5 years ago |    77,634      5,917 |    83,551 
              |      0.64       1.45 |      0.67 
--------------+----------------------+----------
     5+ years |   140,245      7,933 |   148,178 
              |      1.16       1.94 |      1.19 
--------------+----------------------+----------
        Total |12,082,228    408,580 |12,490,808 
              |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |    prob/susp. case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |12,048,104    404,148 |12,452,252 
              |     99.72      98.92 |     99.69 
--------------+----------------------+----------
    Last year |     2,605        519 |     3,124 
              |      0.02       0.13 |      0.03 
--------------+----------------------+----------
2-5 years ago |     8,259      1,427 |     9,686 
              |      0.07       0.35 |      0.08 
--------------+----------------------+----------
     5+ years |    23,260      2,486 |    25,746 
              |      0.19       0.61 |      0.21 
--------------+----------------------+----------
        Total |12,082,228    408,580 |12,490,808 
              |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |    prob/susp. case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |12,045,071    405,127 |12,450,198 
           |     99.69      99.15 |     99.67 
-----------+----------------------+----------
         1 |    37,157      3,453 |    40,610 
           |      0.31       0.85 |      0.33 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
35

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |    outcome: covid
     organ |    prob/susp. case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |12,071,281    406,015 |12,477,296 
           |     99.91      99.37 |     99.89 
-----------+----------------------+----------
         1 |    10,947      2,565 |    13,512 
           |      0.09       0.63 |      0.11 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |12,070,711    405,921 |12,476,632 
           |     99.90      99.35 |     99.89 
-----------+----------------------+----------
         1 |    11,517      2,659 |    14,176 
           |      0.10       0.65 |      0.11 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
45

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |    prob/susp. case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,023,322    403,075 |12,426,397 
           |     99.51      98.65 |     99.48 
-----------+----------------------+----------
         1 |    58,906      5,505 |    64,411 
           |      0.49       1.35 |      0.52 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
35

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |    prob/susp. case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,004,267    402,448 |12,406,715 
           |     99.35      98.50 |     99.33 
-----------+----------------------+----------
         1 |    77,961      6,132 |    84,093 
           |      0.65       1.50 |      0.67 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |    prob/susp. case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,996,321    401,546 |12,397,867 
           |     99.29      98.28 |     99.26 
-----------+----------------------+----------
         1 |    85,907      7,034 |    92,941 
           |      0.71       1.72 |      0.74 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |    prob/susp. case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,096        991 |     5,087 
           |      0.05       0.29 |      0.06 
-----------+----------------------+----------
        15 |     6,116        944 |     7,060 
           |      0.08       0.28 |      0.08 
-----------+----------------------+----------
        30 |    15,146      1,883 |    17,029 
           |      0.19       0.55 |      0.20 
-----------+----------------------+----------
        45 |    99,983      6,628 |   106,611 
           |      1.23       1.93 |      1.26 
-----------+----------------------+----------
        60 | 7,989,070    332,787 | 8,321,857 
           |     98.46      96.96 |     98.39 
-----------+----------------------+----------
     Total | 8,114,411    343,233 | 8,457,644 
           |    100.00     100.00 |    100.00 
47

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |    prob/susp. case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,956,887    398,134 |12,355,021 
                      |     98.96      97.44 |     98.91 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   115,129      8,511 |   123,640 
                      |      0.95       2.08 |      0.99 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    10,212      1,935 |    12,147 
                      |      0.08       0.47 |      0.10 
----------------------+----------------------+----------
                Total |12,082,228    408,580 |12,490,808 
                      |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |    prob/susp. case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |10,800,433    333,956 |11,134,389 
           |     89.39      81.74 |     89.14 
-----------+----------------------+----------
         1 | 1,281,795     74,624 | 1,356,419 
           |     10.61      18.26 |     10.86 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |    prob/susp. case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,577,094    376,827 |11,953,921 
           |     95.82      92.23 |     95.70 
-----------+----------------------+----------
         1 |   505,134     31,753 |   536,887 
           |      4.18       7.77 |      4.30 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |    prob/susp. case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,411,626     71,555 | 2,483,181 
                 |     19.96      17.51 |     19.88 
-----------------+----------------------+----------
               2 | 2,421,975     75,505 | 2,497,480 
                 |     20.05      18.48 |     19.99 
-----------------+----------------------+----------
               3 | 2,464,408     85,344 | 2,549,752 
                 |     20.40      20.89 |     20.41 
-----------------+----------------------+----------
               4 | 2,546,581     91,712 | 2,638,293 
                 |     21.08      22.45 |     21.12 
-----------------+----------------------+----------
 5 most deprived | 2,237,638     84,464 | 2,322,102 
                 |     18.52      20.67 |     18.59 
-----------------+----------------------+----------
           Total |12,082,228    408,580 |12,490,808 
                 |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |    prob/susp. case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,584,235    271,559 | 7,855,794 
                      |     62.77      66.46 |     62.89 
----------------------+----------------------+----------
                Mixed |   162,373      5,517 |   167,890 
                      |      1.34       1.35 |      1.34 
----------------------+----------------------+----------
Asian or Asian Britis |   840,831     29,993 |   870,824 
                      |      6.96       7.34 |      6.97 
----------------------+----------------------+----------
                Black |   311,332     12,192 |   323,524 
                      |      2.58       2.98 |      2.59 
----------------------+----------------------+----------
                Other |   301,983      6,923 |   308,906 
                      |      2.50       1.69 |      2.47 
----------------------+----------------------+----------
              Unknown | 2,881,474     82,396 | 2,963,870 
                      |     23.85      20.17 |     23.73 
----------------------+----------------------+----------
                Total |12,082,228    408,580 |12,490,808 
                      |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |    outcome: covid
Partnershi |    prob/susp. case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |   157,506      4,523 |   162,029 
           |      1.30       1.11 |      1.30 
-----------+----------------------+----------
         2 | 1,131,418     45,590 | 1,177,008 
           |      9.36      11.16 |      9.42 
-----------+----------------------+----------
         3 |   512,171     21,614 |   533,785 
           |      4.24       5.29 |      4.27 
-----------+----------------------+----------
         4 |   120,562      1,919 |   122,481 
           |      1.00       0.47 |      0.98 
-----------+----------------------+----------
         5 |    83,090      3,330 |    86,420 
           |      0.69       0.82 |      0.69 
-----------+----------------------+----------
         6 |   562,382     17,787 |   580,169 
           |      4.65       4.35 |      4.64 
-----------+----------------------+----------
         7 |    34,781        308 |    35,089 
           |      0.29       0.08 |      0.28 
-----------+----------------------+----------
         8 |   438,327     12,507 |   450,834 
           |      3.63       3.06 |      3.61 
-----------+----------------------+----------
         9 |   339,303      9,282 |   348,585 
           |      2.81       2.27 |      2.79 
-----------+----------------------+----------
        10 |   479,458     13,436 |   492,894 
           |      3.97       3.29 |      3.95 
-----------+----------------------+----------
        11 |   535,300     16,491 |   551,791 
           |      4.43       4.04 |      4.42 
-----------+----------------------+----------
        12 |   184,354      3,545 |   187,899 
           |      1.53       0.87 |      1.50 
-----------+----------------------+----------
        13 |   261,902     12,938 |   274,840 
           |      2.17       3.17 |      2.20 
-----------+----------------------+----------
        14 |   333,892     10,570 |   344,462 
           |      2.76       2.59 |      2.76 
-----------+----------------------+----------
        15 |   428,675     13,759 |   442,434 
           |      3.55       3.37 |      3.54 
-----------+----------------------+----------
        16 |   415,620     19,595 |   435,215 
           |      3.44       4.80 |      3.48 
-----------+----------------------+----------
        17 |   369,389      6,973 |   376,362 
           |      3.06       1.71 |      3.01 
-----------+----------------------+----------
        18 |   528,417     21,509 |   549,926 
           |      4.37       5.26 |      4.40 
-----------+----------------------+----------
        19 |   403,006     22,685 |   425,691 
           |      3.34       5.55 |      3.41 
-----------+----------------------+----------
        20 |   586,610     20,700 |   607,310 
           |      4.86       5.07 |      4.86 
-----------+----------------------+----------
        21 |   981,198     26,837 | 1,008,035 
           |      8.12       6.57 |      8.07 
-----------+----------------------+----------
        22 |    64,333        526 |    64,859 
           |      0.53       0.13 |      0.52 
-----------+----------------------+----------
        23 |   455,347     12,923 |   468,270 
           |      3.77       3.16 |      3.75 
-----------+----------------------+----------
        24 |    22,023        336 |    22,359 
           |      0.18       0.08 |      0.18 
-----------+----------------------+----------
        25 |   100,012      2,232 |   102,244 
           |      0.83       0.55 |      0.82 
-----------+----------------------+----------
        26 |   370,268      9,617 |   379,885 
           |      3.06       2.35 |      3.04 
-----------+----------------------+----------
        27 |   456,334     16,769 |   473,103 
           |      3.78       4.10 |      3.79 
-----------+----------------------+----------
        28 |   365,619     16,376 |   381,995 
           |      3.03       4.01 |      3.06 
-----------+----------------------+----------
        29 |   309,879     11,635 |   321,514 
           |      2.56       2.85 |      2.57 
-----------+----------------------+----------
        30 |   219,844      9,205 |   229,049 
           |      1.82       2.25 |      1.83 
-----------+----------------------+----------
        31 |    14,180        312 |    14,492 
           |      0.12       0.08 |      0.12 
-----------+----------------------+----------
        32 |   817,028     22,751 |   839,779 
           |      6.76       5.57 |      6.72 
-----------+----------------------+----------
     Total |12,082,228    408,580 |12,490,808 
           |    100.00     100.00 |    100.00 

. 
. 
. ********************************************
. *  Cumulative incidence of ONS COVID DEATH*
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_death.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

              Beg.                      Failure
    Time     Total     Fail             Function 
------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000 
      80   1.6e+06        5              0.0000 
18-<30 male=1 
       0         0        0              0.0000 
      80   1.5e+06        7              0.0000 
30-<40 male=0 
       0         0        0              0.0000 
      80   1.4e+06       16              0.0000 
30-<40 male=1 
       0         0        0              0.0000 
      80   1.4e+06       16              0.0000 
40-<50 male=0 
       0         0        0              0.0000 
      80   1.2e+06       37              0.0000 
40-<50 male=1 
       0         0        0              0.0000 
      80   1.3e+06       69              0.0001 
50-<60 male=0 
       0         0        0              0.0000 
      80   1.3e+06      119              0.0001 
50-<60 male=1 
       0         0        0              0.0000 
      80   1.4e+06      238              0.0002 
60-<70 male=0 
       0         0        0              0.0000 
      80    673543      123              0.0002 
60-<70 male=1 
       0         0        0              0.0000 
      80    666715      259              0.0004 
------------------------------------------------
Note: Failure function is calculated over full
      data and evaluated at indicated times; it
      is not calculated from aggregates shown at
      left.

. 
. ***************************************
. *  Cumulative incidence of TPP COVID PROB/SUSP CASES *
. ***************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob_or_susp.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_tpp_prob_or_susp
   analysis time _t:  (stime_covid_tpp_prob_or_susp-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

              Beg.                      Failure
    Time     Total     Fail             Function 
------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000 
      80   1.5e+06    32139              0.0207 
18-<30 male=1 
       0         0        0              0.0000 
      80   1.5e+06    16295              0.0109 
30-<40 male=0 
       0         0        0              0.0000 
      80   1.4e+06    35226              0.0244 
30-<40 male=1 
       0         0        0              0.0000 
      80   1.4e+06    20236              0.0141 
40-<50 male=0 
       0         0        0              0.0000 
      80   1.2e+06    34662              0.0280 
40-<50 male=1 
       0         0        0              0.0000 
      80   1.3e+06    22567              0.0172 
50-<60 male=0 
       0         0        0              0.0000 
      80   1.3e+06    40903              0.0309 
50-<60 male=1 
       0         0        0              0.0000 
      80   1.3e+06    29480              0.0218 
60-<70 male=0 
       0         0        0              0.0000 
      80    652547    21307              0.0316 
60-<70 male=1 
       0         0        0              0.0000 
      80    648674    18215              0.0273 
------------------------------------------------
Note: Failure function is calculated over full
      data and evaluated at indicated times; it
      is not calculated from aggregates shown at
      left.

. 
. ***************************************
. *  Cumulative incidence of TPP COVID PROBABLE CASES *
. ***************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

              Beg.                      Failure
    Time     Total     Fail             Function 
------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000 
      80   1.6e+06      894              0.0006 
18-<30 male=1 
       0         0        0              0.0000 
      80   1.5e+06      430              0.0003 
30-<40 male=0 
       0         0        0              0.0000 
      80   1.4e+06     1340              0.0009 
30-<40 male=1 
       0         0        0              0.0000 
      80   1.4e+06      831              0.0006 
40-<50 male=0 
       0         0        0              0.0000 
      80   1.2e+06     1607              0.0013 
40-<50 male=1 
       0         0        0              0.0000 
      80   1.3e+06     1160              0.0009 
50-<60 male=0 
       0         0        0              0.0000 
      80   1.3e+06     2080              0.0016 
50-<60 male=1 
       0         0        0              0.0000 
      80   1.4e+06     1877              0.0014 
60-<70 male=0 
       0         0        0              0.0000 
      80    672443      940              0.0014 
60-<70 male=1 
       0         0        0              0.0000 
      80    665912     1083              0.0016 
------------------------------------------------
Note: Failure function is calculated over full
      data and evaluated at indicated times; it
      is not calculated from aggregates shown at
      left.

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\04a_an_descriptive_tables.log
  log type:  text
 closed on:  24 Jul 2020, 14:29:16
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
