----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_interaction_cox_models_covid_death_time.log
  log type:  text
 opened on:  24 Jul 2020, 13:44:03

. 
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. stset
-> stset stime_covid_death [pweight=pw], id(patient_id) failure(covid_death)
                           enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=pw]

------------------------------------------------------------------------------
    376,101  total observations
          0  exclusions
------------------------------------------------------------------------------
    376,101  observations remaining, representing
    376,101  subjects
      1,380  failures in single-failure-per-subject data
   51052388  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       136

. 
. *Split data by time of study period: days to April 3rd (31 d March, 3d April)
. stsplit cat_time, at(0,34, 200)
(376,040 observations (episodes) created)

. recode cat_time 34=1 200=2 
(cat_time: 376040 changes made)

. recode `outcome' .=0 
(covid_death: 376040 changes made)

. tab cat_time

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    376,101       50.00       50.00
          1 |    376,040       50.00      100.00
------------+-----------------------------------
      Total |    752,141      100.00

.  
. /*Overlapping time periods
> gen cat_time0=1 if cat==0
> gen cat_time1=1 if cat==0 | cat==0.25
> */
.         
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interaction(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.  stcox  `exposure' `age'                                        ///
>                         i.male                                                  ///
>                         i.obese4cat                                             ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                   ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                                ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabetes                                              ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.organ_trans                           ///
>                         i.asplenia                                              ///
>                         i.tot_adults_hh                         ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                  ///
>                         `interaction'                                                   ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. foreach int_type in cat_time  {
  2. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  3. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  4. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposu
> re_type')
  5. if _rc==0{
  6. testparm 1.`int_type'#i.`exposure_type'
  7. di _n "`exposure_type' <66" _n "****************"
  8. lincom 2.`exposure_type', eform
  9. di "`exposure_type' 66+" _n "****************"
 10. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 11. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noe
> th, replace
 12. }
 13. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 14. 
. }
 15. 
. }

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 24,982,125.713779)
Iteration 0:   log pseudolikelihood = -18182.637
Iteration 1:   log pseudolikelihood =  -17838.83
Iteration 2:   log pseudolikelihood = -17515.087
Iteration 3:   log pseudolikelihood = -16303.597
Iteration 4:   log pseudolikelihood =  -16102.33
Iteration 5:   log pseudolikelihood =  -16097.94
Iteration 6:   log pseudolikelihood = -16097.917
Iteration 7:   log pseudolikelihood = -16097.917
Refining estimates:
Iteration 0:   log pseudolikelihood = -16097.917

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,080             Number of obs    =     752,141
No. of failures      =        1,380
Time at risk         =   1698315732
                                                Wald chi2(37)    =     4352.85
Log pseudolikelihood =   -16097.917             Prob > chi2      =      0.0000

                                      (Std. Err. adjusted for 368,774 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .8330252   .0834989    -1.82   0.068     .6844432    1.013862
               Kids under 18  |   .9836872   .1101776    -0.15   0.883     .7898023    1.225168
                              |
                         age1 |   1.188771   .0590403     3.48   0.000     1.078507    1.310307
                         age2 |   .8587415   .1144845    -1.14   0.253     .6612766    1.115172
                         age3 |   1.179892   .4503366     0.43   0.665     .5584177    2.493019
                       1.male |   1.899101   .1154593    10.55   0.000     1.685767    2.139431
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.203376   .0907487     2.45   0.014     1.038032    1.395056
          Obese II (35-39.9)  |   1.832689   .1710721     6.49   0.000     1.526278    2.200615
             Obese III (40+)  |   1.998464   .2266137     6.11   0.000     1.600203    2.495844
                              |
                 smoke_nomiss |
                      Former  |   .9962694     .06363    -0.06   0.953     .8790468    1.129124
                     Current  |   .6415103    .057101    -4.99   0.000     .5388128    .7637819
                              |
                          imd |
                           2  |   1.191559   .1274936     1.64   0.101     .9661381    1.469575
                           3  |   1.328221   .1390921     2.71   0.007     1.081762     1.63083
                           4  |   1.883284   .1866512     6.39   0.000     1.550793    2.287062
             5 most deprived  |   1.914933   .2027821     6.14   0.000     1.556021    2.356631
                              |
           1.htdiag_or_highbp |   1.245891   .0807303     3.39   0.001     1.097298    1.414606
1.chronic_respiratory_disease |   2.582724   .2414158    10.15   0.000     2.150371    3.102006
                     1.asthma |   1.145027   .0857535     1.81   0.071      .988707    1.326063
    1.chronic_cardiac_disease |   1.604481   .1378094     5.50   0.000      1.35589    1.898648
                   1.diabetes |   2.406937   .1680305    12.58   0.000     2.099141    2.759865
                              |
            cancer_exhaem_cat |
                   Last year  |   4.203025   .8381501     7.20   0.000     2.843274    6.213053
               2-5 years ago  |   2.569658   .4033656     6.01   0.000     1.889123    3.495349
                    5+ years  |   1.509072   .2372161     2.62   0.009     1.108937    2.053587
                              |
              cancer_haem_cat |
                   Last year  |   5.864755   2.594942     4.00   0.000     2.463905    13.95969
               2-5 years ago  |   7.342466   1.953825     7.49   0.000     4.358508    12.36933
                    5+ years  |    2.28864   .6591035     2.87   0.004     1.301489    4.024522
                              |
      1.chronic_liver_disease |    3.50814   .5568367     7.91   0.000     2.570208    4.788347
            1.stroke_dementia |   1.708671   .2377247     3.85   0.000     1.300865     2.24432
                1.other_neuro |   5.001294   .7073189    11.38   0.000     3.790525    6.598807
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.411439    .259287     8.19   0.000     1.953223     2.97715
           Stage 4/5 egfr<30  |   9.938645   1.731963    13.18   0.000     7.063047    13.98499
                              |
                1.organ_trans |    1.86105   .4470518     2.59   0.010     1.162216    2.980089
                   1.asplenia |   1.372276   .6480046     0.67   0.503     .5438692    3.462491
                              |
                tot_adults_hh |
                           2  |   .8145005   .0625986    -2.67   0.008     .7006032    .9469141
                           3  |   1.123182   .0834091     1.56   0.118     .9710434    1.299157
                              |
           1.ra_sle_psoriasis |   1.323115   .1360056     2.72   0.006     1.081685    1.618431
               1.other_immuno |   2.650664   .6264716     4.12   0.000     1.667928    4.212423
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:    215.50 /        1 =     215.5050

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 24,982,125.713779)
Iteration 0:   log pseudolikelihood = -18182.637
Iteration 1:   log pseudolikelihood =  -17838.83
Iteration 2:   log pseudolikelihood = -17515.087
Iteration 3:   log pseudolikelihood = -16303.597
Iteration 4:   log pseudolikelihood =  -16102.33
Iteration 5:   log pseudolikelihood =  -16097.94
Iteration 6:   log pseudolikelihood = -16097.917
Iteration 7:   log pseudolikelihood = -16097.917
Refining estimates:
Iteration 0:   log pseudolikelihood = -16097.917

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,080             Number of obs    =     752,141
No. of failures      =        1,380
Time at risk         =   1698315732
                                                Wald chi2(37)    =     4331.97
Log pseudolikelihood =   -16097.917             Prob > chi2      =      0.0000

                                      (Std. Err. adjusted for 368,774 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.014112   .1016502     0.14   0.889     .8332307     1.23426
               Kids under 18  |   .8305779   .0930287    -1.66   0.097     .6668708    1.034473
                              |
                         age1 |   1.188771   .0590403     3.48   0.000     1.078507    1.310307
                         age2 |   .8587415   .1144845    -1.14   0.253     .6612766    1.115172
                         age3 |   1.179892   .4503366     0.43   0.665     .5584177    2.493019
                       1.male |   1.899101   .1154593    10.55   0.000     1.685767    2.139431
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.203376   .0907487     2.45   0.014     1.038032    1.395056
          Obese II (35-39.9)  |   1.832689   .1710721     6.49   0.000     1.526278    2.200615
             Obese III (40+)  |   1.998464   .2266137     6.11   0.000     1.600203    2.495844
                              |
                 smoke_nomiss |
                      Former  |   .9962694     .06363    -0.06   0.953     .8790468    1.129124
                     Current  |   .6415103    .057101    -4.99   0.000     .5388128    .7637819
                              |
                          imd |
                           2  |   1.191559   .1274936     1.64   0.101     .9661381    1.469575
                           3  |   1.328221   .1390921     2.71   0.007     1.081762     1.63083
                           4  |   1.883284   .1866512     6.39   0.000     1.550793    2.287062
             5 most deprived  |   1.914933   .2027821     6.14   0.000     1.556021    2.356631
                              |
           1.htdiag_or_highbp |   1.245891   .0807303     3.39   0.001     1.097298    1.414606
1.chronic_respiratory_disease |   2.582724   .2414158    10.15   0.000     2.150371    3.102006
                     1.asthma |   1.145027   .0857535     1.81   0.071      .988707    1.326063
    1.chronic_cardiac_disease |   1.604481   .1378094     5.50   0.000      1.35589    1.898648
                   1.diabetes |   2.406937   .1680305    12.58   0.000     2.099141    2.759865
                              |
            cancer_exhaem_cat |
                   Last year  |   4.203025   .8381501     7.20   0.000     2.843274    6.213053
               2-5 years ago  |   2.569658   .4033656     6.01   0.000     1.889123    3.495349
                    5+ years  |   1.509072   .2372161     2.62   0.009     1.108937    2.053587
                              |
              cancer_haem_cat |
                   Last year  |   5.864755   2.594942     4.00   0.000     2.463905    13.95969
               2-5 years ago  |   7.342466   1.953825     7.49   0.000     4.358508    12.36933
                    5+ years  |    2.28864   .6591035     2.87   0.004     1.301489    4.024522
                              |
      1.chronic_liver_disease |    3.50814   .5568367     7.91   0.000     2.570208    4.788347
            1.stroke_dementia |   1.708671   .2377247     3.85   0.000     1.300865     2.24432
                1.other_neuro |   5.001294   .7073189    11.38   0.000     3.790525    6.598807
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.411439    .259287     8.19   0.000     1.953223     2.97715
           Stage 4/5 egfr<30  |   9.938645   1.731963    13.18   0.000     7.063047    13.98499
                              |
                1.organ_trans |    1.86105   .4470518     2.59   0.010     1.162216    2.980089
                   1.asplenia |   1.372276   .6480046     0.67   0.503     .5438692    3.462491
                              |
                tot_adults_hh |
                           2  |   .8145005   .0625986    -2.67   0.008     .7006032    .9469141
                           3  |   1.123182   .0834091     1.56   0.118     .9710434    1.299157
                              |
           1.ra_sle_psoriasis |   1.323115   .1360056     2.72   0.006     1.081685    1.618431
               1.other_immuno |   2.650664   .6264716     4.12   0.000     1.667928    4.212423
                              |
           cat_time#kids_cat3 |
             1#Kids under 12  |    .821433          .        .       .            .           .
             1#Kids under 18  |   1.184341          .        .       .            .           .
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:    214.18 /        1 =     214.1840

 ( 1)  1.cat_time#1.kids_cat3 = 0
 ( 2)  1.cat_time#2.kids_cat3 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8305779   .0930287    -1.66   0.097     .6668708    1.034473
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.cat_time#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9836872   .1101776    -0.15   0.883     .7898023    1.225168
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth.ster not fo
> und)
file ./output/an_interaction_cox_models_covid_death_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_interaction_cox_models_covid_death_time.log
  log type:  text
 closed on:  24 Jul 2020, 13:51:31
----------------------------------------------------------------------------------------------------------------------------------
