----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_interaction_cox_models_covid_tpp_prob_time.log
  log type:  text
 opened on:  24 Jul 2020, 13:44:05

. 
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. stset
-> stset stime_covid_tpp_prob [pweight=pw], id(patient_id)
                              failure(covid_tpp_prob) enter(time enter_date)
                              origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=pw]

------------------------------------------------------------------------------
    397,151  total observations
          0  exclusions
------------------------------------------------------------------------------
    397,151  observations remaining, representing
    397,151  subjects
     23,055  failures in single-failure-per-subject data
   52961958  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       136

. 
. *Split data by time of study period: days to April 3rd (31 d March, 3d April)
. stsplit cat_time, at(0,34, 200)
(397,052 observations (episodes) created)

. recode cat_time 34=1 200=2 
(cat_time: 397052 changes made)

. recode `outcome' .=0 
(covid_tpp_prob: 397052 changes made)

. tab cat_time

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    397,151       50.01       50.01
          1 |    397,052       49.99      100.00
------------+-----------------------------------
      Total |    794,203      100.00

.  
. /*Overlapping time periods
> gen cat_time0=1 if cat==0
> gen cat_time1=1 if cat==0 | cat==0.25
> */
.         
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interaction(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.  stcox  `exposure' `age'                                        ///
>                         i.male                                                  ///
>                         i.obese4cat                                             ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                   ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                                ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabetes                                              ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.organ_trans                           ///
>                         i.asplenia                                              ///
>                         i.tot_adults_hh                         ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                  ///
>                         `interaction'                                                   ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. foreach int_type in cat_time  {
  2. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  3. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  4. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposu
> re_type')
  5. if _rc==0{
  6. testparm 1.`int_type'#i.`exposure_type'
  7. di _n "`exposure_type' <66" _n "****************"
  8. lincom 2.`exposure_type', eform
  9. di "`exposure_type' 66+" _n "****************"
 10. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 11. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noe
> th, replace
 12. }
 13. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 14. 
. }
 15. 
. }

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 24,983,771.048702)
Iteration 0:   log pseudolikelihood = -303880.32
Iteration 1:   log pseudolikelihood = -301471.38
Iteration 2:   log pseudolikelihood = -299356.51
Iteration 3:   log pseudolikelihood = -298993.83
Iteration 4:   log pseudolikelihood = -298931.99
Iteration 5:   log pseudolikelihood = -298928.16
Iteration 6:   log pseudolikelihood = -298928.13
Refining estimates:
Iteration 0:   log pseudolikelihood = -298928.13

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,921             Number of obs    =     794,203
No. of failures      =       23,055
Time at risk         =   1697424492
                                                Wald chi2(37)    =     9580.68
Log pseudolikelihood =   -298928.13             Prob > chi2      =      0.0000

                                      (Std. Err. adjusted for 387,798 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |    1.07898   .0204835     4.00   0.000     1.039571    1.119883
               Kids under 18  |   1.128481   .0283674     4.81   0.000      1.07423    1.185473
                              |
                         age1 |   1.054726   .0051654    10.88   0.000      1.04465    1.064899
                         age2 |   .9214652   .0146735    -5.14   0.000     .8931498    .9506783
                         age3 |   1.072476    .059793     1.26   0.209     .9614601    1.196311
                       1.male |   .7347967    .010321   -21.94   0.000     .7148438    .7553066
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.320176   .0255515    14.35   0.000     1.271034    1.371218
          Obese II (35-39.9)  |   1.476337    .038741    14.85   0.000     1.402326    1.554255
             Obese III (40+)  |    1.61277   .0519934    14.83   0.000     1.514017    1.717963
                              |
                 smoke_nomiss |
                      Former  |   .9638604   .0155678    -2.28   0.023      .933826    .9948607
                     Current  |   .5595259   .0123708   -26.26   0.000     .5357974    .5843052
                              |
                          imd |
                           2  |   1.125743    .027549     4.84   0.000     1.073022    1.181054
                           3  |   1.158731   .0286163     5.97   0.000      1.10398    1.216197
                           4  |   1.317918   .0317688    11.45   0.000       1.2571    1.381678
             5 most deprived  |   1.505073   .0376239    16.35   0.000     1.433109    1.580651
                              |
           1.htdiag_or_highbp |   1.189798   .0204419    10.11   0.000       1.1504    1.230546
1.chronic_respiratory_disease |   1.938479   .0694002    18.49   0.000      1.80712    2.079387
                     1.asthma |      1.301   .0228837    14.96   0.000     1.256913    1.346633
    1.chronic_cardiac_disease |   1.408417   .0464712    10.38   0.000     1.320218    1.502509
                   1.diabetes |   1.785986   .0398752    25.98   0.000     1.709518    1.865875
                              |
            cancer_exhaem_cat |
                   Last year  |   1.946206    .181752     7.13   0.000     1.620679    2.337119
               2-5 years ago  |   1.253001   .0864827     3.27   0.001     1.094463    1.434503
                    5+ years  |   1.109589   .0608552     1.90   0.058     .9965018    1.235509
                              |
              cancer_haem_cat |
                   Last year  |    3.35635   .7039333     5.77   0.000     2.225068    5.062806
               2-5 years ago  |   3.228618   .4478894     8.45   0.000     2.459993      4.2374
                    5+ years  |   1.873463   .1985375     5.92   0.000      1.52209     2.30595
                              |
      1.chronic_liver_disease |   1.822225   .1242164     8.80   0.000     1.594328    2.082697
            1.stroke_dementia |    1.52086   .0849933     7.50   0.000     1.363075    1.696909
                1.other_neuro |   1.669802   .1046882     8.18   0.000     1.476722    1.888126
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.344764   .0681617     5.84   0.000     1.217591     1.48522
           Stage 4/5 egfr<30  |   3.871242   .4069605    12.88   0.000     3.150421    4.756988
                              |
                1.organ_trans |   1.726027   .2027202     4.65   0.000     1.371118    2.172803
                   1.asplenia |   2.559917   .3153612     7.63   0.000     2.010781    3.259021
                              |
                tot_adults_hh |
                           2  |    1.01789   .0196785     0.92   0.359     .9800421    1.057199
                           3  |   1.148605   .0224483     7.09   0.000     1.105439    1.193456
                              |
           1.ra_sle_psoriasis |   1.246047   .0365065     7.51   0.000     1.176511    1.319692
               1.other_immuno |   2.305208   .1874439    10.27   0.000     1.965604    2.703485
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:    163.51 /        1 =     163.5070

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 24,983,771.048702)
Iteration 0:   log pseudolikelihood = -303880.32
Iteration 1:   log pseudolikelihood = -301470.94
Iteration 2:   log pseudolikelihood = -299356.03
Iteration 3:   log pseudolikelihood = -298993.36
Iteration 4:   log pseudolikelihood = -298931.51
Iteration 5:   log pseudolikelihood = -298927.68
Iteration 6:   log pseudolikelihood = -298927.66
Refining estimates:
Iteration 0:   log pseudolikelihood = -298927.66

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,921             Number of obs    =     794,203
No. of failures      =       23,055
Time at risk         =   1697424492
                                                Wald chi2(39)    =     9581.30
Log pseudolikelihood =   -298927.66             Prob > chi2      =      0.0000

                                      (Std. Err. adjusted for 387,798 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9880651   .3871564    -0.03   0.976     .4584129     2.12968
               Kids under 18  |   1.713748   .7848983     1.18   0.240     .6983863    4.205311
                              |
                         age1 |   1.054727   .0051654    10.88   0.000     1.044651      1.0649
                         age2 |   .9214627   .0146735    -5.14   0.000     .8931474    .9506756
                         age3 |   1.072484   .0597934     1.26   0.209     .9614676     1.19632
                       1.male |    .734796    .010321   -21.94   0.000     .7148431    .7553059
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.320175   .0255515    14.35   0.000     1.271033    1.371217
          Obese II (35-39.9)  |   1.476336   .0387409    14.85   0.000     1.402325    1.554254
             Obese III (40+)  |   1.612771   .0519933    14.83   0.000     1.514019    1.717965
                              |
                 smoke_nomiss |
                      Former  |   .9638581   .0155677    -2.28   0.023     .9338238    .9948584
                     Current  |   .5595243   .0123708   -26.26   0.000     .5357959    .5843036
                              |
                          imd |
                           2  |   1.125743   .0275489     4.84   0.000     1.073022    1.181054
                           3  |   1.158728   .0286162     5.97   0.000     1.103977    1.216195
                           4  |   1.317915   .0317687    11.45   0.000     1.257097    1.381674
             5 most deprived  |    1.50507   .0376238    16.35   0.000     1.433106    1.580648
                              |
           1.htdiag_or_highbp |   1.189797   .0204419    10.11   0.000     1.150399    1.230545
1.chronic_respiratory_disease |   1.938489   .0694008    18.49   0.000     1.807128    2.079397
                     1.asthma |      1.301   .0228837    14.96   0.000     1.256914    1.346634
    1.chronic_cardiac_disease |   1.408421   .0464713    10.38   0.000     1.320221    1.502512
                   1.diabetes |   1.785982   .0398751    25.98   0.000     1.709513    1.865871
                              |
            cancer_exhaem_cat |
                   Last year  |   1.946211   .1817528     7.13   0.000     1.620682    2.337125
               2-5 years ago  |   1.253005    .086483     3.27   0.001     1.094466    1.434508
                    5+ years  |   1.109589   .0608552     1.90   0.058     .9965015    1.235509
                              |
              cancer_haem_cat |
                   Last year  |   3.356275   .7039175     5.77   0.000     2.225018    5.062692
               2-5 years ago  |   3.228681   .4478934     8.45   0.000     2.460048     4.23747
                    5+ years  |   1.873493   .1985409     5.92   0.000     1.522114    2.305988
                              |
      1.chronic_liver_disease |   1.822221    .124216     8.80   0.000     1.594326    2.082693
            1.stroke_dementia |   1.520862   .0849933     7.50   0.000     1.363078    1.696912
                1.other_neuro |   1.669797   .1046877     8.18   0.000     1.476719    1.888121
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.344753   .0681613     5.84   0.000     1.217581    1.485208
           Stage 4/5 egfr<30  |   3.871316   .4069666    12.88   0.000     3.150484    4.757075
                              |
                1.organ_trans |   1.726034   .2027208     4.65   0.000     1.371124    2.172811
                   1.asplenia |   2.559875   .3153537     7.63   0.000     2.010752    3.258961
                              |
                tot_adults_hh |
                           2  |   1.017887   .0196785     0.92   0.359     .9800397    1.057196
                           3  |   1.148604   .0224482     7.09   0.000     1.105438    1.193455
                              |
           1.ra_sle_psoriasis |   1.246048   .0365065     7.51   0.000     1.176512    1.319694
               1.other_immuno |   2.305213   .1874454    10.27   0.000     1.965607    2.703494
                              |
           cat_time#kids_cat3 |
             1#Kids under 12  |   1.092159   .4281251     0.22   0.822     .5065423     2.35481
             1#Kids under 18  |   .6579468   .3016588    -0.91   0.361     .2678721    1.616047
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:    166.57 /        1 =     166.5750

 ( 1)  1.cat_time#1.kids_cat3 = 0
 ( 2)  1.cat_time#2.kids_cat3 = 0

           chi2(  2) =    1.04
         Prob > chi2 =    0.5949

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.713748   .7848983     1.18   0.240     .6983863    4.205311
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.cat_time#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.127555   .0283749     4.77   0.000      1.07329    1.184563
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth.ster not
>  found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_interaction_cox_models_covid_tpp_prob_time.log
  log type:  text
 closed on:  24 Jul 2020, 13:49:53
----------------------------------------------------------------------------------------------------------------------------------
