----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_covid_tpp_prob_or_susp.log
  log type:  text
 opened on:  24 Jul 2020, 13:43:36

. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                                        ///
>                         i.male                                                  ///
>                         `bmi'                                   ///
>                         `smoking'                                       ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         i.tot_adults_hh                         ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. foreach exposure_type in kids_cat3  ///
>                 gp_number_kids {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  9. if _rc==0{
 10. estimates
 11. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth, replace
 12. *estat concordance /*c-statistic*/
.  }
 13.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 14. 
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.bmicat) smoking(i.smoke)
 15. if _rc==0{
 16. estimates
 17. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth_bmi_smok, replace
 18. *estat concordance /*c-statistic*/
.  }
 19.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 20.  
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.bmicat) smoking(i.smoke)
 21. if _rc==0{
 22. estimates
 23. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCnoeth_bmi_smok, replace
 24. *estat concordance /*c-statistic*/
.  }
 25.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 26.  
. }
   1:     80.11 /        1 =      80.1130

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,495,780             Number of obs    =     771,196
No. of failures      =      408,580
Time at risk         =   1676018127
                                                Wald chi2(17)    =    27664.46
Log pseudolikelihood =   -5332953.7             Prob > chi2      =      0.0000

                            (Std. Err. adjusted for 721,558 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   1.048519   .0065125     7.63   0.000     1.035833    1.061362
     Kids under 18  |   1.012917   .0088754     1.46   0.143     .9956695    1.030462
                    |
               age1 |   .9989702   .0015098    -0.68   0.495     .9960155    1.001934
               age2 |   1.039707   .0052602     7.70   0.000     1.029448    1.050068
               age3 |   .9056683   .0165446    -5.42   0.000     .8738152    .9386826
             1.male |   .6525855   .0030803   -90.42   0.000     .6465761    .6586507
                    |
          obese4cat |
 Obese I (30-34.9)  |   1.373499   .0093154    46.79   0.000     1.355362    1.391879
Obese II (35-39.9)  |   1.591028   .0154367    47.86   0.000     1.561058    1.621573
   Obese III (40+)  |   1.810633   .0226506    47.46   0.000     1.766778    1.855576
                    |
       smoke_nomiss |
            Former  |   1.273543   .0072161    42.67   0.000     1.259478    1.287765
           Current  |   1.259586   .0080047    36.32   0.000     1.243995    1.275374
                    |
                imd |
                 2  |   1.079702   .0085299     9.71   0.000     1.063112     1.09655
                 3  |   1.199758   .0094623    23.09   0.000     1.181354    1.218448
                 4  |   1.279797   .0101216    31.19   0.000     1.260112     1.29979
   5 most deprived  |   1.333359   .0112119    34.21   0.000     1.311564    1.355515
                    |
      tot_adults_hh |
                 2  |   .9218836   .0058206   -12.88   0.000     .9105456    .9333627
                 3  |   .8720514   .0056741   -21.04   0.000      .861001    .8832436
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOGADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOGADJ_noeth.ster saved
   1:     63.41 /        1 =      63.4060

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,530,050             Number of obs    =     602,300
No. of failures      =      326,184
Time at risk         =   1277410220
                                                Wald chi2(21)    =    20506.77
Log pseudolikelihood =     -4172927             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 569,191 clusters in household_id)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              kids_cat3 |
         Kids under 12  |   1.027898    .007156     3.95   0.000     1.013967    1.042019
         Kids under 18  |   1.006315   .0100913     0.63   0.530     .9867299    1.026289
                        |
                   age1 |   .9972531    .001773    -1.55   0.122     .9937842    1.000734
                   age2 |   1.048597   .0061618     8.08   0.000      1.03659    1.060744
                   age3 |   .8762015   .0184015    -6.29   0.000     .8408674    .9130203
                 1.male |   .6635516   .0035597   -76.45   0.000     .6566112    .6705652
                        |
              obese4cat |
     Obese I (30-34.9)  |   1.340741   .0100996    38.93   0.000     1.321091    1.360683
    Obese II (35-39.9)  |   1.561561   .0168958    41.19   0.000     1.528794    1.595029
       Obese III (40+)  |   1.812126   .0254655    42.30   0.000     1.762896    1.862732
                        |
           smoke_nomiss |
                Former  |   1.256575   .0080566    35.62   0.000     1.240883    1.272465
               Current  |    1.26132   .0091737    31.92   0.000     1.243467    1.279429
                        |
              ethnicity |
                 Mixed  |   1.038386   .0216069     1.81   0.070      .996889     1.08161
Asian or Asian British  |   1.186837   .0121868    16.68   0.000      1.16319    1.210964
                 Black  |   1.180177   .0179369    10.90   0.000      1.14554    1.215862
                 Other  |   .7643697   .0129944   -15.81   0.000     .7393208    .7902672
                        |
                    imd |
                     2  |   1.074215   .0096615     7.96   0.000     1.055445    1.093319
                     3  |   1.187705   .0106444    19.19   0.000     1.167024    1.208751
                     4  |   1.260994   .0113283    25.81   0.000     1.238986    1.283394
       5 most deprived  |   1.316866   .0126105    28.74   0.000     1.292381    1.341816
                        |
          tot_adults_hh |
                     2  |    .916209   .0064716   -12.39   0.000     .9036123    .9289814
                     3  |   .8661229   .0063916   -19.48   0.000     .8536857    .8787412
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOGADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOGADJ_CCeth.ster saved
   1:     55.81 /        1 =      55.8110

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    7,795,915             Number of obs    =     518,232
No. of failures      =      293,149
Time at risk         =   1043447502
                                                Wald chi2(23)    =    13644.35
Log pseudolikelihood =   -3697221.5             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 493,718 clusters in household_id)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              kids_cat3 |
         Kids under 12  |   1.014725   .0076679     1.93   0.053     .9998074    1.029866
         Kids under 18  |   1.012252   .0109813     1.12   0.262     .9909562    1.034005
                        |
                   age1 |   .9866166      .0021    -6.33   0.000     .9825093    .9907411
                   age2 |   1.074165   .0073357    10.48   0.000     1.059883    1.088639
                   age3 |   .8217086   .0194474    -8.30   0.000     .7844629    .8607227
                 1.male |   .6936702    .004085   -62.11   0.000     .6857098     .701723
                        |
                 bmicat |
    Normal (18.5-24.9)  |   .8929681    .017363    -5.82   0.000     .8595775    .9276558
  Overweight (25-29.9)  |   1.006198   .0198099     0.31   0.754     .9681105    1.045783
     Obese I (30-34.9)  |   1.201466   .0243102     9.07   0.000     1.154751    1.250071
    Obese II (35-39.9)  |   1.403777   .0303932    15.67   0.000     1.345454    1.464629
       Obese III (40+)  |   1.633093   .0382148    20.96   0.000     1.559885    1.709737
                        |
                  smoke |
                Former  |   1.216491   .0082305    28.96   0.000     1.200466    1.232729
               Current  |   1.249693   .0098278    28.34   0.000     1.230578    1.269104
                        |
              ethnicity |
                 Mixed  |   1.054478   .0240288     2.33   0.020     1.008419    1.102641
Asian or Asian British  |    1.19842   .0133321    16.27   0.000     1.172573    1.224838
                 Black  |   1.193239   .0196825    10.71   0.000     1.155279    1.232446
                 Other  |   .8117325   .0151937   -11.14   0.000      .782493    .8420646
                        |
                    imd |
                     2  |   1.085054   .0103646     8.55   0.000     1.064928    1.105559
                     3  |   1.198774    .011421    19.03   0.000     1.176597    1.221369
                     4  |   1.276419   .0122138    25.51   0.000     1.252704    1.300584
       5 most deprived  |   1.344839   .0137759    28.92   0.000     1.318108    1.372113
                        |
          tot_adults_hh |
                     2  |    .913002   .0068411   -12.15   0.000     .8996917    .9265092
                     3  |   .8795352   .0069527   -16.24   0.000     .8660132    .8932683
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOGADJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:     57.34 /        1 =      57.3380

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,394,254             Number of obs    =     624,937
No. of failures      =      353,721
Time at risk         =   1257351487
                                                Wald chi2(19)    =    15062.85
Log pseudolikelihood =   -4526050.6             Prob > chi2      =      0.0000

                              (Std. Err. adjusted for 591,793 clusters in household_id)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
            kids_cat3 |
       Kids under 12  |   1.023489   .0070609     3.37   0.001     1.009743    1.037422
       Kids under 18  |   1.016524   .0099165     1.68   0.093     .9972729    1.036147
                      |
                 age1 |    .988591   .0018543    -6.12   0.000     .9849634     .992232
                 age2 |   1.065997   .0064692    10.53   0.000     1.053393    1.078752
                 age3 |   .8419005   .0178116    -8.13   0.000     .8077042    .8775446
               1.male |   .7017732   .0037536   -66.21   0.000     .6944546    .7091689
                      |
               bmicat |
  Normal (18.5-24.9)  |    .889213   .0155372    -6.72   0.000     .8592762    .9201927
Overweight (25-29.9)  |   .9975374   .0176498    -0.14   0.889     .9635374    1.032737
   Obese I (30-34.9)  |   1.176308   .0213783     8.93   0.000     1.135145    1.218964
  Obese II (35-39.9)  |   1.370501    .026618    16.23   0.000     1.319311    1.423677
     Obese III (40+)  |   1.565785   .0327778    21.42   0.000     1.502842    1.631365
                      |
                smoke |
              Former  |     1.2046   .0073331    30.58   0.000     1.190313    1.219059
             Current  |   1.225074   .0086367    28.79   0.000     1.208263    1.242119
                      |
                  imd |
                   2  |   1.093637   .0094263    10.38   0.000     1.075317    1.112269
                   3  |   1.213297     .01044    22.47   0.000     1.193007    1.233933
                   4  |   1.301697    .011247    30.52   0.000     1.279839    1.323929
     5 most deprived  |   1.373705   .0126781    34.40   0.000      1.34908     1.39878
                      |
        tot_adults_hh |
                   2  |    .915393   .0062575   -12.93   0.000     .9032103    .9277399
                   3  |   .8947553   .0063836   -15.59   0.000     .8823306    .9073548
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok.ster saved
   1:     65.98 /        1 =      65.9770

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,495,780             Number of obs    =     771,196
No. of failures      =      408,580
Time at risk         =   1676018127
                                                Wald chi2(19)    =    27672.59
Log pseudolikelihood =     -5332946             Prob > chi2      =      0.0000

                            (Std. Err. adjusted for 721,558 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
     gp_number_kids |
    only >12 years  |   1.012888   .0088751     1.46   0.144     .9956415    1.030433
       1 child <12  |   1.038905   .0077429     5.12   0.000      1.02384    1.054192
    2 children <12  |   1.056724   .0095291     6.12   0.000     1.038211    1.075566
   3+ children <12  |   1.075662   .0156314     5.02   0.000     1.045457     1.10674
                    |
               age1 |   .9986609   .0015141    -0.88   0.377     .9956977    1.001633
               age2 |   1.040871   .0052849     7.89   0.000     1.030565    1.051281
               age3 |   .9021285   .0165338    -5.62   0.000      .870298    .9351232
             1.male |   .6525904   .0030803   -90.42   0.000     .6465809    .6586558
                    |
          obese4cat |
 Obese I (30-34.9)  |   1.373265   .0093144    46.76   0.000      1.35513    1.391643
Obese II (35-39.9)  |   1.590846    .015435    47.85   0.000      1.56088    1.621388
   Obese III (40+)  |   1.810765   .0226529    47.46   0.000     1.766906    1.855713
                    |
       smoke_nomiss |
            Former  |   1.273637    .007217    42.69   0.000     1.259571    1.287861
           Current  |   1.259659   .0080067    36.32   0.000     1.244064     1.27545
                    |
                imd |
                 2  |   1.079761   .0085309     9.71   0.000     1.063169    1.096611
                 3  |   1.199795   .0094636    23.09   0.000     1.181389    1.218488
                 4  |   1.279732   .0101227    31.18   0.000     1.260045    1.299727
   5 most deprived  |   1.332829   .0112149    34.14   0.000     1.311029    1.354992
                    |
      tot_adults_hh |
                 2  |   .9213721   .0058226   -12.96   0.000     .9100305    .9328551
                 3  |   .8718379   .0056739   -21.07   0.000     .8607878    .8830298
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_noeth.ster saved
   1:     65.48 /        1 =      65.4810

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,530,050             Number of obs    =     602,300
No. of failures      =      326,184
Time at risk         =   1277410220
                                                Wald chi2(23)    =    20510.69
Log pseudolikelihood =   -4172923.6             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 569,191 clusters in household_id)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |    1.00633   .0100914     0.63   0.529     .9867448    1.026305
           1 child <12  |   1.020989    .008489     2.50   0.012     1.004486    1.037763
        2 children <12  |   1.033452   .0103143     3.30   0.001     1.013433    1.053866
       3+ children <12  |    1.04776   .0166537     2.94   0.003     1.015622    1.080914
                        |
                   age1 |   .9970216   .0017781    -1.67   0.094     .9935427    1.000513
                   age2 |    1.04948   .0061889     8.19   0.000      1.03742     1.06168
                   age3 |   .8736149   .0184079    -6.41   0.000     .8382709    .9104491
                 1.male |   .6635488   .0035597   -76.45   0.000     .6566084    .6705625
                        |
              obese4cat |
     Obese I (30-34.9)  |    1.34056    .010099    38.91   0.000     1.320912      1.3605
    Obese II (35-39.9)  |    1.56141   .0168943    41.18   0.000     1.528646    1.594876
       Obese III (40+)  |    1.81223    .025467    42.31   0.000     1.762997    1.862838
                        |
           smoke_nomiss |
                Former  |    1.25659   .0080569    35.62   0.000     1.240898    1.272481
               Current  |   1.261303   .0091755    31.91   0.000     1.243447    1.279416
                        |
              ethnicity |
                 Mixed  |   1.038174    .021605     1.80   0.072     .9966807    1.081394
Asian or Asian British  |   1.186212   .0121889    16.62   0.000     1.162561    1.210344
                 Black  |   1.179601    .017931    10.87   0.000     1.144975    1.215274
                 Other  |   .7642459   .0129931   -15.81   0.000     .7391995    .7901409
                        |
                    imd |
                     2  |   1.074273   .0096624     7.97   0.000     1.055501    1.093379
                     3  |   1.187757   .0106459    19.20   0.000     1.167074    1.208807
                     4  |   1.261005   .0113301    25.81   0.000     1.238993    1.283408
       5 most deprived  |   1.316529   .0126145    28.70   0.000     1.292036    1.341487
                        |
          tot_adults_hh |
                     2  |   .9158166   .0064749   -12.44   0.000     .9032136    .9285954
                     3  |   .8659685   .0063915   -19.50   0.000     .8535315    .8785867
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_CCeth.ster saved
   1:     57.75 /        1 =      57.7530

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    7,795,915             Number of obs    =     518,232
No. of failures      =      293,149
Time at risk         =   1043447502
                                                Wald chi2(25)    =    13645.56
Log pseudolikelihood =   -3697220.5             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 493,718 clusters in household_id)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |    1.01227   .0109815     1.12   0.261     .9909743    1.034024
           1 child <12  |   1.011268   .0090724     1.25   0.212     .9936416    1.029207
        2 children <12  |   1.016842   .0109138     1.56   0.120     .9956748    1.038459
       3+ children <12  |   1.026727    .017504     1.55   0.122     .9929868    1.061614
                        |
                   age1 |   .9864965   .0021053    -6.37   0.000     .9823787    .9906315
                   age2 |   1.074646   .0073626    10.51   0.000     1.060312    1.089173
                   age3 |   .8204066   .0194783    -8.34   0.000     .7831044    .8594856
                 1.male |   .6936742    .004085   -62.11   0.000     .6857137    .7017272
                        |
                 bmicat |
    Normal (18.5-24.9)  |   .8929194   .0173625    -5.82   0.000     .8595297    .9276061
  Overweight (25-29.9)  |   1.006096   .0198086     0.31   0.758     .9680114    1.045679
     Obese I (30-34.9)  |   1.201287   .0243079     9.06   0.000     1.154577    1.249887
    Obese II (35-39.9)  |   1.403596   .0303904    15.66   0.000     1.345278    1.464442
       Obese III (40+)  |   1.633023   .0382135    20.96   0.000     1.559817    1.709664
                        |
                  smoke |
                Former  |   1.216488   .0082308    28.96   0.000     1.200463    1.232728
               Current  |   1.249656   .0098299    28.33   0.000     1.230537    1.269072
                        |
              ethnicity |
                 Mixed  |    1.05431   .0240273     2.32   0.020     1.008254     1.10247
Asian or Asian British  |   1.198022   .0133379    16.23   0.000     1.172164    1.224452
                 Black  |   1.192905   .0196798    10.69   0.000      1.15495    1.232107
                 Other  |   .8116385   .0151928   -11.15   0.000     .7824008    .8419689
                        |
                    imd |
                     2  |    1.08508   .0103654     8.55   0.000     1.064953    1.105587
                     3  |   1.198783    .011422    19.03   0.000     1.176604    1.221381
                     4  |   1.276394   .0122154    25.50   0.000     1.252675    1.300561
       5 most deprived  |   1.344589   .0137816    28.89   0.000     1.317847    1.371874
                        |
          tot_adults_hh |
                     2  |   .9128025   .0068457   -12.17   0.000     .8994833    .9263189
                     3  |   .8794429    .006953   -16.25   0.000     .8659203    .8931768
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:     55.83 /        1 =      55.8320

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,394,254             Number of obs    =     624,937
No. of failures      =      353,721
Time at risk         =   1257351487
                                                Wald chi2(21)    =    15066.11
Log pseudolikelihood =   -4526047.1             Prob > chi2      =      0.0000

                              (Std. Err. adjusted for 591,793 clusters in household_id)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
       gp_number_kids |
      only >12 years  |   1.016526   .0099166     1.68   0.093     .9972748    1.036149
         1 child <12  |   1.017188   .0083551     2.07   0.038     1.000943    1.033696
      2 children <12  |   1.027888   .0101558     2.78   0.005     1.008174    1.047987
     3+ children <12  |   1.044186   .0165027     2.74   0.006     1.012337    1.077037
                      |
                 age1 |    .988373   .0018593    -6.22   0.000     .9847355    .9920239
                 age2 |   1.066854   .0064971    10.63   0.000     1.054195    1.079664
                 age3 |   .8395281   .0178221    -8.24   0.000     .8053142    .8751956
               1.male |   .7017747   .0037537   -66.21   0.000      .694456    .7091706
                      |
               bmicat |
  Normal (18.5-24.9)  |   .8891391   .0155365    -6.72   0.000     .8592037    .9201174
Overweight (25-29.9)  |   .9973778   .0176477    -0.15   0.882     .9633817    1.032573
   Obese I (30-34.9)  |   1.176041   .0213746     8.92   0.000     1.134885    1.218689
  Obese II (35-39.9)  |   1.370246   .0266141    16.22   0.000     1.319064    1.423415
     Obese III (40+)  |   1.565689   .0327763    21.42   0.000     1.502749    1.631266
                      |
                smoke |
              Former  |   1.204673    .007334    30.59   0.000     1.190383    1.219133
             Current  |   1.225106   .0086388    28.79   0.000     1.208291    1.242156
                      |
                  imd |
                   2  |   1.093676   .0094271    10.39   0.000     1.075355     1.11231
                   3  |   1.213291   .0104409    22.47   0.000     1.192999    1.233928
                   4  |   1.301611   .0112482    30.50   0.000      1.27975    1.323845
     5 most deprived  |   1.373208   .0126828    34.34   0.000     1.348574    1.398292
                      |
        tot_adults_hh |
                   2  |    .915048   .0062608   -12.98   0.000     .9028591    .9274015
                   3  |   .8945793   .0063838   -15.61   0.000     .8821544    .9071793
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster saved

. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
(0 observations deleted)

. foreach exposure_type in kids_cat3   {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_12mo, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. }               
   1:     60.02 /        1 =      60.0240

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,495,780             Number of obs    =     771,196
No. of failures      =      408,580
Time at risk         =   1676018127
                                                Wald chi2(17)    =    27664.46
Log pseudolikelihood =   -5332953.7             Prob > chi2      =      0.0000

                            (Std. Err. adjusted for 721,558 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   1.048519   .0065125     7.63   0.000     1.035833    1.061362
     Kids under 18  |   1.012917   .0088754     1.46   0.143     .9956695    1.030462
                    |
               age1 |   .9989702   .0015098    -0.68   0.495     .9960155    1.001934
               age2 |   1.039707   .0052602     7.70   0.000     1.029448    1.050068
               age3 |   .9056683   .0165446    -5.42   0.000     .8738152    .9386826
             1.male |   .6525855   .0030803   -90.42   0.000     .6465761    .6586507
                    |
          obese4cat |
 Obese I (30-34.9)  |   1.373499   .0093154    46.79   0.000     1.355362    1.391879
Obese II (35-39.9)  |   1.591028   .0154367    47.86   0.000     1.561058    1.621573
   Obese III (40+)  |   1.810633   .0226506    47.46   0.000     1.766778    1.855576
                    |
       smoke_nomiss |
            Former  |   1.273543   .0072161    42.67   0.000     1.259478    1.287765
           Current  |   1.259586   .0080047    36.32   0.000     1.243995    1.275374
                    |
                imd |
                 2  |   1.079702   .0085299     9.71   0.000     1.063112     1.09655
                 3  |   1.199758   .0094623    23.09   0.000     1.181354    1.218448
                 4  |   1.279797   .0101216    31.19   0.000     1.260112     1.29979
   5 most deprived  |   1.333359   .0112119    34.21   0.000     1.311564    1.355515
                    |
      tot_adults_hh |
                 2  |   .9218836   .0058206   -12.88   0.000     .9105456    .9333627
                 3  |   .8720514   .0056741   -21.04   0.000      .861001    .8832436
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOGADJ_noeth_12mo.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOGADJ_noeth_12mo.ster saved

. 
. stcox kids_cat3 age1 age2 age3  i.male  ///
>                         i.obese4cat                                     ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  covid_tpp_prob_or_susp
   analysis time _t:  (stime_covid_tpp_prob_or_susp-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 12,495,779.53891)
Iteration 0:   log pseudolikelihood = -5365799.4
Iteration 1:   log pseudolikelihood = -5339818.2
Iteration 2:   log pseudolikelihood = -5338925.3
Iteration 3:   log pseudolikelihood = -5338920.8
Iteration 4:   log pseudolikelihood = -5338920.8
Refining estimates:
Iteration 0:   log pseudolikelihood = -5338920.8

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,495,780             Number of obs    =     771,196
No. of failures      =      408,580
Time at risk         =   1676018127
                                                Wald chi2(8)     =    23673.46
Log pseudolikelihood =   -5338920.8             Prob > chi2      =      0.0000

                            (Std. Err. adjusted for 721,558 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |   1.004756   .0038268     1.25   0.213     .9972838    1.012285
               age1 |   1.015244   .0014369    10.69   0.000     1.012431    1.018064
               age2 |   .9897701   .0047067    -2.16   0.031      .980588    .9990381
               age3 |   1.051681   .0183065     2.89   0.004     1.016407    1.088181
             1.male |   .6567759   .0030547   -90.39   0.000     .6508161    .6627903
                    |
          obese4cat |
 Obese I (30-34.9)  |   1.409399   .0094718    51.06   0.000     1.390957    1.428087
Obese II (35-39.9)  |   1.656593   .0159048    52.57   0.000     1.625712    1.688061
   Obese III (40+)  |   1.904441   .0235549    52.08   0.000      1.85883    1.951172
-------------------------------------------------------------------------------------
                                                             Stratified by stp

.         
. 
. stcox kids_cat3 age1 age2 age3  i.male  ///
>                         i.smoke_nomiss                  ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  covid_tpp_prob_or_susp
   analysis time _t:  (stime_covid_tpp_prob_or_susp-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 12,495,779.53891)
Iteration 0:   log pseudolikelihood = -5365799.4
Iteration 1:   log pseudolikelihood = -5343326.7
Iteration 2:   log pseudolikelihood = -5343235.1
Iteration 3:   log pseudolikelihood = -5343235.1
Refining estimates:
Iteration 0:   log pseudolikelihood = -5343235.1

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,495,780             Number of obs    =     771,196
No. of failures      =      408,580
Time at risk         =   1676018127
                                                Wald chi2(7)     =    20713.20
Log pseudolikelihood =   -5343235.1             Prob > chi2      =      0.0000

                     (Std. Err. adjusted for 721,558 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |   1.007257   .0038148     1.91   0.056      .999808    1.014762
        age1 |   1.008469   .0014347     5.93   0.000     1.005661    1.011285
        age2 |   1.013583   .0048231     2.84   0.005     1.004174     1.02308
        age3 |   .9751225   .0169272    -1.45   0.147     .9425038     1.00887
      1.male |   .6274285   .0029029  -100.75   0.000     .6217647    .6331438
             |
smoke_nomiss |
     Former  |   1.327833   .0073927    50.93   0.000     1.313423    1.342402
    Current  |   1.326777    .008215    45.67   0.000     1.310773    1.342976
------------------------------------------------------------------------------
                                                             Stratified by stp

.                         
.                         
. stcox kids_cat3 age1 age2 age3  i.male  ///
>                         i.imd                                                   ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  covid_tpp_prob_or_susp
   analysis time _t:  (stime_covid_tpp_prob_or_susp-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 12,495,779.53891)
Iteration 0:   log pseudolikelihood = -5365799.4
Iteration 1:   log pseudolikelihood =   -5343835
Iteration 2:   log pseudolikelihood = -5343745.1
Iteration 3:   log pseudolikelihood = -5343745.1
Refining estimates:
Iteration 0:   log pseudolikelihood = -5343745.1

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,495,780             Number of obs    =     771,196
No. of failures      =      408,580
Time at risk         =   1676018127
                                                Wald chi2(9)     =    20106.84
Log pseudolikelihood =   -5343745.1             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 721,558 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |   1.005387   .0038037     1.42   0.156     .9979599     1.01287
            age1 |   1.017842    .001431    12.58   0.000     1.015041    1.020651
            age2 |   .9942077   .0046981    -1.23   0.219      .985042    1.003459
            age3 |   1.023873   .0177043     1.36   0.172     .9897547    1.059168
          1.male |   .6321972   .0029108   -99.59   0.000     .6265178    .6379282
                 |
             imd |
              2  |   1.106888   .0086471    13.00   0.000     1.090069    1.123966
              3  |   1.252993   .0097476    28.99   0.000     1.234033    1.272244
              4  |     1.3663   .0106002    40.23   0.000     1.345681    1.387235
5 most deprived  |   1.456251   .0119051    45.98   0.000     1.433103    1.479772
----------------------------------------------------------------------------------
                                                             Stratified by stp

. 
. stcox kids_cat3 age1 age2 age3  i.male  ///
>                         i.tot_adults_hh                         ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  covid_tpp_prob_or_susp
   analysis time _t:  (stime_covid_tpp_prob_or_susp-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 12,495,779.53891)
Iteration 0:   log pseudolikelihood = -5365799.4
Iteration 1:   log pseudolikelihood = -5346495.2
Iteration 2:   log pseudolikelihood = -5346407.3
Iteration 3:   log pseudolikelihood = -5346407.3
Refining estimates:
Iteration 0:   log pseudolikelihood = -5346407.3

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,495,780             Number of obs    =     771,196
No. of failures      =      408,580
Time at risk         =   1676018127
                                                Wald chi2(7)     =    18166.31
Log pseudolikelihood =   -5346407.3             Prob > chi2      =      0.0000

                      (Std. Err. adjusted for 721,558 clusters in household_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
    kids_cat3 |   1.018594   .0039005     4.81   0.000     1.010977    1.026267
         age1 |   1.014581   .0014449    10.16   0.000     1.011753    1.017417
         age2 |    1.00112   .0047754     0.23   0.815     .9918037    1.010523
         age3 |   1.004092   .0174742     0.23   0.814     .9704207    1.038932
       1.male |   .6378514   .0029301   -97.88   0.000     .6321343    .6436202
              |
tot_adults_hh |
           2  |   .8946828   .0055014   -18.10   0.000      .883965    .9055305
           3  |   .8533175   .0054507   -24.83   0.000      .842701    .8640678
-------------------------------------------------------------------------------
                                                             Stratified by stp

.                         
.                         
.         
. log close
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_covid_tpp_prob_or_susp.log
  log type:  text
 closed on:  24 Jul 2020, 13:55:50
----------------------------------------------------------------------------------------------------------------------------------
