----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_covid_death.log
  log type:  text
 opened on:  24 Jul 2020, 13:43:20

. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                                        ///
>                         i.male                                                  ///
>                         `bmi'                                   ///
>                         `smoking'                                       ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         i.tot_adults_hh                         ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. foreach exposure_type in kids_cat3  ///
>                 gp_number_kids {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  9. if _rc==0{
 10. estimates
 11. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth, replace
 12. *estat concordance /*c-statistic*/
.  }
 13.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 14. 
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.bmicat) smoking(i.smoke)
 15. if _rc==0{
 16. estimates
 17. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth_bmi_smok, replace
 18. *estat concordance /*c-statistic*/
.  }
 19.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 20.  
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.bmicat) smoking(i.smoke)
 21. if _rc==0{
 22. estimates
 23. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCnoeth_bmi_smok, replace
 24. *estat concordance /*c-statistic*/
.  }
 25.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 26.  
. }
   1:     61.82 /        1 =      61.8190

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,080             Number of obs    =     376,101
No. of failures      =        1,380
Time at risk         =   1698315732
                                                Wald chi2(17)    =     1969.30
Log pseudolikelihood =   -16795.344             Prob > chi2      =      0.0000

                            (Std. Err. adjusted for 368,774 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   .8376146   .0820819    -1.81   0.071     .6912432     1.01498
     Kids under 18  |    .941269   .1023145    -0.56   0.578     .7606579    1.164764
                    |
               age1 |   1.161561   .0563852     3.09   0.002     1.056142    1.277502
               age2 |   .9559393   .1240811    -0.35   0.728      .741215    1.232868
               age3 |   .9797723   .3624159    -0.06   0.956      .474534     2.02294
             1.male |   2.058621   .1192722    12.46   0.000     1.837636     2.30618
                    |
          obese4cat |
 Obese I (30-34.9)  |   1.515769   .1065482     5.92   0.000     1.320685    1.739669
Obese II (35-39.9)  |    2.73774   .2238081    12.32   0.000     2.332422    3.213492
   Obese III (40+)  |   3.610677   .3538745    13.10   0.000     2.979643    4.375352
                    |
       smoke_nomiss |
            Former  |    1.16841   .0694058     2.62   0.009     1.039998    1.312679
           Current  |     .80299   .0658033    -2.68   0.007     .6838424    .9428971
                    |
                imd |
                 2  |   1.214915   .1271057     1.86   0.063     .9896744    1.491419
                 3  |   1.489729   .1512336     3.93   0.000     1.220943    1.817687
                 4  |   2.284529   .2181601     8.65   0.000     1.894574    2.754748
   5 most deprived  |   2.599416   .2594131     9.57   0.000     2.137611    3.160988
                    |
      tot_adults_hh |
                 2  |   .7749858   .0567438    -3.48   0.000     .6713817    .8945776
                 3  |   1.068243   .0741232     0.95   0.341     .9324101    1.223864
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat3_DEMOGADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat3_DEMOGADJ_noeth.ster saved
   1:     39.33 /        1 =      39.3290

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,529,274             Number of obs    =     286,953
No. of failures      =        1,108
Time at risk         =   1295524605
                                                Wald chi2(21)    =     1744.95
Log pseudolikelihood =    -13152.36             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 282,420 clusters in household_id)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              kids_cat3 |
         Kids under 12  |   .7113599   .0761522    -3.18   0.001     .5767226    .8774287
         Kids under 18  |   .7790826   .0977963    -1.99   0.047     .6091642    .9963976
                        |
                   age1 |    1.13138   .0639698     2.18   0.029     1.012699     1.26397
                   age2 |   1.035576   .1553771     0.23   0.816     .7717353    1.389619
                   age3 |   .7820104   .3323095    -0.58   0.563     .3400171    1.798557
                 1.male |   2.098483   .1368464    11.37   0.000     1.846702    2.384592
                        |
              obese4cat |
     Obese I (30-34.9)  |   1.439651   .1133312     4.63   0.000     1.233814    1.679829
    Obese II (35-39.9)  |   2.760872   .2524386    11.11   0.000     2.307901    3.302748
       Obese III (40+)  |   3.901572   .4260386    12.47   0.000      3.14986     4.83268
                        |
           smoke_nomiss |
                Former  |   1.277008   .0856675     3.64   0.000     1.119672    1.456451
               Current  |   .8419546   .0790152    -1.83   0.067     .7004961    1.011979
                        |
              ethnicity |
                 Mixed  |   2.518681   .5080627     4.58   0.000     1.696175    3.740035
Asian or Asian British  |   2.780634   .2639265    10.77   0.000     2.308614    3.349164
                 Black  |   2.885014   .3447042     8.87   0.000     2.282683    3.646283
                 Other  |   2.169975    .371465     4.53   0.000     1.551467    3.035057
                        |
                    imd |
                     2  |    1.27368   .1562122     1.97   0.049     1.001529    1.619783
                     3  |   1.548819   .1819248     3.72   0.000      1.23032    1.949769
                     4  |   2.214454   .2463506     7.15   0.000     1.780629    2.753975
       5 most deprived  |    2.26541   .2670384     6.94   0.000     1.798085    2.854193
                        |
          tot_adults_hh |
                     2  |   .7857137   .0640121    -2.96   0.003     .6697564    .9217471
                     3  |   .9567972    .075423    -0.56   0.575     .8198244    1.116655
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat3_DEMOGADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat3_DEMOGADJ_CCeth.ster saved
   1:     34.00 /        1 =      33.9960

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    7,796,091             Number of obs    =     234,844
No. of failures      =          991
Time at risk         =   1059850057
                                                Wald chi2(23)    =     1678.50
Log pseudolikelihood =   -11563.495             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 232,022 clusters in household_id)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              kids_cat3 |
         Kids under 12  |    .710078   .0821445    -2.96   0.003     .5660253     .890792
         Kids under 18  |   .7567609   .1035077    -2.04   0.042     .5788068    .9894268
                        |
                   age1 |   1.104903   .0723411     1.52   0.128     .9718377    1.256188
                   age2 |   1.096352   .1894384     0.53   0.594      .781396    1.538257
                   age3 |    .693795    .337036    -0.75   0.452     .2677499    1.797766
                 1.male |   2.363415   .1660161    12.24   0.000     2.059435    2.712264
                        |
                 bmicat |
    Normal (18.5-24.9)  |    .298841   .0710913    -5.08   0.000      .187477    .4763569
  Overweight (25-29.9)  |   .3361215   .0787992    -4.65   0.000     .2122968    .5321685
     Obese I (30-34.9)  |   .5101291   .1203585    -2.85   0.004     .3212549    .8100473
    Obese II (35-39.9)  |   .9936565   .2386364    -0.03   0.979     .6206001    1.590965
       Obese III (40+)  |   1.409845   .3476454     1.39   0.164      .869518    2.285937
                        |
                  smoke |
                Former  |    1.28195   .0912667     3.49   0.000      1.11499    1.473911
               Current  |   .8585597   .0848087    -1.54   0.123     .7074384    1.041963
                        |
              ethnicity |
                 Mixed  |   2.388536   .5248945     3.96   0.000     1.552656    3.674415
Asian or Asian British  |   2.924122   .2938632    10.68   0.000     2.401336    3.560722
                 Black  |   2.847372     .36614     8.14   0.000      2.21304    3.663525
                 Other  |   2.343551   .4275445     4.67   0.000     1.639026    3.350911
                        |
                    imd |
                     2  |   1.254809   .1620731     1.76   0.079     .9741707    1.616293
                     3  |   1.434337   .1788968     2.89   0.004     1.123274    1.831542
                     4  |   2.166439   .2538243     6.60   0.000      1.72194     2.72568
       5 most deprived  |   2.168794   .2700045     6.22   0.000     1.699213    2.768145
                        |
          tot_adults_hh |
                     2  |   .7461654   .0643266    -3.40   0.001     .6301637    .8835208
                     3  |   .9412939   .0785707    -0.72   0.469     .7992352    1.108602
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:     35.52 /        1 =      35.5150

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,392,901             Number of obs    =     282,952
No. of failures      =        1,201
Time at risk         =   1276905917
                                                Wald chi2(19)    =     1798.84
Log pseudolikelihood =   -14303.679             Prob > chi2      =      0.0000

                              (Std. Err. adjusted for 279,074 clusters in household_id)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
            kids_cat3 |
       Kids under 12  |   .8606368   .0921875    -1.40   0.161     .6976588    1.061688
       Kids under 18  |   .9652981    .113866    -0.30   0.765     .7660449    1.216378
                      |
                 age1 |   1.121489   .0646747     1.99   0.047      1.00163     1.25569
                 age2 |   1.048721   .1604433     0.31   0.756     .7770248    1.415418
                 age3 |   .7702411   .3325112    -0.60   0.545     .3304952    1.795099
               1.male |   2.385734   .1514039    13.70   0.000     2.106701    2.701725
                      |
               bmicat |
  Normal (18.5-24.9)  |   .3041064   .0647514    -5.59   0.000     .2003479    .4616007
Overweight (25-29.9)  |   .3170958   .0668095    -5.45   0.000     .2098212    .4792164
   Obese I (30-34.9)  |   .4965765   .1051201    -3.31   0.001     .3279409    .7519287
  Obese II (35-39.9)  |   .9083921   .1956068    -0.45   0.655     .5956369    1.385368
     Obese III (40+)  |   1.203552   .2665521     0.84   0.403     .7797372    1.857725
                      |
                smoke |
              Former  |   1.150274   .0732467     2.20   0.028     1.015311    1.303178
             Current  |   .7747159   .0684991    -2.89   0.004     .6514494    .9213067
                      |
                  imd |
                   2  |   1.242585   .1393441     1.94   0.053     .9974061    1.548034
                   3  |    1.43233   .1575426     3.27   0.001     1.154567    1.776917
                   4  |   2.282953   .2353199     8.01   0.000     1.865338    2.794063
     5 most deprived  |   2.576475   .2767226     8.81   0.000     2.087391    3.180153
                      |
        tot_adults_hh |
                   2  |   .7465293   .0585358    -3.73   0.000     .6401823    .8705428
                   3  |   1.059928   .0790476     0.78   0.435     .9157887    1.226754
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok.ster saved
   1:     45.06 /        1 =      45.0620

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,080             Number of obs    =     376,101
No. of failures      =        1,380
Time at risk         =   1698315732
                                                Wald chi2(19)    =     1974.77
Log pseudolikelihood =   -16795.233             Prob > chi2      =      0.0000

                            (Std. Err. adjusted for 368,774 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
     gp_number_kids |
    only >12 years  |   .9411079   .1023069    -0.56   0.577     .7605122    1.164589
       1 child <12  |   .8525945    .098037    -1.39   0.165     .6805589    1.068118
    2 children <12  |   .8361155   .1360979    -1.10   0.272      .607733    1.150323
   3+ children <12  |   .7431117   .2133724    -1.03   0.301     .4232973    1.304556
                    |
               age1 |   1.161886   .0564463     3.09   0.002     1.056357    1.277957
               age2 |   .9547635     .12419    -0.36   0.722      .739906    1.232012
               age3 |   .9841089   .3650446    -0.04   0.966     .4756627    2.036044
             1.male |   2.058883   .1192751    12.47   0.000     1.837891    2.306446
                    |
          obese4cat |
 Obese I (30-34.9)  |   1.515935   .1066097     5.92   0.000     1.320745    1.739972
Obese II (35-39.9)  |   2.737473   .2237971    12.32   0.000     2.332176    3.213203
   Obese III (40+)  |    3.61066   .3539953    13.10   0.000      2.97943    4.375622
                    |
       smoke_nomiss |
            Former  |   1.168212   .0693904     2.62   0.009     1.039828    1.312448
           Current  |   .8028725   .0657888    -2.68   0.007     .6837505    .9427478
                    |
                imd |
                 2  |   1.215049   .1271197     1.86   0.063     .9897834    1.491583
                 3  |   1.490064   .1512953     3.93   0.000     1.221174    1.818163
                 4  |     2.2848   .2181936     8.65   0.000     1.894786    2.755092
   5 most deprived  |    2.60141   .2595842     9.58   0.000     2.139296    3.163347
                    |
      tot_adults_hh |
                 2  |   .7751971   .0567668    -3.48   0.001     .6715519    .8948385
                 3  |   1.068669   .0741383     0.96   0.338     .9328065    1.224319
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_DEMOGADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_DEMOGADJ_noeth.ster saved
   1:     40.74 /        1 =      40.7430

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,529,274             Number of obs    =     286,953
No. of failures      =        1,108
Time at risk         =   1295524605
                                                Wald chi2(23)    =     1745.88
Log pseudolikelihood =    -13151.11             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 282,420 clusters in household_id)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |   .7779368   .0976601    -2.00   0.045     .6082566    .9949514
           1 child <12  |   .7910508   .0968432    -1.91   0.056     .6222964    1.005568
        2 children <12  |   .6016661   .1133396    -2.70   0.007     .4159196    .8703655
       3+ children <12  |   .5641616   .1767769    -1.83   0.068     .3052701    1.042612
                        |
                   age1 |   1.134026   .0639997     2.23   0.026     1.015278    1.266664
                   age2 |   1.026764   .1540572     0.18   0.860     .7651647      1.3778
                   age3 |   .8045509   .3423303    -0.51   0.609     .3494409    1.852394
                 1.male |    2.09934   .1368736    11.37   0.000     1.847506    2.385502
                        |
              obese4cat |
     Obese I (30-34.9)  |   1.439666   .1133935     4.63   0.000     1.233723    1.679985
    Obese II (35-39.9)  |   2.760681   .2524468    11.10   0.000       2.3077    3.302579
       Obese III (40+)  |   3.896415   .4255933    12.45   0.000     3.145511    4.826578
                        |
           smoke_nomiss |
                Former  |    1.27564   .0855541     3.63   0.000     1.118511    1.454843
               Current  |   .8413515   .0789499    -1.84   0.066     .7000084    1.011234
                        |
              ethnicity |
                 Mixed  |   2.530169   .5097107     4.61   0.000     1.704795    3.755146
Asian or Asian British  |   2.791119   .2654119    10.79   0.000     2.316521     3.36295
                 Black  |   2.894326   .3460313     8.89   0.000     2.289718    3.658583
                 Other  |   2.173749    .372051     4.54   0.000     1.554249     3.04017
                        |
                    imd |
                     2  |   1.274191   .1562756     1.98   0.048      1.00193    1.620436
                     3  |   1.549007   .1819551     3.73   0.000     1.230457    1.950026
                     4  |    2.21287   .2462059     7.14   0.000     1.779305    2.752082
       5 most deprived  |   2.267609   .2671447     6.95   0.000     1.800068    2.856586
                        |
          tot_adults_hh |
                     2  |   .7873881   .0641241    -2.94   0.003     .6712245    .9236551
                     3  |   .9577732   .0754541    -0.55   0.584     .8207376    1.117689
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_DEMOGADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_DEMOGADJ_CCeth.ster saved
   1:     35.55 /        1 =      35.5540

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    7,796,091             Number of obs    =     234,844
No. of failures      =          991
Time at risk         =   1059850057
                                                Wald chi2(25)    =     1692.95
Log pseudolikelihood =   -11561.561             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 232,022 clusters in household_id)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |   .7552926   .1033175    -2.05   0.040     .5776678    .9875345
           1 child <12  |   .8165651   .1060487    -1.56   0.119     .6330585    1.053265
        2 children <12  |   .5542872   .1177654    -2.78   0.005      .365499    .8405885
       3+ children <12  |   .5358545   .1862167    -1.80   0.073     .2711707     1.05889
                        |
                   age1 |   1.108266   .0722109     1.58   0.115     .9753998    1.259231
                   age2 |   1.084052   .1868187     0.47   0.640     .7733199     1.51964
                   age3 |   .7204258   .3496417    -0.68   0.499     .2782778     1.86509
                 1.male |   2.364975   .1661287    12.25   0.000     2.060789     2.71406
                        |
                 bmicat |
    Normal (18.5-24.9)  |   .2980188   .0708803    -5.09   0.000       .18698    .4749982
  Overweight (25-29.9)  |   .3353833   .0786229    -4.66   0.000     .2118346    .5309896
     Obese I (30-34.9)  |   .5088698   .1200568    -2.86   0.004     .3204676    .8080332
    Obese II (35-39.9)  |   .9910428   .2379889    -0.04   0.970     .6189919    1.586718
       Obese III (40+)  |   1.403424   .3459768     1.37   0.169      .865661    2.275255
                        |
                  smoke |
                Former  |   1.280098   .0911233     3.47   0.001     1.113398    1.471755
               Current  |   .8573067    .084677    -1.56   0.119     .7064187    1.040424
                        |
              ethnicity |
                 Mixed  |   2.405241   .5275382     4.00   0.000     1.564825    3.697017
Asian or Asian British  |   2.937842   .2955994    10.71   0.000     2.412028    3.578282
                 Black  |   2.857893   .3676594     8.16   0.000     2.220963    3.677481
                 Other  |   2.350441   .4287435     4.69   0.000     1.643924      3.3606
                        |
                    imd |
                     2  |   1.255848   .1622133     1.76   0.078     .9749678    1.617646
                     3  |   1.435205   .1789797     2.90   0.004     1.123993    1.832587
                     4  |   2.164546   .2536304     6.59   0.000     1.720392    2.723368
       5 most deprived  |   2.172921   .2703697     6.24   0.000     1.702675    2.773041
                        |
          tot_adults_hh |
                     2  |   .7480915   .0644518    -3.37   0.001     .6318579    .8857068
                     3  |   .9426081   .0786264    -0.71   0.479      .800441    1.110026
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:     36.36 /        1 =      36.3640

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,392,901             Number of obs    =     282,952
No. of failures      =        1,201
Time at risk         =   1276905917
                                                Wald chi2(21)    =     1820.03
Log pseudolikelihood =   -14303.389             Prob > chi2      =      0.0000

                              (Std. Err. adjusted for 279,074 clusters in household_id)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
       gp_number_kids |
      only >12 years  |   .9648041   .1138211    -0.30   0.761     .7656321    1.215789
         1 child <12  |   .9047446   .1110885    -0.82   0.415     .7112327    1.150907
      2 children <12  |   .7976373   .1480739    -1.22   0.223     .5543548    1.147686
     3+ children <12  |   .7605285   .2389846    -0.87   0.384     .4108074    1.407968
                      |
                 age1 |   1.122564   .0646547     2.01   0.045     1.002734    1.256714
                 age2 |    1.04477   .1599034     0.29   0.775     .7740037    1.410256
                 age3 |   .7802002   .3373467    -0.57   0.566     .3343177     1.82076
               1.male |   2.386444   .1514502    13.71   0.000     2.107326    2.702532
                      |
               bmicat |
  Normal (18.5-24.9)  |   .3039886   .0647226    -5.59   0.000     .2002751    .4614107
Overweight (25-29.9)  |   .3170051   .0667931    -5.45   0.000     .2097576    .4790875
   Obese I (30-34.9)  |   .4963883   .1050798    -3.31   0.001     .3278172    .7516425
  Obese II (35-39.9)  |   .9078677   .1955002    -0.45   0.654     .5952848    1.384587
     Obese III (40+)  |    1.20216   .2661978     0.83   0.406     .7788939    1.855438
                      |
                smoke |
              Former  |   1.149618   .0732178     2.19   0.029     1.014709    1.302464
             Current  |   .7741307   .0684568    -2.90   0.004     .6509417     .920633
                      |
                  imd |
                   2  |    1.24265   .1393517     1.94   0.053     .9974578    1.548115
                   3  |   1.432522   .1575806     3.27   0.001     1.154695    1.777196
                   4  |    2.28231   .2352782     8.00   0.000     1.864774    2.793336
     5 most deprived  |   2.578539   .2770241     8.82   0.000     2.088937    3.182894
                      |
        tot_adults_hh |
                   2  |   .7471091   .0585742    -3.72   0.000     .6406914    .8712027
                   3  |   1.060608   .0790812     0.79   0.430     .9164048    1.227502
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster saved

. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
(0 observations deleted)

. foreach exposure_type in kids_cat3   {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_12mo, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. }               
   1:     45.58 /        1 =      45.5780

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,080             Number of obs    =     376,101
No. of failures      =        1,380
Time at risk         =   1698315732
                                                Wald chi2(17)    =     1969.30
Log pseudolikelihood =   -16795.344             Prob > chi2      =      0.0000

                            (Std. Err. adjusted for 368,774 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   .8376146   .0820819    -1.81   0.071     .6912432     1.01498
     Kids under 18  |    .941269   .1023145    -0.56   0.578     .7606579    1.164764
                    |
               age1 |   1.161561   .0563852     3.09   0.002     1.056142    1.277502
               age2 |   .9559393   .1240811    -0.35   0.728      .741215    1.232868
               age3 |   .9797723   .3624159    -0.06   0.956      .474534     2.02294
             1.male |   2.058621   .1192722    12.46   0.000     1.837636     2.30618
                    |
          obese4cat |
 Obese I (30-34.9)  |   1.515769   .1065482     5.92   0.000     1.320685    1.739669
Obese II (35-39.9)  |    2.73774   .2238081    12.32   0.000     2.332422    3.213492
   Obese III (40+)  |   3.610677   .3538745    13.10   0.000     2.979643    4.375352
                    |
       smoke_nomiss |
            Former  |    1.16841   .0694058     2.62   0.009     1.039998    1.312679
           Current  |     .80299   .0658033    -2.68   0.007     .6838424    .9428971
                    |
                imd |
                 2  |   1.214915   .1271057     1.86   0.063     .9896744    1.491419
                 3  |   1.489729   .1512336     3.93   0.000     1.220943    1.817687
                 4  |   2.284529   .2181601     8.65   0.000     1.894574    2.754748
   5 most deprived  |   2.599416   .2594131     9.57   0.000     2.137611    3.160988
                    |
      tot_adults_hh |
                 2  |   .7749858   .0567438    -3.48   0.000     .6713817    .8945776
                 3  |   1.068243   .0741232     0.95   0.341     .9324101    1.223864
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat3_DEMOGADJ_noeth_12mo.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat3_DEMOGADJ_noeth_12mo.ster saved

. 
. stcox kids_cat3 age1 age2 age3  i.male  ///
>                         i.obese4cat                                     ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 12,492,079.523518)
Iteration 0:   log pseudolikelihood = -18182.637
Iteration 1:   log pseudolikelihood = -17510.948
Iteration 2:   log pseudolikelihood = -16927.791
Iteration 3:   log pseudolikelihood = -16898.451
Iteration 4:   log pseudolikelihood = -16898.219
Iteration 5:   log pseudolikelihood = -16898.219
Refining estimates:
Iteration 0:   log pseudolikelihood = -16898.219

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,080             Number of obs    =     376,101
No. of failures      =        1,380
Time at risk         =   1698315732
                                                Wald chi2(8)     =     1696.49
Log pseudolikelihood =   -16898.219             Prob > chi2      =      0.0000

                            (Std. Err. adjusted for 368,774 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |    .942001   .0493075    -1.14   0.254      .850152    1.043773
               age1 |   1.136294   .0541093     2.68   0.007      1.03504    1.247453
               age2 |   1.019159   .1289808     0.15   0.881      .795275    1.306071
               age3 |   .8053432   .2894606    -0.60   0.547     .3981417    1.629012
             1.male |   2.074253   .1198124    12.63   0.000      1.85223    2.322889
                    |
          obese4cat |
 Obese I (30-34.9)  |   1.600801   .1120451     6.72   0.000     1.395594    1.836182
Obese II (35-39.9)  |     3.0287   .2450085    13.70   0.000     2.584626    3.549071
   Obese III (40+)  |    4.16429   .4012127    14.81   0.000     3.447713    5.029801
-------------------------------------------------------------------------------------
                                                             Stratified by stp

.         
. 
. stcox kids_cat3 age1 age2 age3  i.male  ///
>                         i.smoke_nomiss                  ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 12,492,079.523518)
Iteration 0:   log pseudolikelihood = -18182.637
Iteration 1:   log pseudolikelihood = -17517.255
Iteration 2:   log pseudolikelihood = -17055.543
Iteration 3:   log pseudolikelihood = -17035.942
Iteration 4:   log pseudolikelihood = -17035.827
Iteration 5:   log pseudolikelihood = -17035.827
Refining estimates:
Iteration 0:   log pseudolikelihood = -17035.827

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,080             Number of obs    =     376,101
No. of failures      =        1,380
Time at risk         =   1698315732
                                                Wald chi2(7)     =     1273.33
Log pseudolikelihood =   -17035.827             Prob > chi2      =      0.0000

                     (Std. Err. adjusted for 368,774 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |   .9302985   .0487151    -1.38   0.168     .8395549     1.03085
        age1 |   1.131705   .0532943     2.63   0.009     1.031926    1.241132
        age2 |   1.048704    .131439     0.38   0.704     .8202908     1.34072
        age3 |   .7155354   .2549928    -0.94   0.348     .3558701    1.438702
      1.male |   1.921679    .109864    11.43   0.000     1.717976    2.149537
             |
smoke_nomiss |
     Former  |   1.293961   .0759826     4.39   0.000     1.153288    1.451792
    Current  |   .9130029   .0739836    -1.12   0.261     .7789265    1.070158
------------------------------------------------------------------------------
                                                             Stratified by stp

.                         
.                         
. stcox kids_cat3 age1 age2 age3  i.male  ///
>                         i.imd                                                   ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 12,492,079.523518)
Iteration 0:   log pseudolikelihood = -18182.637
Iteration 1:   log pseudolikelihood = -17421.847
Iteration 2:   log pseudolikelihood = -16971.798
Iteration 3:   log pseudolikelihood = -16953.222
Iteration 4:   log pseudolikelihood = -16953.112
Iteration 5:   log pseudolikelihood = -16953.112
Refining estimates:
Iteration 0:   log pseudolikelihood = -16953.112

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,080             Number of obs    =     376,101
No. of failures      =        1,380
Time at risk         =   1698315732
                                                Wald chi2(9)     =     1450.11
Log pseudolikelihood =   -16953.112             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 368,774 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |   .9364644   .0490206    -1.25   0.210     .8451502    1.037645
            age1 |   1.140505   .0542221     2.77   0.006     1.039033    1.251887
            age2 |   1.036753    .130925     0.29   0.775     .8094354    1.327908
            age3 |   .7445557   .2671093    -0.82   0.411     .3685774    1.504062
          1.male |   1.915573   .1097202    11.35   0.000     1.712157    2.143156
                 |
             imd |
              2  |   1.248709   .1303579     2.13   0.033     1.017655    1.532222
              3  |    1.57427   .1588041     4.50   0.000     1.291857    1.918421
              4  |   2.480025   .2326759     9.68   0.000     2.063461    2.980683
5 most deprived  |   2.871405   .2781761    10.89   0.000     2.374825     3.47182
----------------------------------------------------------------------------------
                                                             Stratified by stp

. 
. stcox kids_cat3 age1 age2 age3  i.male  ///
>                         i.tot_adults_hh                         ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 12,492,079.523518)
Iteration 0:   log pseudolikelihood = -18182.637
Iteration 1:   log pseudolikelihood = -17509.292
Iteration 2:   log pseudolikelihood =  -17050.03
Iteration 3:   log pseudolikelihood = -17030.868
Iteration 4:   log pseudolikelihood = -17030.759
Iteration 5:   log pseudolikelihood = -17030.759
Refining estimates:
Iteration 0:   log pseudolikelihood = -17030.759

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,080             Number of obs    =     376,101
No. of failures      =        1,380
Time at risk         =   1698315732
                                                Wald chi2(7)     =     1272.84
Log pseudolikelihood =   -17030.759             Prob > chi2      =      0.0000

                      (Std. Err. adjusted for 368,774 clusters in household_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
    kids_cat3 |   .9391581   .0489766    -1.20   0.229     .8479085    1.040228
         age1 |   1.159429   .0550833     3.11   0.002     1.056342    1.272577
         age2 |   .9814377   .1239752    -0.15   0.882     .7661945    1.257148
         age3 |   .8818472   .3166021    -0.35   0.726     .4363085     1.78235
       1.male |   1.909252   .1092641    11.30   0.000     1.706672    2.135878
              |
tot_adults_hh |
           2  |   .7193312   .0520183    -4.56   0.000     .6242728    .8288642
           3  |   1.031484   .0711991     0.45   0.653     .9009647    1.180912
-------------------------------------------------------------------------------
                                                             Stratified by stp

.                         
.                         
.         
. log close
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_covid_death.log
  log type:  text
 closed on:  24 Jul 2020, 13:51:40
----------------------------------------------------------------------------------------------------------------------------------
