----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_multivariableFULL_cox_models_covid_tpp_prob.log
  log type:  text
 opened on:  24 Jul 2020, 13:43:33

. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                ///
>                         i.male                                                  ///
>                         `bmi'                                                   ///
>                         `smoking'                                               ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                                ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabetes                                              ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.organ_trans                                   ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                              ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. foreach exposure_type in        kids_cat3  {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth, replace
  6. *estat concordance /*c-statistic*/
.         /*  Proportional Hazards test  */
.         * Based on Schoenfeld residuals
.         timer clear 
  7.         timer on 1
  8.         if e(N_fail)>0 estat phtest, d
  9.         timer off 1
 10.         timer list
 11. }
 12. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 13. 
. }
   1:     98.94 /        1 =      98.9410

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,921             Number of obs    =     397,151
No. of failures      =       23,055
Time at risk         =   1697424492
                                                Wald chi2(37)    =     9580.68
Log pseudolikelihood =   -298928.13             Prob > chi2      =      0.0000

                                      (Std. Err. adjusted for 387,798 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |    1.07898   .0204835     4.00   0.000     1.039571    1.119883
               Kids under 18  |   1.128481   .0283674     4.81   0.000      1.07423    1.185473
                              |
                         age1 |   1.054726   .0051654    10.88   0.000      1.04465    1.064899
                         age2 |   .9214652   .0146735    -5.14   0.000     .8931498    .9506783
                         age3 |   1.072476    .059793     1.26   0.209     .9614601    1.196311
                       1.male |   .7347967    .010321   -21.94   0.000     .7148438    .7553066
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.320176   .0255515    14.35   0.000     1.271034    1.371218
          Obese II (35-39.9)  |   1.476337    .038741    14.85   0.000     1.402326    1.554255
             Obese III (40+)  |    1.61277   .0519934    14.83   0.000     1.514017    1.717963
                              |
                 smoke_nomiss |
                      Former  |   .9638604   .0155678    -2.28   0.023      .933826    .9948607
                     Current  |   .5595259   .0123708   -26.26   0.000     .5357974    .5843052
                              |
                          imd |
                           2  |   1.125743    .027549     4.84   0.000     1.073022    1.181054
                           3  |   1.158731   .0286163     5.97   0.000      1.10398    1.216197
                           4  |   1.317918   .0317688    11.45   0.000       1.2571    1.381678
             5 most deprived  |   1.505073   .0376239    16.35   0.000     1.433109    1.580651
                              |
           1.htdiag_or_highbp |   1.189798   .0204419    10.11   0.000       1.1504    1.230546
1.chronic_respiratory_disease |   1.938479   .0694002    18.49   0.000      1.80712    2.079387
                     1.asthma |      1.301   .0228837    14.96   0.000     1.256913    1.346633
    1.chronic_cardiac_disease |   1.408417   .0464712    10.38   0.000     1.320218    1.502509
                   1.diabetes |   1.785986   .0398752    25.98   0.000     1.709518    1.865875
                              |
            cancer_exhaem_cat |
                   Last year  |   1.946206    .181752     7.13   0.000     1.620679    2.337119
               2-5 years ago  |   1.253001   .0864827     3.27   0.001     1.094463    1.434503
                    5+ years  |   1.109589   .0608552     1.90   0.058     .9965018    1.235509
                              |
              cancer_haem_cat |
                   Last year  |    3.35635   .7039333     5.77   0.000     2.225068    5.062806
               2-5 years ago  |   3.228618   .4478894     8.45   0.000     2.459993      4.2374
                    5+ years  |   1.873463   .1985375     5.92   0.000      1.52209     2.30595
                              |
      1.chronic_liver_disease |   1.822225   .1242164     8.80   0.000     1.594328    2.082697
            1.stroke_dementia |    1.52086   .0849933     7.50   0.000     1.363075    1.696909
                1.other_neuro |   1.669802   .1046882     8.18   0.000     1.476722    1.888126
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.344764   .0681617     5.84   0.000     1.217591     1.48522
           Stage 4/5 egfr<30  |   3.871242   .4069605    12.88   0.000     3.150421    4.756988
                              |
                1.organ_trans |   1.726027   .2027202     4.65   0.000     1.371118    2.172803
                              |
                tot_adults_hh |
                           2  |    1.01789   .0196785     0.92   0.359     .9800421    1.057199
                           3  |   1.148605   .0224483     7.09   0.000     1.105439    1.193456
                              |
                   1.asplenia |   2.559917   .3153612     7.63   0.000     2.010781    3.259021
           1.ra_sle_psoriasis |   1.246047   .0365065     7.51   0.000     1.176511    1.319692
               1.other_immuno |   2.305208   .1874439    10.27   0.000     1.965604    2.703485
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFULLYADJMODEL_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFULLYADJMODEL_noeth.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.02940        24.57        1         0.0000
      2.kids_cat3 |      0.02184        13.93        1         0.0002
      age1        |     -0.02498        14.37        1         0.0002
      age2        |      0.00716         1.23        1         0.2668
      age3        |      0.00078         0.02        1         0.9025
      0b.male     |            .            .        1             .
      1.male      |     -0.04658        55.69        1         0.0000
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01449         5.82        1         0.0159
      3.obese4cat |     -0.01189         4.14        1         0.0420
      4.obese4cat |     -0.02083        13.20        1         0.0003
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.02837        21.84        1         0.0000
      3.smoke_no~s|      0.01090         3.19        1         0.0743
      1b.imd      |            .            .        1             .
      2.imd       |      0.02646        19.23        1         0.0000
      3.imd       |      0.04631        59.88        1         0.0000
      4.imd       |      0.07298       151.12        1         0.0000
      5.imd       |      0.09377       259.41        1         0.0000
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.00377         0.40        1         0.5251
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.02266        16.19        1         0.0001
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.06477       115.86        1         0.0000
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.01261         4.94        1         0.0263
      0b.diabetes |            .            .        1             .
      1.diabetes  |     -0.00562         1.00        1         0.3178
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.01218         4.56        1         0.0328
      3.cancer_e~t|     -0.00421         0.55        1         0.4603
      4.cancer_e~t|     -0.01569         6.76        1         0.0093
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.01294         5.98        1         0.0144
      3.cancer_h~t|     -0.01793        11.23        1         0.0008
      4.cancer_h~t|      0.00289         0.27        1         0.6051
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.01115         4.32        1         0.0376
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.00382         0.50        1         0.4813
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.02158        13.89        1         0.0002
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.02399        17.40        1         0.0000
      3.reduced_~t|     -0.03556        67.43        1         0.0000
      0b.organ_t~s|            .            .        1             .
      1.organ_tr~s|     -0.00114         0.06        1         0.8026
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.01753         8.12        1         0.0044
      3.tot_adul~h|      0.05967        95.75        1         0.0000
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00780         2.04        1         0.1530
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00848         1.96        1         0.1612
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.00788         2.24        1         0.1343
      ------------+---------------------------------------------------
      global test |                   1454.65       37         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:    121.82 /        1 =     121.8180

. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
(0 observations deleted)

. foreach exposure_type in kids_cat3   {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth12mo, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. }       
   1:     86.16 /        1 =      86.1550

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,921             Number of obs    =     397,151
No. of failures      =       23,055
Time at risk         =   1697424492
                                                Wald chi2(37)    =     9580.68
Log pseudolikelihood =   -298928.13             Prob > chi2      =      0.0000

                                      (Std. Err. adjusted for 387,798 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |    1.07898   .0204835     4.00   0.000     1.039571    1.119883
               Kids under 18  |   1.128481   .0283674     4.81   0.000      1.07423    1.185473
                              |
                         age1 |   1.054726   .0051654    10.88   0.000      1.04465    1.064899
                         age2 |   .9214652   .0146735    -5.14   0.000     .8931498    .9506783
                         age3 |   1.072476    .059793     1.26   0.209     .9614601    1.196311
                       1.male |   .7347967    .010321   -21.94   0.000     .7148438    .7553066
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.320176   .0255515    14.35   0.000     1.271034    1.371218
          Obese II (35-39.9)  |   1.476337    .038741    14.85   0.000     1.402326    1.554255
             Obese III (40+)  |    1.61277   .0519934    14.83   0.000     1.514017    1.717963
                              |
                 smoke_nomiss |
                      Former  |   .9638604   .0155678    -2.28   0.023      .933826    .9948607
                     Current  |   .5595259   .0123708   -26.26   0.000     .5357974    .5843052
                              |
                          imd |
                           2  |   1.125743    .027549     4.84   0.000     1.073022    1.181054
                           3  |   1.158731   .0286163     5.97   0.000      1.10398    1.216197
                           4  |   1.317918   .0317688    11.45   0.000       1.2571    1.381678
             5 most deprived  |   1.505073   .0376239    16.35   0.000     1.433109    1.580651
                              |
           1.htdiag_or_highbp |   1.189798   .0204419    10.11   0.000       1.1504    1.230546
1.chronic_respiratory_disease |   1.938479   .0694002    18.49   0.000      1.80712    2.079387
                     1.asthma |      1.301   .0228837    14.96   0.000     1.256913    1.346633
    1.chronic_cardiac_disease |   1.408417   .0464712    10.38   0.000     1.320218    1.502509
                   1.diabetes |   1.785986   .0398752    25.98   0.000     1.709518    1.865875
                              |
            cancer_exhaem_cat |
                   Last year  |   1.946206    .181752     7.13   0.000     1.620679    2.337119
               2-5 years ago  |   1.253001   .0864827     3.27   0.001     1.094463    1.434503
                    5+ years  |   1.109589   .0608552     1.90   0.058     .9965018    1.235509
                              |
              cancer_haem_cat |
                   Last year  |    3.35635   .7039333     5.77   0.000     2.225068    5.062806
               2-5 years ago  |   3.228618   .4478894     8.45   0.000     2.459993      4.2374
                    5+ years  |   1.873463   .1985375     5.92   0.000      1.52209     2.30595
                              |
      1.chronic_liver_disease |   1.822225   .1242164     8.80   0.000     1.594328    2.082697
            1.stroke_dementia |    1.52086   .0849933     7.50   0.000     1.363075    1.696909
                1.other_neuro |   1.669802   .1046882     8.18   0.000     1.476722    1.888126
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.344764   .0681617     5.84   0.000     1.217591     1.48522
           Stage 4/5 egfr<30  |   3.871242   .4069605    12.88   0.000     3.150421    4.756988
                              |
                1.organ_trans |   1.726027   .2027202     4.65   0.000     1.371118    2.172803
                              |
                tot_adults_hh |
                           2  |    1.01789   .0196785     0.92   0.359     .9800421    1.057199
                           3  |   1.148605   .0224483     7.09   0.000     1.105439    1.193456
                              |
                   1.asplenia |   2.559917   .3153612     7.63   0.000     2.010781    3.259021
           1.ra_sle_psoriasis |   1.246047   .0365065     7.51   0.000     1.176511    1.319692
               1.other_immuno |   2.305208   .1874439    10.27   0.000     1.965604    2.703485
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFULLYADJMODEL_noeth12mo.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFULLYADJMODEL_noeth12mo.ster saved

. 
.  
.  
.  foreach exposure_type in       gp_number_kids {
  2. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth, replace
  6. }
  7. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
  8. }
   1:     91.40 /        1 =      91.4030

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,921             Number of obs    =     397,151
No. of failures      =       23,055
Time at risk         =   1697424492
                                                Wald chi2(39)    =     9570.63
Log pseudolikelihood =   -298926.04             Prob > chi2      =      0.0000

                                      (Std. Err. adjusted for 387,798 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              only >12 years  |   1.128382   .0283651     4.80   0.000     1.074135    1.185369
                 1 child <12  |   1.083872   .0245741     3.55   0.000     1.036762    1.133123
              2 children <12  |    1.04939   .0291507     1.74   0.083     .9937831    1.108108
             3+ children <12  |   1.144955     .05042     3.07   0.002     1.050278    1.248166
                              |
                         age1 |   1.054796    .005181    10.86   0.000      1.04469       1.065
                         age2 |   .9213583   .0147219    -5.13   0.000     .8929511    .9506692
                         age3 |    1.07248    .059988     1.25   0.211      .961121    1.196741
                       1.male |   .7348837   .0103235   -21.93   0.000     .7149261    .7553985
                              |
                    obese4cat |
           Obese I (30-34.9)  |    1.31982   .0255471    14.34   0.000     1.270687    1.370853
          Obese II (35-39.9)  |   1.475743   .0387336    14.83   0.000     1.401746    1.553646
             Obese III (40+)  |   1.612407   .0519762    14.82   0.000     1.513687    1.717565
                              |
                 smoke_nomiss |
                      Former  |    .963801   .0155695    -2.28   0.022     .9337635    .9948048
                     Current  |     .55928    .012371   -26.27   0.000     .5355514    .5840601
                              |
                          imd |
                           2  |   1.125328   .0275437     4.82   0.000     1.072618    1.180629
                           3  |   1.158013   .0286035     5.94   0.000     1.103287    1.215454
                           4  |   1.316785   .0317495    11.41   0.000     1.256005    1.380507
             5 most deprived  |   1.502787   .0375934    16.28   0.000     1.430883    1.578305
                              |
           1.htdiag_or_highbp |   1.189869   .0204414    10.12   0.000     1.150472    1.230616
1.chronic_respiratory_disease |   1.938087   .0694169    18.47   0.000     1.806698    2.079031
                     1.asthma |    1.30133   .0228915    14.97   0.000     1.257228    1.346979
    1.chronic_cardiac_disease |   1.408322   .0464788    10.37   0.000     1.320109     1.50243
                   1.diabetes |   1.785999   .0398748    25.98   0.000     1.709531    1.865887
                              |
            cancer_exhaem_cat |
                   Last year  |   1.946574   .1817776     7.13   0.000        1.621     2.33754
               2-5 years ago  |   1.252747   .0864699     3.26   0.001     1.094233    1.434224
                    5+ years  |   1.109791   .0608697     1.90   0.058     .9966778    1.235742
                              |
              cancer_haem_cat |
                   Last year  |   3.358856   .7043461     5.78   0.000     2.226875    5.066252
               2-5 years ago  |    3.22818   .4477787     8.45   0.000     2.459734    4.236696
                    5+ years  |   1.873385   .1985378     5.92   0.000     1.522013    2.305875
                              |
      1.chronic_liver_disease |   1.821589   .1241769     8.80   0.000     1.593765    2.081979
            1.stroke_dementia |   1.520834   .0849936     7.50   0.000     1.363049    1.696884
                1.other_neuro |   1.670599   .1047277     8.19   0.000     1.477445    1.889004
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.344319   .0681402     5.84   0.000     1.217186    1.484731
           Stage 4/5 egfr<30  |   3.867216   .4072477    12.84   0.000     3.146011    4.753752
                              |
                1.organ_trans |   1.728326   .2029607     4.66   0.000      1.37299    2.175624
                              |
                tot_adults_hh |
                           2  |   1.018199   .0196996     0.93   0.351      .980311    1.057551
                           3  |   1.147955   .0224375     7.06   0.000      1.10481    1.192785
                              |
                   1.asplenia |   2.560799   .3155108     7.63   0.000      2.01141    3.260245
           1.ra_sle_psoriasis |   1.246052   .0365071     7.51   0.000     1.176514    1.319699
               1.other_immuno |   2.305123   .1874301    10.27   0.000     1.965544     2.70337
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_MAINFULLYADJMODEL_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_MAINFULLYADJMODEL_noeth.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_multivariableFULL_cox_models_covid_tpp_prob.log
  log type:  text
 closed on:  24 Jul 2020, 13:50:27
----------------------------------------------------------------------------------------------------------------------------------
