----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_non_covid_death.log
  log type:  text
 opened on:  24 Jul 2020, 13:43:23

. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                                        ///
>                         i.male                                                  ///
>                         `bmi'                                   ///
>                         `smoking'                                       ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         i.tot_adults_hh                         ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. foreach exposure_type in kids_cat3  ///
>                 gp_number_kids {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  9. if _rc==0{
 10. estimates
 11. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth, replace
 12. *estat concordance /*c-statistic*/
.  }
 13.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 14. 
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.bmicat) smoking(i.smoke)
 15. if _rc==0{
 16. estimates
 17. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth_bmi_smok, replace
 18. *estat concordance /*c-statistic*/
.  }
 19.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 20.  
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.bmicat) smoking(i.smoke)
 21. if _rc==0{
 22. estimates
 23. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCnoeth_bmi_smok, replace
 24. *estat concordance /*c-statistic*/
.  }
 25.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 26.  
. }
   1:    104.06 /        1 =     104.0570

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,381             Number of obs    =     381,996
No. of failures      =        7,448
Time at risk         =   1698306199
                                                Wald chi2(17)    =     7608.99
Log pseudolikelihood =   -91462.294             Prob > chi2      =      0.0000

                            (Std. Err. adjusted for 374,481 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   .6179385   .0294062   -10.12   0.000     .5629095     .678347
     Kids under 18  |   .6843329   .0370443    -7.01   0.000     .6154463    .7609298
                    |
               age1 |    1.13932   .0230915     6.44   0.000     1.094948    1.185489
               age2 |   .9376527   .0512299    -1.18   0.239     .8424332    1.043635
               age3 |   1.136168   .1783765     0.81   0.416     .8352283    1.545538
             1.male |   1.301556   .0319786    10.73   0.000     1.240364    1.365766
                    |
          obese4cat |
 Obese I (30-34.9)  |   .8694669   .0297022    -4.09   0.000     .8131578    .9296752
Obese II (35-39.9)  |   1.028888   .0487447     0.60   0.548     .9376514    1.129002
   Obese III (40+)  |   1.519416   .0833699     7.62   0.000     1.364494    1.691928
                    |
       smoke_nomiss |
            Former  |   1.480295   .0442835    13.11   0.000     1.395997    1.569684
           Current  |   2.656723   .0812881    31.93   0.000     2.502085    2.820919
                    |
                imd |
                 2  |     1.0806   .0460998     1.82   0.069     .9939207    1.174839
                 3  |   1.302548   .0541159     6.36   0.000     1.200686    1.413051
                 4  |   1.493247   .0614023     9.75   0.000     1.377623    1.618576
   5 most deprived  |    1.96118   .0813948    16.23   0.000     1.807965    2.127378
                    |
      tot_adults_hh |
                 2  |   .6890318   .0200505   -12.80   0.000     .6508332    .7294724
                 3  |   .6937743   .0212483   -11.94   0.000     .6533536    .7366956
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth.ster saved
   1:     78.57 /        1 =      78.5660

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,529,563             Number of obs    =     291,380
No. of failures      =        5,663
Time at risk         =   1295507564
                                                Wald chi2(21)    =     5759.11
Log pseudolikelihood =   -68083.291             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 286,735 clusters in household_id)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              kids_cat3 |
         Kids under 12  |   .6059201   .0327775    -9.26   0.000     .5449657    .6736922
         Kids under 18  |   .6619039   .0415993    -6.57   0.000     .5851925    .7486712
                        |
                   age1 |    1.17357   .0286651     6.55   0.000     1.118711    1.231119
                   age2 |    .868189   .0565529    -2.17   0.030     .7641312    .9864173
                   age3 |   1.381608   .2567492     1.74   0.082     .9598489    1.988688
                 1.male |   1.352727   .0381467    10.71   0.000      1.27999    1.429598
                        |
              obese4cat |
     Obese I (30-34.9)  |   .8824079   .0337441    -3.27   0.001     .8186885    .9510867
    Obese II (35-39.9)  |   .9906886   .0538748    -0.17   0.863     .8905285    1.102114
       Obese III (40+)  |   1.578188   .0977077     7.37   0.000     1.397848    1.781795
                        |
           smoke_nomiss |
                Former  |   1.442592   .0498576    10.60   0.000     1.348109    1.543696
               Current  |   2.629955   .0935383    27.19   0.000     2.452868    2.819828
                        |
              ethnicity |
                 Mixed  |   .7018877   .1067247    -2.33   0.020     .5210018    .9455751
Asian or Asian British  |   .8739914   .0585047    -2.01   0.044      .766528    .9965207
                 Black  |   1.096656   .0902355     1.12   0.262     .9333218    1.288574
                 Other  |   .4971998    .069859    -4.97   0.000      .377514    .6548305
                        |
                    imd |
                     2  |   1.064066   .0530816     1.24   0.213     .9649527    1.173361
                     3  |    1.29653   .0628149     5.36   0.000     1.179079     1.42568
                     4  |   1.485983   .0711809     8.27   0.000      1.35282    1.632254
       5 most deprived  |   1.990746   .0967867    14.16   0.000     1.809805    2.189776
                        |
          tot_adults_hh |
                     2  |   .6844429   .0228049   -11.38   0.000     .6411742    .7306315
                     3  |   .7047517    .024969    -9.88   0.000     .6574738    .7554292
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth.ster saved
   1:     66.26 /        1 =      66.2630

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    7,796,292             Number of obs    =     238,764
No. of failures      =        5,026
Time at risk         =   1059843600
                                                Wald chi2(23)    =     5214.88
Log pseudolikelihood =   -59406.953             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 235,870 clusters in household_id)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              kids_cat3 |
         Kids under 12  |   .6349542   .0367568    -7.85   0.000     .5668489    .7112421
         Kids under 18  |   .6694703    .045418    -5.91   0.000      .586117    .7646775
                        |
                   age1 |   1.246839   .0368386     7.47   0.000     1.176687    1.321173
                   age2 |   .7508801   .0579677    -3.71   0.000     .6454433    .8735405
                   age3 |   2.004983   .4342908     3.21   0.001     1.311401    3.065391
                 1.male |   1.507496   .0462197    13.39   0.000     1.419575    1.600862
                        |
                 bmicat |
    Normal (18.5-24.9)  |   .2585603   .0185952   -18.81   0.000     .2245665    .2976999
  Overweight (25-29.9)  |   .1730479   .0127503   -23.81   0.000     .1497784    .1999326
     Obese I (30-34.9)  |   .2001432     .01535   -20.98   0.000     .1722098    .2326076
    Obese II (35-39.9)  |     .22685   .0194164   -17.33   0.000     .1918153    .2682837
       Obese III (40+)  |   .3660051   .0329573   -11.16   0.000     .3067891     .436651
                        |
                  smoke |
                Former  |   1.457838   .0537973    10.21   0.000      1.35612    1.567186
               Current  |   2.505774   .0972949    23.66   0.000     2.322155    2.703912
                        |
              ethnicity |
                 Mixed  |   .6593845   .1103479    -2.49   0.013     .4749964    .9153501
Asian or Asian British  |   .9021071   .0637641    -1.46   0.145     .7854023    1.036153
                 Black  |   1.160035   .1008722     1.71   0.088     .9782587    1.375587
                 Other  |   .5262879   .0785493    -4.30   0.000     .3928079    .7051256
                        |
                    imd |
                     2  |   1.092921    .057928     1.68   0.094     .9850824    1.212565
                     3  |    1.29763   .0672526     5.03   0.000     1.172291    1.436369
                     4  |   1.476057   .0757778     7.58   0.000     1.334763    1.632308
       5 most deprived  |    1.95085   .1020262    12.78   0.000      1.76079    2.161426
                        |
          tot_adults_hh |
                     2  |   .6987609   .0248788   -10.07   0.000     .6516618     .749264
                     3  |   .7192673   .0274545    -8.63   0.000     .6674209    .7751411
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:     70.45 /        1 =      70.4530

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,393,097             Number of obs    =     287,934
No. of failures      =        6,331
Time at risk         =   1276905134
                                                Wald chi2(19)    =     6611.23
Log pseudolikelihood =   -75959.143             Prob > chi2      =      0.0000

                              (Std. Err. adjusted for 283,952 clusters in household_id)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
            kids_cat3 |
       Kids under 12  |   .6421569   .0336371    -8.46   0.000     .5795006    .7115875
       Kids under 18  |    .703001   .0419257    -5.91   0.000     .6254489    .7901692
                      |
                 age1 |   1.209044    .031577     7.27   0.000     1.148712    1.272545
                 age2 |     .81477   .0558855    -2.99   0.003     .7122799    .9320074
                 age3 |   1.616575   .3117525     2.49   0.013     1.107755    2.359109
               1.male |    1.49319   .0407629    14.69   0.000     1.415396     1.57526
                      |
               bmicat |
  Normal (18.5-24.9)  |   .2609864   .0166308   -21.08   0.000     .2303439    .2957052
Overweight (25-29.9)  |   .1685131   .0110327   -27.20   0.000     .1482192    .1915855
   Obese I (30-34.9)  |   .1910082   .0130214   -24.28   0.000     .1671183    .2183132
  Obese II (35-39.9)  |    .228547   .0172291   -19.58   0.000     .1971549    .2649376
     Obese III (40+)  |   .3419674   .0273067   -13.44   0.000     .2924251    .3999029
                      |
                smoke |
              Former  |   1.465413   .0479816    11.67   0.000     1.374325    1.562539
             Current  |   2.496448   .0860077    26.55   0.000     2.333441    2.670841
                      |
                  imd |
                   2  |   1.088572   .0507206     1.82   0.069      .993566    1.192663
                   3  |   1.280246   .0583829     5.42   0.000     1.170782    1.399944
                   4  |   1.482415   .0669068     8.72   0.000     1.356913    1.619525
     5 most deprived  |   1.921373   .0877605    14.30   0.000      1.75684    2.101315
                      |
        tot_adults_hh |
                   2  |   .7020724    .022374   -11.10   0.000     .6595617    .7473231
                   3  |   .7197564   .0243424    -9.72   0.000     .6735931    .7690834
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok.ster saved
   1:     90.92 /        1 =      90.9150

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,381             Number of obs    =     381,996
No. of failures      =        7,448
Time at risk         =   1698306199
                                                Wald chi2(19)    =     7581.81
Log pseudolikelihood =   -91459.182             Prob > chi2      =      0.0000

                            (Std. Err. adjusted for 374,481 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
     gp_number_kids |
    only >12 years  |   .6838461   .0370171    -7.02   0.000       .61501    .7603867
       1 child <12  |   .6669838   .0370105    -7.30   0.000       .59825    .7436145
    2 children <12  |   .5419603   .0446616    -7.43   0.000     .4611285    .6369612
   3+ children <12  |   .5432852   .0763289    -4.34   0.000     .4125136    .7155129
                    |
               age1 |   1.140554   .0230562     6.51   0.000     1.096248     1.18665
               age2 |   .9337744   .0509089    -1.26   0.209     .8391409     1.03908
               age3 |    1.15219   .1805984     0.90   0.366     .8474296    1.566551
             1.male |   1.301931   .0319857    10.74   0.000     1.240725    1.366155
                    |
          obese4cat |
 Obese I (30-34.9)  |   .8694907   .0297048    -4.09   0.000     .8131768    .9297045
Obese II (35-39.9)  |   1.028927   .0487469     0.60   0.547     .9376868    1.129046
   Obese III (40+)  |   1.518521   .0833233     7.61   0.000     1.363685    1.690936
                    |
       smoke_nomiss |
            Former  |   1.479682   .0442626    13.10   0.000     1.395423    1.569029
           Current  |   2.654972   .0812134    31.92   0.000     2.500475    2.819016
                    |
                imd |
                 2  |   1.080364    .046089     1.81   0.070     .9937043     1.17458
                 3  |   1.302054   .0540977     6.35   0.000     1.200227     1.41252
                 4  |   1.492932   .0613906     9.75   0.000      1.37733    1.618237
   5 most deprived  |    1.96172    .081408    16.24   0.000      1.80848    2.127945
                    |
      tot_adults_hh |
                 2  |   .6898943   .0200733   -12.76   0.000     .6516522    .7303806
                 3  |   .6940727   .0212564   -11.92   0.000     .6536365    .7370103
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_noeth.ster saved
   1:     77.42 /        1 =      77.4240

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,529,563             Number of obs    =     291,380
No. of failures      =        5,663
Time at risk         =   1295507564
                                                Wald chi2(23)    =     5743.50
Log pseudolikelihood =   -68082.058             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 286,735 clusters in household_id)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |   .6614978   .0415732    -6.58   0.000     .5848345    .7482107
           1 child <12  |    .639776   .0406854    -7.02   0.000     .5648034    .7247005
        2 children <12  |   .5602747   .0506681    -6.41   0.000     .4692704    .6689272
       3+ children <12  |   .5361996    .083633    -4.00   0.000     .3949677    .7279331
                        |
                   age1 |   1.174313   .0286144     6.59   0.000     1.119548    1.231757
                   age2 |   .8658911   .0562945    -2.21   0.027     .7622962    .9835643
                   age3 |   1.394553   .2587868     1.79   0.073     .9693434    2.006283
                 1.male |   1.353051   .0381515    10.72   0.000     1.280305    1.429932
                        |
              obese4cat |
     Obese I (30-34.9)  |   .8824787   .0337488    -3.27   0.001     .8187504    .9511673
    Obese II (35-39.9)  |   .9907417   .0538781    -0.17   0.864     .8905756    1.102174
       Obese III (40+)  |   1.577631   .0976785     7.36   0.000     1.397345    1.781178
                        |
           smoke_nomiss |
                Former  |   1.442264   .0498412    10.60   0.000     1.347812    1.543335
               Current  |   2.629176   .0934847    27.19   0.000     2.452188    2.818938
                        |
              ethnicity |
                 Mixed  |   .7025995   .1068481    -2.32   0.020      .521508    .9465741
Asian or Asian British  |   .8763562   .0586848    -1.97   0.049     .7685645    .9992658
                 Black  |    1.09844   .0903832     1.14   0.254     .9348391    1.290672
                 Other  |   .4977103   .0699133    -4.97   0.000     .3779275    .6554579
                        |
                    imd |
                     2  |    1.06391   .0530736     1.24   0.214     .9648109    1.173187
                     3  |   1.296109   .0627995     5.35   0.000     1.178688    1.425228
                     4  |    1.48556   .0711616     8.26   0.000     1.352433    1.631791
       5 most deprived  |   1.991037    .096799    14.16   0.000     1.810073    2.190093
                        |
          tot_adults_hh |
                     2  |   .6851116   .0228263   -11.35   0.000     .6418023    .7313434
                     3  |   .7049601   .0249749    -9.87   0.000     .6576709    .7556496
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth.ster saved
   1:     65.10 /        1 =      65.0980

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    7,796,292             Number of obs    =     238,764
No. of failures      =        5,026
Time at risk         =   1059843600
                                                Wald chi2(25)    =     5203.04
Log pseudolikelihood =   -59405.995             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 235,870 clusters in household_id)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |   .6690404   .0453885    -5.92   0.000     .5857413    .7641856
           1 child <12  |   .6680418   .0453566    -5.94   0.000     .5848055    .7631253
        2 children <12  |   .5880167   .0566931    -5.51   0.000     .4867677    .7103257
       3+ children <12  |   .5711782   .0939333    -3.41   0.001     .4137967    .7884175
                        |
                   age1 |    1.24749   .0367574     7.50   0.000     1.177487    1.321654
                   age2 |   .7490748   .0576902    -3.75   0.000     .6441242    .8711255
                   age3 |   2.022539   .4372355     3.26   0.001     1.323984    3.089662
                 1.male |   1.507966   .0462284    13.40   0.000     1.420028    1.601349
                        |
                 bmicat |
    Normal (18.5-24.9)  |   .2585438    .018594   -18.81   0.000     .2245522    .2976809
  Overweight (25-29.9)  |   .1730447   .0127505   -23.81   0.000     .1497748    .1999299
     Obese I (30-34.9)  |   .2001431   .0153504   -20.97   0.000     .1722089    .2326084
    Obese II (35-39.9)  |   .2268527   .0194173   -17.33   0.000     .1918165    .2682884
       Obese III (40+)  |   .3658566   .0329447   -11.17   0.000     .3066633    .4364757
                        |
                  smoke |
                Former  |   1.457479   .0537779    10.21   0.000     1.355797    1.566787
               Current  |   2.504871   .0972208    23.66   0.000     2.321389    2.702855
                        |
              ethnicity |
                 Mixed  |   .6601012   .1104898    -2.48   0.013     .4754817    .9164047
Asian or Asian British  |   .9044276   .0639839    -1.42   0.156     .7873274    1.038944
                 Black  |   1.161544   .1009973     1.72   0.085     .9795414    1.377363
                 Other  |   .5268512   .0786105    -4.29   0.000     .3932617    .7058205
                        |
                    imd |
                     2  |   1.092715   .0579165     1.67   0.094     .9848978    1.212335
                     3  |   1.297342   .0672387     5.02   0.000     1.172029    1.436054
                     4  |   1.475644   .0757548     7.58   0.000     1.334393    1.631848
       5 most deprived  |   1.951101   .1020347    12.78   0.000     1.761025    2.161694
                        |
          tot_adults_hh |
                     2  |   .6994039   .0249006   -10.04   0.000     .6522634    .7499512
                     3  |   .7195136   .0274624    -8.62   0.000     .6676523    .7754034
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:     70.55 /        1 =      70.5450

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,393,097             Number of obs    =     287,934
No. of failures      =        6,331
Time at risk         =   1276905134
                                                Wald chi2(21)    =     6591.16
Log pseudolikelihood =   -75956.762             Prob > chi2      =      0.0000

                              (Std. Err. adjusted for 283,952 clusters in household_id)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
       gp_number_kids |
      only >12 years  |   .7024948   .0418943    -5.92   0.000     .6250006    .7895975
         1 child <12  |   .6877545   .0419221    -6.14   0.000     .6103072    .7750298
      2 children <12  |   .5852362   .0519794    -6.03   0.000     .4917329    .6965192
     3+ children <12  |   .5238688   .0826073    -4.10   0.000      .384591    .7135854
                      |
                 age1 |   1.209993   .0314803     7.33   0.000     1.149839    1.273293
                 age2 |   .8118939   .0554939    -3.05   0.002     .7100985     .928282
                 age3 |   1.637226     .31478     2.56   0.010     1.123189    2.386515
               1.male |   1.493898   .0407798    14.70   0.000     1.416071    1.576002
                      |
               bmicat |
  Normal (18.5-24.9)  |   .2610598   .0166361   -21.07   0.000     .2304077    .2957897
Overweight (25-29.9)  |   .1685615   .0110369   -27.19   0.000       .14826    .1916429
   Obese I (30-34.9)  |   .1910679   .0130263   -24.28   0.000      .167169    .2183834
  Obese II (35-39.9)  |   .2286087    .017235   -19.57   0.000     .1972059     .265012
     Obese III (40+)  |   .3418861   .0273009   -13.44   0.000     .2923545    .3998096
                      |
                smoke |
              Former  |   1.464722   .0479539    11.66   0.000     1.373686    1.561791
             Current  |   2.494967   .0859243    26.55   0.000     2.332116    2.669189
                      |
                  imd |
                   2  |   1.088419    .050712     1.82   0.069     .9934289    1.192493
                   3  |    1.28018     .05838     5.42   0.000     1.170722    1.399873
                   4  |   1.482385   .0669046     8.72   0.000     1.356887    1.619491
     5 most deprived  |   1.922764   .0878205    14.31   0.000     1.758118    2.102828
                      |
        tot_adults_hh |
                   2  |   .7029164   .0223988   -11.06   0.000     .6603585    .7482171
                   3  |   .7202413   .0243574    -9.70   0.000     .6740495    .7695985
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster saved

. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
(0 observations deleted)

. foreach exposure_type in kids_cat3   {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_12mo, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. }               
   1:     77.52 /        1 =      77.5180

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,381             Number of obs    =     381,996
No. of failures      =        7,448
Time at risk         =   1698306199
                                                Wald chi2(17)    =     7608.99
Log pseudolikelihood =   -91462.294             Prob > chi2      =      0.0000

                            (Std. Err. adjusted for 374,481 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   .6179385   .0294062   -10.12   0.000     .5629095     .678347
     Kids under 18  |   .6843329   .0370443    -7.01   0.000     .6154463    .7609298
                    |
               age1 |    1.13932   .0230915     6.44   0.000     1.094948    1.185489
               age2 |   .9376527   .0512299    -1.18   0.239     .8424332    1.043635
               age3 |   1.136168   .1783765     0.81   0.416     .8352283    1.545538
             1.male |   1.301556   .0319786    10.73   0.000     1.240364    1.365766
                    |
          obese4cat |
 Obese I (30-34.9)  |   .8694669   .0297022    -4.09   0.000     .8131578    .9296752
Obese II (35-39.9)  |   1.028888   .0487447     0.60   0.548     .9376514    1.129002
   Obese III (40+)  |   1.519416   .0833699     7.62   0.000     1.364494    1.691928
                    |
       smoke_nomiss |
            Former  |   1.480295   .0442835    13.11   0.000     1.395997    1.569684
           Current  |   2.656723   .0812881    31.93   0.000     2.502085    2.820919
                    |
                imd |
                 2  |     1.0806   .0460998     1.82   0.069     .9939207    1.174839
                 3  |   1.302548   .0541159     6.36   0.000     1.200686    1.413051
                 4  |   1.493247   .0614023     9.75   0.000     1.377623    1.618576
   5 most deprived  |    1.96118   .0813948    16.23   0.000     1.807965    2.127378
                    |
      tot_adults_hh |
                 2  |   .6890318   .0200505   -12.80   0.000     .6508332    .7294724
                 3  |   .6937743   .0212483   -11.94   0.000     .6533536    .7366956
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_12mo.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_12mo.ster saved

. 
. stcox kids_cat3 age1 age2 age3  i.male  ///
>                         i.obese4cat                                     ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 12,492,380.857071)
Iteration 0:   log pseudolikelihood = -97509.505
Iteration 1:   log pseudolikelihood = -94225.387
Iteration 2:   log pseudolikelihood = -92555.416
Iteration 3:   log pseudolikelihood = -92536.765
Iteration 4:   log pseudolikelihood = -92536.735
Iteration 5:   log pseudolikelihood = -92536.735
Refining estimates:
Iteration 0:   log pseudolikelihood = -92536.735

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,381             Number of obs    =     381,996
No. of failures      =        7,448
Time at risk         =   1698306199
                                                Wald chi2(8)     =     6109.19
Log pseudolikelihood =   -92536.735             Prob > chi2      =      0.0000

                            (Std. Err. adjusted for 374,481 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |   .6994967   .0190093   -13.15   0.000     .6632139    .7377644
               age1 |   1.160282    .023051     7.48   0.000     1.115971    1.206352
               age2 |    .897857   .0477662    -2.03   0.043     .8089525    .9965321
               age3 |   1.228286    .186872     1.35   0.177     .9115856    1.655014
             1.male |    1.40777   .0342151    14.07   0.000     1.342282    1.476453
                    |
          obese4cat |
 Obese I (30-34.9)  |   .8564655   .0289795    -4.58   0.000     .8015091      .91519
Obese II (35-39.9)  |   1.052029   .0492291     1.08   0.278     .9598339    1.153079
   Obese III (40+)  |   1.580095   .0851269     8.49   0.000     1.421756    1.756068
-------------------------------------------------------------------------------------
                                                             Stratified by stp

.         
. 
. stcox kids_cat3 age1 age2 age3  i.male  ///
>                         i.smoke_nomiss                  ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 12,492,380.857071)
Iteration 0:   log pseudolikelihood = -97509.505
Iteration 1:   log pseudolikelihood = -93461.129
Iteration 2:   log pseudolikelihood = -91866.756
Iteration 3:   log pseudolikelihood = -91851.457
Iteration 4:   log pseudolikelihood = -91851.435
Iteration 5:   log pseudolikelihood = -91851.435
Refining estimates:
Iteration 0:   log pseudolikelihood = -91851.435

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,381             Number of obs    =     381,996
No. of failures      =        7,448
Time at risk         =   1698306199
                                                Wald chi2(7)     =     6869.19
Log pseudolikelihood =   -91851.435             Prob > chi2      =      0.0000

                     (Std. Err. adjusted for 374,481 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |   .7228675   .0194907   -12.04   0.000     .6856582     .762096
        age1 |   1.133318    .022888     6.20   0.000     1.089335    1.179078
        age2 |   .9547968   .0516166    -0.86   0.392     .8588054    1.061518
        age3 |   1.061932   .1641344     0.39   0.697     .7843921    1.437673
      1.male |   1.299224   .0315493    10.78   0.000     1.238836    1.362554
             |
smoke_nomiss |
     Former  |   1.530481   .0454414    14.33   0.000      1.44396    1.622187
    Current  |    3.07778    .092158    37.54   0.000     2.902351    3.263811
------------------------------------------------------------------------------
                                                             Stratified by stp

.                         
.                         
. stcox kids_cat3 age1 age2 age3  i.male  ///
>                         i.imd                                                   ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 12,492,380.857071)
Iteration 0:   log pseudolikelihood = -97509.505
Iteration 1:   log pseudolikelihood = -93848.278
Iteration 2:   log pseudolikelihood =  -92221.52
Iteration 3:   log pseudolikelihood = -92204.132
Iteration 4:   log pseudolikelihood = -92204.105
Iteration 5:   log pseudolikelihood = -92204.105
Refining estimates:
Iteration 0:   log pseudolikelihood = -92204.105

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,381             Number of obs    =     381,996
No. of failures      =        7,448
Time at risk         =   1698306199
                                                Wald chi2(9)     =     6608.61
Log pseudolikelihood =   -92204.105             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 374,481 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |   .7008408   .0191037   -13.04   0.000     .6643809    .7393015
            age1 |   1.157687     .02303     7.36   0.000     1.113417    1.203716
            age2 |    .908754   .0484114    -1.80   0.072     .8186549    1.008769
            age3 |   1.188524   .1811909     1.13   0.257     .8815396    1.602411
          1.male |   1.370732   .0331482    13.04   0.000     1.307279    1.437266
                 |
             imd |
              2  |    1.14925   .0488147     3.28   0.001      1.05745    1.249021
              3  |   1.454669   .0599352     9.10   0.000     1.341816    1.577013
              4  |   1.791069   .0724205    14.41   0.000     1.654606    1.938786
5 most deprived  |   2.587581   .1038569    23.69   0.000     2.391826    2.799358
----------------------------------------------------------------------------------
                                                             Stratified by stp

. 
. stcox kids_cat3 age1 age2 age3  i.male  ///
>                         i.tot_adults_hh                         ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 12,492,380.857071)
Iteration 0:   log pseudolikelihood = -97509.505
Iteration 1:   log pseudolikelihood = -94088.261
Iteration 2:   log pseudolikelihood = -92416.609
Iteration 3:   log pseudolikelihood = -92397.489
Iteration 4:   log pseudolikelihood = -92397.459
Iteration 5:   log pseudolikelihood = -92397.459
Refining estimates:
Iteration 0:   log pseudolikelihood = -92397.459

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,492,381             Number of obs    =     381,996
No. of failures      =        7,448
Time at risk         =   1698306199
                                                Wald chi2(7)     =     6335.35
Log pseudolikelihood =   -92397.459             Prob > chi2      =      0.0000

                      (Std. Err. adjusted for 374,481 clusters in household_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
    kids_cat3 |   .7504433   .0201128   -10.71   0.000     .7120404    .7909174
         age1 |   1.151449   .0228361     7.11   0.000      1.10755    1.197088
         age2 |   .9188323   .0488906    -1.59   0.112     .8278358    1.019831
         age3 |    1.15307    .175849     0.93   0.350     .8551515    1.554777
       1.male |   1.365606   .0329549    12.91   0.000     1.302519    1.431748
              |
tot_adults_hh |
           2  |   .5981904   .0171433   -17.93   0.000     .5655164    .6327523
           3  |   .6228352   .0189061   -15.60   0.000     .5868606     .661015
-------------------------------------------------------------------------------
                                                             Stratified by stp

.                         
.                         
.         
. log close
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_non_covid_death.log
  log type:  text
 closed on:  24 Jul 2020, 13:57:56
----------------------------------------------------------------------------------------------------------------------------------
