----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_multivariableFULL_cox_models_covid_tpp_prob_or_susp.log
  log type:  text
 opened on:  24 Jul 2020, 13:43:39

. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                ///
>                         i.male                                                  ///
>                         `bmi'                                                   ///
>                         `smoking'                                               ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                                ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabetes                                              ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.organ_trans                                   ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                              ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. foreach exposure_type in        kids_cat3  {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth, replace
  6. *estat concordance /*c-statistic*/
.         /*  Proportional Hazards test  */
.         * Based on Schoenfeld residuals
.         timer clear 
  7.         timer on 1
  8.         if e(N_fail)>0 estat phtest, d
  9.         timer off 1
 10.         timer list
 11. }
 12. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 13. 
. }
   1:    171.27 /        1 =     171.2740

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,495,780             Number of obs    =     771,196
No. of failures      =      408,580
Time at risk         =   1676018127
                                                Wald chi2(37)    =    36025.08
Log pseudolikelihood =   -5292504.9             Prob > chi2      =      0.0000

                                      (Std. Err. adjusted for 721,558 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.066192   .0070571     9.68   0.000      1.05245    1.080114
               Kids under 18  |   1.029146    .009571     3.09   0.002     1.010557    1.048077
                              |
                         age1 |   1.004421   .0016001     2.77   0.006      1.00129    1.007562
                         age2 |   1.008283   .0054566     1.52   0.127     .9976443    1.019034
                         age3 |   .9263554   .0184313    -3.84   0.000      .890926    .9631938
                       1.male |   .6397329   .0033323   -85.76   0.000      .633235    .6462975
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.235537   .0093297    28.01   0.000     1.217386    1.253959
          Obese II (35-39.9)  |   1.323373   .0146619    25.29   0.000     1.294946    1.352424
             Obese III (40+)  |   1.378927   .0202078    21.93   0.000     1.339884    1.419108
                              |
                 smoke_nomiss |
                      Former  |   1.171779   .0072245    25.71   0.000     1.157705    1.186025
                     Current  |   1.135258   .0079078    18.21   0.000     1.119865    1.150863
                              |
                          imd |
                           2  |   1.071176   .0089977     8.19   0.000     1.053685    1.088957
                           3  |   1.168811   .0098683    18.48   0.000     1.149629    1.188314
                           4  |   1.222648   .0103875    23.66   0.000     1.202457    1.243178
             5 most deprived  |   1.237209   .0112463    23.42   0.000     1.215362    1.259449
                              |
           1.htdiag_or_highbp |   1.148054   .0076926    20.61   0.000     1.133075     1.16323
1.chronic_respiratory_disease |   2.409541   .0382907    55.34   0.000      2.33565    2.485771
                     1.asthma |   1.569273   .0102306    69.12   0.000     1.549349    1.589453
    1.chronic_cardiac_disease |     1.4891   .0232876    25.46   0.000      1.44415     1.53545
                   1.diabetes |   1.631915    .016711    47.83   0.000     1.599489    1.664999
                              |
            cancer_exhaem_cat |
                   Last year  |   2.427701   .1143556    18.83   0.000     2.213603    2.662506
               2-5 years ago  |    1.66246   .0471297    17.93   0.000     1.572607    1.757447
                    5+ years  |   1.246436   .0283698     9.68   0.000     1.192054    1.303298
                              |
              cancer_haem_cat |
                   Last year  |   2.894574   .3902486     7.88   0.000     2.222415    3.770026
               2-5 years ago  |   3.398654   .2636891    15.77   0.000      2.91921     3.95684
                    5+ years  |   2.177367   .1148799    14.75   0.000     1.963457    2.414581
                              |
      1.chronic_liver_disease |   1.695573   .0598154    14.97   0.000     1.582299    1.816957
            1.stroke_dementia |   1.286103   .0368662     8.78   0.000     1.215839    1.360427
                1.other_neuro |   1.831603   .0521383    21.26   0.000     1.732213    1.936697
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.215011   .0319212     7.41   0.000     1.154031    1.279215
           Stage 4/5 egfr<30  |   1.858387   .1355131     8.50   0.000     1.610894    2.143905
                              |
                1.organ_trans |   2.539936    .177425    13.34   0.000     2.214945    2.912613
                              |
                tot_adults_hh |
                           2  |   .9325764   .0064555   -10.08   0.000     .9200092    .9453152
                           3  |   .8850033   .0063006   -17.16   0.000     .8727402    .8974388
                              |
                   1.asplenia |    4.32553    .264022    23.99   0.000     3.837811    4.875229
           1.ra_sle_psoriasis |   1.526185    .018097    35.65   0.000     1.491125     1.56207
               1.other_immuno |     2.0736   .0930816    16.25   0.000     1.898959    2.264303
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_MAINFULLYADJMODEL_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_MAINFULLYADJMODEL_noeth.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.00474        24.58        1         0.0000
      2.kids_cat3 |      0.00009         0.01        1         0.9215
      age1        |     -0.00834        67.31        1         0.0000
      age2        |      0.00479        23.73        1         0.0000
      age3        |     -0.00257         7.50        1         0.0062
      0b.male     |            .            .        1             .
      1.male      |     -0.02791       823.75        1         0.0000
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00228         6.51        1         0.0107
      3.obese4cat |     -0.00202         5.98        1         0.0145
      4.obese4cat |     -0.00302        15.57        1         0.0001
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.00667        51.40        1         0.0000
      3.smoke_no~s|      0.00785        68.99        1         0.0000
      1b.imd      |            .            .        1             .
      2.imd       |      0.02934       913.37        1         0.0000
      3.imd       |      0.01070       127.71        1         0.0000
      4.imd       |      0.03026      1049.45        1         0.0000
      5.imd       |      0.03089      1148.22        1         0.0000
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.00296        11.13        1         0.0008
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.00901       201.43        1         0.0000
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.01343       242.20        1         0.0000
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.00990       205.73        1         0.0000
      0b.diabetes |            .            .        1             .
      1.diabetes  |      0.01499       395.41        1         0.0000
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.00961       262.75        1         0.0000
      3.cancer_e~t|      0.00791       118.84        1         0.0000
      4.cancer_e~t|      0.00336        18.27        1         0.0000
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.00126         6.08        1         0.0136
      3.cancer_h~t|      0.00707       174.80        1         0.0000
      4.cancer_h~t|      0.00578        93.87        1         0.0000
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.00736       150.21        1         0.0000
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.00654        95.98        1         0.0000
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00733       106.68        1         0.0000
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.00384        32.69        1         0.0000
      3.reduced_~t|      0.00433        73.12        1         0.0000
      0b.organ_t~s|            .            .        1             .
      1.organ_tr~s|      0.00865       348.86        1         0.0000
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.00600        43.50        1         0.0000
      3.tot_adul~h|     -0.00347        14.26        1         0.0002
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.00656       173.86        1         0.0000
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.01260       267.80        1         0.0000
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.00773       170.78        1         0.0000
      ------------+---------------------------------------------------
      global test |                   6681.97       37         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:    250.76 /        1 =     250.7570

. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
(0 observations deleted)

. foreach exposure_type in kids_cat3   {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth12mo, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. }       
   1:    158.92 /        1 =     158.9190

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,495,780             Number of obs    =     771,196
No. of failures      =      408,580
Time at risk         =   1676018127
                                                Wald chi2(37)    =    36025.08
Log pseudolikelihood =   -5292504.9             Prob > chi2      =      0.0000

                                      (Std. Err. adjusted for 721,558 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.066192   .0070571     9.68   0.000      1.05245    1.080114
               Kids under 18  |   1.029146    .009571     3.09   0.002     1.010557    1.048077
                              |
                         age1 |   1.004421   .0016001     2.77   0.006      1.00129    1.007562
                         age2 |   1.008283   .0054566     1.52   0.127     .9976443    1.019034
                         age3 |   .9263554   .0184313    -3.84   0.000      .890926    .9631938
                       1.male |   .6397329   .0033323   -85.76   0.000      .633235    .6462975
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.235537   .0093297    28.01   0.000     1.217386    1.253959
          Obese II (35-39.9)  |   1.323373   .0146619    25.29   0.000     1.294946    1.352424
             Obese III (40+)  |   1.378927   .0202078    21.93   0.000     1.339884    1.419108
                              |
                 smoke_nomiss |
                      Former  |   1.171779   .0072245    25.71   0.000     1.157705    1.186025
                     Current  |   1.135258   .0079078    18.21   0.000     1.119865    1.150863
                              |
                          imd |
                           2  |   1.071176   .0089977     8.19   0.000     1.053685    1.088957
                           3  |   1.168811   .0098683    18.48   0.000     1.149629    1.188314
                           4  |   1.222648   .0103875    23.66   0.000     1.202457    1.243178
             5 most deprived  |   1.237209   .0112463    23.42   0.000     1.215362    1.259449
                              |
           1.htdiag_or_highbp |   1.148054   .0076926    20.61   0.000     1.133075     1.16323
1.chronic_respiratory_disease |   2.409541   .0382907    55.34   0.000      2.33565    2.485771
                     1.asthma |   1.569273   .0102306    69.12   0.000     1.549349    1.589453
    1.chronic_cardiac_disease |     1.4891   .0232876    25.46   0.000      1.44415     1.53545
                   1.diabetes |   1.631915    .016711    47.83   0.000     1.599489    1.664999
                              |
            cancer_exhaem_cat |
                   Last year  |   2.427701   .1143556    18.83   0.000     2.213603    2.662506
               2-5 years ago  |    1.66246   .0471297    17.93   0.000     1.572607    1.757447
                    5+ years  |   1.246436   .0283698     9.68   0.000     1.192054    1.303298
                              |
              cancer_haem_cat |
                   Last year  |   2.894574   .3902486     7.88   0.000     2.222415    3.770026
               2-5 years ago  |   3.398654   .2636891    15.77   0.000      2.91921     3.95684
                    5+ years  |   2.177367   .1148799    14.75   0.000     1.963457    2.414581
                              |
      1.chronic_liver_disease |   1.695573   .0598154    14.97   0.000     1.582299    1.816957
            1.stroke_dementia |   1.286103   .0368662     8.78   0.000     1.215839    1.360427
                1.other_neuro |   1.831603   .0521383    21.26   0.000     1.732213    1.936697
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.215011   .0319212     7.41   0.000     1.154031    1.279215
           Stage 4/5 egfr<30  |   1.858387   .1355131     8.50   0.000     1.610894    2.143905
                              |
                1.organ_trans |   2.539936    .177425    13.34   0.000     2.214945    2.912613
                              |
                tot_adults_hh |
                           2  |   .9325764   .0064555   -10.08   0.000     .9200092    .9453152
                           3  |   .8850033   .0063006   -17.16   0.000     .8727402    .8974388
                              |
                   1.asplenia |    4.32553    .264022    23.99   0.000     3.837811    4.875229
           1.ra_sle_psoriasis |   1.526185    .018097    35.65   0.000     1.491125     1.56207
               1.other_immuno |     2.0736   .0930816    16.25   0.000     1.898959    2.264303
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_MAINFULLYADJMODEL_noeth12mo.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_MAINFULLYADJMODEL_noeth12mo.ster saved

. 
.  
.  
.  foreach exposure_type in       gp_number_kids {
  2. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth, replace
  6. }
  7. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
  8. }
   1:    163.10 /        1 =     163.0980

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,495,780             Number of obs    =     771,196
No. of failures      =      408,580
Time at risk         =   1676018127
                                                Wald chi2(39)    =    36036.07
Log pseudolikelihood =   -5292496.2             Prob > chi2      =      0.0000

                                      (Std. Err. adjusted for 721,558 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              only >12 years  |   1.029113   .0095707     3.09   0.002     1.010524    1.048043
                 1 child <12  |   1.057372   .0083878     7.03   0.000     1.041059     1.07394
              2 children <12  |   1.070648   .0101331     7.21   0.000     1.050971    1.090694
             3+ children <12  |   1.100852   .0168855     6.26   0.000     1.068249    1.134449
                              |
                         age1 |   1.004127   .0016049     2.58   0.010     1.000987    1.007278
                         age2 |    1.00936   .0054817     1.72   0.086     .9986728    1.020161
                         age3 |   .9228669   .0184178    -4.02   0.000     .8874656    .9596804
                       1.male |   .6397421   .0033324   -85.76   0.000     .6332441    .6463069
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.235277   .0093283    27.98   0.000     1.217129    1.253696
          Obese II (35-39.9)  |   1.323148   .0146593    25.27   0.000     1.294727    1.352194
             Obese III (40+)  |   1.378944    .020207    21.93   0.000     1.339902    1.419123
                              |
                 smoke_nomiss |
                      Former  |   1.171821   .0072252    25.72   0.000     1.157745    1.186068
                     Current  |   1.135244   .0079095    18.21   0.000     1.119847    1.150852
                              |
                          imd |
                           2  |   1.071193   .0089981     8.19   0.000     1.053701    1.088974
                           3  |   1.168765   .0098695    18.47   0.000     1.149581     1.18827
                           4  |   1.222475    .010388    23.64   0.000     1.202283    1.243005
             5 most deprived  |   1.236525   .0112479    23.34   0.000     1.214675    1.258769
                              |
           1.htdiag_or_highbp |   1.148159   .0076932    20.62   0.000      1.13318    1.163337
1.chronic_respiratory_disease |   2.409551   .0382929    55.34   0.000     2.335655    2.485785
                     1.asthma |   1.569337   .0102313    69.12   0.000     1.549411    1.589519
    1.chronic_cardiac_disease |   1.488992    .023284    25.46   0.000     1.444049    1.535335
                   1.diabetes |   1.631884   .0167096    47.83   0.000      1.59946    1.664965
                              |
            cancer_exhaem_cat |
                   Last year  |    2.42788   .1143302    18.84   0.000     2.213827     2.66263
               2-5 years ago  |   1.662574   .0471481    17.93   0.000     1.572687    1.757599
                    5+ years  |   1.246478   .0283704     9.68   0.000     1.192095    1.303342
                              |
              cancer_haem_cat |
                   Last year  |   2.892119    .389746     7.88   0.000     2.220788     3.76639
               2-5 years ago  |   3.397458   .2635594    15.77   0.000     2.918245    3.955364
                    5+ years  |   2.177245   .1148596    14.75   0.000     1.963372    2.414416
                              |
      1.chronic_liver_disease |   1.695151    .059795    14.96   0.000     1.581914    1.816493
            1.stroke_dementia |   1.286053    .036867     8.78   0.000     1.215787    1.360379
                1.other_neuro |   1.831982   .0521456    21.27   0.000     1.732577     1.93709
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.214818   .0319153     7.41   0.000     1.153849    1.279009
           Stage 4/5 egfr<30  |   1.857536   .1355447     8.49   0.000     1.609997    2.143135
                              |
                1.organ_trans |    2.54135    .177504    13.35   0.000     2.216211     2.91419
                              |
                tot_adults_hh |
                           2  |   .9320926   .0064563   -10.15   0.000     .9195241     .944833
                           3  |   .8847266   .0062993   -17.20   0.000      .872466    .8971595
                              |
                   1.asplenia |   4.324408   .2640552    23.98   0.000     3.836639    4.874189
           1.ra_sle_psoriasis |   1.526293   .0180969    35.66   0.000     1.491233    1.562178
               1.other_immuno |   2.074202   .0931086    16.25   0.000      1.89951     2.26496
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_MAINFULLYADJMODEL_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_MAINFULLYADJMODEL_noeth.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\analyses\school-age-children-and-covid\analysis\log\an_multivariableFULL_cox_models_covid_tpp_prob_or_susp.log
  log type:  text
 closed on:  24 Jul 2020, 13:56:22
----------------------------------------------------------------------------------------------------------------------------------
