-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivar
> iableDEMOG_cox_models_covid_tpp_prob_or_susp.log
  log type:  text
 opened on:  16 Jul 2020, 09:58:30

. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string
> )] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                                  
>       ///
>                         i.male                                               
>    ///
>                         `bmi'                                   ///
>                         `smoking'                                       ///
>                         `ethnicity'                                          
>    ///
>                         i.imd                                                
>    ///
>                         i.tot_people_hh                         ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_size)
  7. timer off 1
  8. timer list
  9. end

. *****************************************************************************
> ********
. foreach exposure_type in kids_cat3  ///
>                 gp_number_kids {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_DEMOGADJ_noeth, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 1) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  9. if _rc==0{
 10. estimates
 11. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_DEMOGADJ_CCeth, replace
 12. *estat concordance /*c-statistic*/
.  }
 13.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `
> outcome')"
 14. 
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 1) bmi(i.bmicat) smoking(i.smoke)
 15. if _rc==0{
 16. estimates
 17. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_DEMOGADJ_CCeth_bmi_smok, replace
 18. *estat concordance /*c-statistic*/
.  }
 19.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCO
> ME `outcome')" 
 20.  
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 0) bmi(i.bmicat) smoking(i.smoke)
 21. if _rc==0{
 22. estimates
 23. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_DEMOGADJ_CCnoeth_bmi_smok, replace
 24. *estat concordance /*c-statistic*/
.  }
 25.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `o
> utcome')" 
 26.  
. }
   1:   2014.17 /        1 =    2014.1660

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,074,725             Number of obs    =  16,074,725
No. of failures      =      629,074
Time at risk         =   2147775808
                                                Wald chi2(9)     =   718465.90
Log pseudolikelihood =   -8348064.1             Prob > chi2      =      0.0000

                        (Std. Err. adjusted for 10 clusters in household_size)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.076675   .0265614     2.99   0.003     1.025854    1.130013
Kids unde..  |   1.052095   .0312196     1.71   0.087      .992651    1.115099
             |
        age1 |   1.009191    .003561     2.59   0.010     1.002235    1.016194
        age2 |   1.000178   .0133322     0.01   0.989     .9743859    1.026653
        age3 |   1.046891   .0437355     1.10   0.273     .9645865    1.136218
      1.male |   .7580556    .034642    -6.06   0.000     .6931104    .8290862
             |
   obese4cat |
Obese I ..)  |   1.296079    .022686    14.82   0.000     1.252369    1.341314
Obese II..)  |   1.505852   .0213298    28.90   0.000     1.464621    1.548243
Obese II..)  |   1.779902   .0198194    51.78   0.000     1.741477    1.819174
             |
smoke_nomiss |
     Former  |   1.319687   .0146432    25.00   0.000     1.291296    1.348701
    Current  |   1.297228   .0393122     8.59   0.000     1.222422    1.376613
             |
         imd |
          2  |     1.0699    .005643    12.81   0.000     1.058897    1.081017
          3  |   1.163671   .0123253    14.31   0.000     1.139763     1.18808
          4  |   1.254069   .0080848    35.12   0.000     1.238322    1.270015
5 most de..  |   1.323596   .0187057    19.84   0.000     1.287437    1.360771
             |
tot_people~h |
          2  |   .9671685   .0079723    -4.05   0.000     .9516686    .9829209
          3  |   .9630449   .0132301    -2.74   0.006     .9374604    .9893276
          4  |   .9448751   .0199092    -2.69   0.007     .9066486    .9847134
          5  |   .9144519    .028741    -2.85   0.004     .8598206    .9725543
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat
> 3_DEMOGADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOG
> ADJ_noeth.ster saved
   1:   1740.90 /        1 =    1740.9010

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,174,634             Number of obs    =  12,174,634
No. of failures      =      493,240
Time at risk         =   1625832154
                                                Wald chi2(9)     =   383037.25
Log pseudolikelihood =   -6418010.2             Prob > chi2      =      0.0000

                        (Std. Err. adjusted for 10 clusters in household_size)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.052066   .0265503     2.01   0.044     1.001295    1.105412
Kids unde..  |    1.04826   .0323972     1.53   0.127     .9866477     1.11372
             |
        age1 |   1.009435   .0037126     2.55   0.011     1.002185    1.016738
        age2 |   1.000881   .0129392     0.07   0.946     .9758397    1.026566
        age3 |   1.044476   .0416666     1.09   0.275     .9659221    1.129419
      1.male |   .7634482   .0327943    -6.28   0.000      .701804    .8305071
             |
   obese4cat |
Obese I ..)  |   1.270754   .0196215    15.52   0.000     1.232873    1.309799
Obese II..)  |   1.488509   .0180712    32.76   0.000     1.453509    1.524353
Obese II..)  |   1.776966   .0228204    44.77   0.000     1.732797     1.82226
             |
smoke_nomiss |
     Former  |    1.29855   .0113676    29.84   0.000      1.27646    1.321022
    Current  |   1.296054   .0387894     8.66   0.000     1.222215    1.374354
             |
   ethnicity |
      Mixed  |   1.033952    .028119     1.23   0.220     .9802831     1.09056
Asian or ..  |   1.168511   .0274023     6.64   0.000     1.116019    1.223472
      Black  |   1.149106   .0139803    11.42   0.000     1.122029    1.176836
      Other  |    .779023   .0329709    -5.90   0.000     .7170089    .8464007
             |
         imd |
          2  |   1.064994   .0063027    10.64   0.000     1.052712    1.077419
          3  |   1.159139   .0086516    19.79   0.000     1.142306    1.176221
          4  |   1.250183   .0078144    35.72   0.000     1.234961    1.265594
5 most de..  |   1.312089   .0261615    13.62   0.000     1.261803     1.36438
             |
tot_people~h |
          2  |   .9573627   .0071097    -5.87   0.000     .9435287    .9713994
          3  |   .9695476   .0119803    -2.50   0.012     .9463488    .9933152
          4  |   .9474599     .01961    -2.61   0.009     .9097942    .9866849
          5  |   .9009131   .0312315    -3.01   0.003     .8417337    .9642532
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat
> 3_DEMOGADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOG
> ADJ_CCeth.ster saved
   1:   1580.34 /        1 =    1580.3380

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   10,271,116             Number of obs    =  10,271,116
No. of failures      =      453,472
Time at risk         =   1369376235
                                                Wald chi2(9)     =    35937.11
Log pseudolikelihood =     -5833282             Prob > chi2      =      0.0000

                        (Std. Err. adjusted for 10 clusters in household_size)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.026977   .0230947     1.18   0.237     .9826957    1.073254
Kids unde..  |   1.049462    .032768     1.55   0.122     .9871639    1.115692
             |
        age1 |   1.001997   .0041244     0.48   0.628     .9939453    1.010113
        age2 |   1.013602   .0131807     1.04   0.299     .9880947    1.039768
        age3 |   1.018496   .0390748     0.48   0.633     .9447191    1.098034
      1.male |   .7983295   .0310765    -5.79   0.000     .7396862     .861622
             |
      bmicat |
Normal (..)  |   .8275777   .0179772    -8.71   0.000     .7930826    .8635732
Overweig..)  |   .8883817   .0285773    -3.68   0.000     .8341003    .9461956
Obese I ..)  |   1.043434   .0370405     1.20   0.231     .9733042    1.118617
Obese II..)  |   1.223996   .0392367     6.31   0.000      1.14946    1.303366
Obese II..)  |   1.460718   .0473351    11.69   0.000     1.370828    1.556503
             |
       smoke |
     Former  |   1.264336   .0146413    20.25   0.000     1.235962     1.29336
    Current  |   1.285761   .0412611     7.83   0.000     1.207382    1.369229
             |
   ethnicity |
      Mixed  |   1.043874    .029897     1.50   0.134     .9868908    1.104146
Asian or ..  |   1.172256   .0257963     7.22   0.000     1.122771    1.223922
      Black  |   1.166104   .0155311    11.54   0.000     1.136058    1.196945
      Other  |   .8153677   .0328098    -5.07   0.000     .7535321    .8822775
             |
         imd |
          2  |   1.070263   .0076284     9.53   0.000     1.055416    1.085319
          3  |   1.164486   .0101117    17.54   0.000     1.144835    1.184474
          4  |    1.25913   .0075828    38.26   0.000     1.244355     1.27408
5 most de..  |   1.331349   .0213179    17.87   0.000     1.290215    1.373794
             |
tot_people~h |
          2  |   .9512208   .0068163    -6.98   0.000     .9379545    .9646747
          3  |   .9708826   .0113194    -2.53   0.011     .9489485    .9933237
          4  |    .957833   .0192816    -2.14   0.032     .9207775    .9963797
          5  |   .9296833   .0283863    -2.39   0.017     .8756792     .987018
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat
> 3_DEMOGADJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOG
> ADJ_CCeth_bmi_smok.ster saved
   1:   1675.38 /        1 =    1675.3800

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,626,021             Number of obs    =  12,626,021
No. of failures      =      562,002
Time at risk         =   1682879705
                                                Wald chi2(9)     =   297863.87
Log pseudolikelihood =   -7339402.1             Prob > chi2      =      0.0000

                        (Std. Err. adjusted for 10 clusters in household_size)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.028531   .0203828     1.42   0.156     .9893478    1.069267
Kids unde..  |   1.046246    .031031     1.52   0.127     .9871606    1.108868
             |
        age1 |   1.001856   .0035816     0.52   0.604     .9948607      1.0089
        age2 |   1.012757   .0131542     0.98   0.329     .9873006     1.03887
        age3 |   1.019953   .0407267     0.49   0.621     .9431736    1.102982
      1.male |   .8098907     .03047    -5.60   0.000     .7523192    .8718679
             |
      bmicat |
Normal (..)  |   .8286349   .0160057    -9.73   0.000     .7978507     .860607
Overweig..)  |   .8829677   .0283925    -3.87   0.000     .8290367    .9404071
Obese I ..)  |   1.025411   .0356017     0.72   0.470     .9579547    1.097618
Obese II..)  |   1.194452   .0382702     5.55   0.000      1.12175    1.271866
Obese II..)  |   1.412259   .0408551    11.93   0.000     1.334413    1.494647
             |
       smoke |
     Former  |   1.257334   .0186593    15.43   0.000     1.221289    1.294442
    Current  |   1.270153    .042349     7.17   0.000     1.189804    1.355927
             |
         imd |
          2  |   1.076551    .008068     9.84   0.000     1.060853     1.09248
          3  |     1.1711   .0132097    14.00   0.000     1.145493    1.197279
          4  |   1.267557    .009645    31.16   0.000     1.248793    1.286602
5 most de..  |   1.350899   .0131145    30.98   0.000     1.325438    1.376849
             |
tot_people~h |
          2  |   .9583317   .0075564    -5.40   0.000     .9436354     .973257
          3  |   .9729246   .0119938    -2.23   0.026      .949699    .9967182
          4  |   .9657574   .0189824    -1.77   0.076     .9292601    1.003688
          5  |   .9605749   .0250466    -1.54   0.123     .9127176    1.010941
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat
> 3_DEMOGADJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOG
> ADJ_CCnoeth_bmi_smok.ster saved
   1:   2037.13 /        1 =    2037.1330

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,074,725             Number of obs    =  16,074,725
No. of failures      =      629,074
Time at risk         =   2147775808
                                                Wald chi2(9)     =  1861331.12
Log pseudolikelihood =   -8348051.6             Prob > chi2      =      0.0000

                        (Std. Err. adjusted for 10 clusters in household_size)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
only >12 ..  |   1.054358   .0303883     1.84   0.066     .9964491    1.115632
1 child <12  |   1.066898   .0325466     2.12   0.034     1.004977    1.132633
2 childre..  |   1.089037   .0328219     2.83   0.005     1.026571    1.155305
3+ childr..  |   1.117099   .0326592     3.79   0.000     1.054888    1.182979
             |
        age1 |   1.008964   .0036469     2.47   0.014     1.001841    1.016137
        age2 |   1.000838   .0136519     0.06   0.951     .9744354    1.027956
        age3 |   1.045094   .0444817     1.04   0.300     .9614488    1.136016
      1.male |   .7581809   .0344488    -6.09   0.000     .6935815    .8287969
             |
   obese4cat |
Obese I ..)  |   1.295924   .0225235    14.91   0.000     1.252523     1.34083
Obese II..)  |   1.505726   .0212227    29.04   0.000       1.4647    1.547902
Obese II..)  |   1.779879   .0198275    51.76   0.000     1.741439    1.819168
             |
smoke_nomiss |
     Former  |   1.319477   .0148647    24.61   0.000     1.290662    1.348936
    Current  |   1.297263    .039277     8.60   0.000     1.222521    1.376574
             |
         imd |
          2  |   1.069984   .0057292    12.63   0.000     1.058814    1.081272
          3  |   1.163836   .0125352    14.09   0.000     1.139525    1.188666
          4  |   1.254267   .0082144    34.59   0.000      1.23827    1.270471
5 most de..  |   1.323612   .0187018    19.84   0.000      1.28746    1.360779
             |
tot_people~h |
          2  |   .9674153   .0078607    -4.08   0.000     .9521308    .9829453
          3  |   .9642407   .0140047    -2.51   0.012     .9371789    .9920838
          4  |   .9432906   .0201013    -2.74   0.006     .9047042    .9835227
          5  |   .9084659   .0282329    -3.09   0.002      .854782    .9655214
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_numbe
> r_kids_DEMOGADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_
> DEMOGADJ_noeth.ster saved
   1:   1788.21 /        1 =    1788.2150

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,174,634             Number of obs    =  12,174,634
No. of failures      =      493,240
Time at risk         =   1625832154
                                                Wald chi2(9)     =    18565.44
Log pseudolikelihood =   -6418002.2             Prob > chi2      =      0.0000

                                   (Std. Err. adjusted for 10 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |   1.050274   .0312514     1.65   0.099      .990774    1.113347
           1 child <12  |   1.044358    .033606     1.35   0.177     .9805252    1.112345
        2 children <12  |   1.060439   .0280075     2.22   0.026     1.006942    1.116778
       3+ children <12  |   1.089448   .0290766     3.21   0.001     1.033923    1.147954
                        |
                   age1 |   1.009247   .0038307     2.43   0.015     1.001767    1.016783
                   age2 |    1.00144   .0133459     0.11   0.914      .975621    1.027942
                   age3 |   1.042947   .0426461     1.03   0.304     .9626239    1.129973
                 1.male |   .7635637   .0326127    -6.32   0.000     .7022464    .8302351
                        |
              obese4cat |
     Obese I (30-34.9)  |   1.270626   .0194855    15.62   0.000     1.233003    1.309396
    Obese II (35-39.9)  |   1.488402   .0179942    32.90   0.000     1.453549    1.524091
       Obese III (40+)  |   1.776934    .022823    44.76   0.000      1.73276    1.822234
                        |
           smoke_nomiss |
                Former  |   1.298395   .0115398    29.38   0.000     1.275973    1.321211
               Current  |   1.296109   .0387194     8.68   0.000       1.2224    1.374264
                        |
              ethnicity |
                 Mixed  |   1.033987   .0281788     1.23   0.220     .9802066    1.090718
Asian or Asian British  |   1.168829   .0276488     6.59   0.000     1.115876    1.224296
                 Black  |   1.148784   .0138008    11.55   0.000     1.122051    1.176154
                 Other  |   .7791713   .0330771    -5.88   0.000     .7169651    .8467748
                        |
                    imd |
                     2  |    1.06507   .0063654    10.55   0.000     1.052667    1.077619
                     3  |   1.159288   .0088397    19.38   0.000     1.142092    1.176744
                     4  |   1.250361   .0076999    36.28   0.000      1.23536    1.265544
       5 most deprived  |   1.312083      .0261    13.65   0.000     1.261912    1.364248
                        |
          tot_people_hh |
                     2  |   .9575665   .0069587    -5.97   0.000     .9440243     .971303
                     3  |   .9706792   .0129661    -2.23   0.026     .9455959     .996428
                     4  |   .9462751   .0192706    -2.71   0.007     .9092493    .9848086
                     5  |   .8952689   .0304235    -3.26   0.001     .8375823    .9569285
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_CCeth.ster saved
   1:   1604.37 /        1 =    1604.3680

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   10,271,116             Number of obs    =  10,271,116
No. of failures      =      453,472
Time at risk         =   1369376235
                                                Wald chi2(9)     =    29101.99
Log pseudolikelihood =   -5833281.4             Prob > chi2      =      0.0000

                                   (Std. Err. adjusted for 10 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |   1.049719   .0313064     1.63   0.104     .9901182    1.112907
           1 child <12  |   1.026651   .0286538     0.94   0.346     .9719985    1.084375
        2 children <12  |   1.025039   .0227129     1.12   0.264     .9814757    1.070537
       3+ children <12  |   1.038328   .0233695     1.67   0.095     .9935202    1.085156
                        |
                   age1 |   1.001981   .0042625     0.47   0.642     .9936612     1.01037
                   age2 |   1.013658   .0136566     1.01   0.314      .987242    1.040781
                   age3 |    1.01834   .0402946     0.46   0.646     .9423491     1.10046
                 1.male |   .7983565   .0309844    -5.80   0.000     .7398805    .8614542
                        |
                 bmicat |
    Normal (18.5-24.9)  |   .8275576   .0178945    -8.75   0.000     .7932179     .863384
  Overweight (25-29.9)  |   .8883355   .0284167    -3.70   0.000     .8343499    .9458142
     Obese I (30-34.9)  |    1.04337   .0368627     1.20   0.229      .973565     1.11818
    Obese II (35-39.9)  |   1.223916   .0390691     6.33   0.000     1.149688    1.302936
       Obese III (40+)  |   1.460624    .047164    11.73   0.000     1.371048    1.556051
                        |
                  smoke |
                Former  |   1.264311   .0147366    20.12   0.000     1.235755    1.293527
               Current  |   1.285728    .041195     7.84   0.000     1.207471    1.369058
                        |
              ethnicity |
                 Mixed  |   1.043857   .0299106     1.50   0.134     .9868495    1.104159
Asian or Asian British  |   1.172282   .0259392     7.18   0.000     1.122528     1.22424
                 Black  |    1.16596     .01533    11.68   0.000     1.136297    1.196397
                 Other  |   .8153813   .0328325    -5.07   0.000     .7535046    .8823391
                        |
                    imd |
                     2  |   1.070267   .0076682     9.48   0.000     1.055342    1.085402
                     3  |    1.16449   .0102441    17.31   0.000     1.144584    1.184742
                     4  |   1.259122   .0076937    37.71   0.000     1.244133    1.274292
       5 most deprived  |   1.331262   .0213732    17.82   0.000     1.290024    1.373819
                        |
          tot_people_hh |
                     2  |   .9512187   .0066745    -7.13   0.000     .9382263    .9643909
                     3  |   .9710359   .0119084    -2.40   0.017     .9479742    .9946586
                     4  |   .9582112   .0180317    -2.27   0.023     .9235136    .9942124
                     5  |   .9282905   .0261887    -2.64   0.008     .8783549     .981065
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:   1762.32 /        1 =    1762.3220

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,626,021             Number of obs    =  12,626,021
No. of failures      =      562,002
Time at risk         =   1682879705
                                                Wald chi2(9)     =   311660.66
Log pseudolikelihood =   -7339401.6             Prob > chi2      =      0.0000

                                 (Std. Err. adjusted for 10 clusters in household_size)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
       gp_number_kids |
      only >12 years  |   1.046456   .0297361     1.60   0.110     .9897675    1.106391
         1 child <12  |   1.028214   .0253256     1.13   0.259      .979756    1.079069
      2 children <12  |   1.027108   .0231797     1.19   0.236     .9826665    1.073559
     3+ children <12  |   1.037637   .0242763     1.58   0.114     .9911304    1.086325
                      |
                 age1 |   1.001842   .0037391     0.49   0.622     .9945401    1.009197
                 age2 |   1.012805   .0136219     0.95   0.344     .9864556    1.039858
                 age3 |   1.019821   .0418719     0.48   0.633     .9409692    1.105281
               1.male |   .8099107   .0303858    -5.62   0.000     .7524925    .8717101
                      |
               bmicat |
  Normal (18.5-24.9)  |   .8286179   .0159158    -9.79   0.000     .7980033    .8604069
Overweight (25-29.9)  |   .8829307   .0282368    -3.89   0.000     .8292864    .9400452
   Obese I (30-34.9)  |   1.025362   .0354335     0.72   0.469     .9582128    1.097216
  Obese II (35-39.9)  |   1.194391   .0381091     5.57   0.000     1.121986    1.271469
     Obese III (40+)  |   1.412188   .0407095    11.97   0.000     1.334611    1.494274
                      |
                smoke |
              Former  |   1.257315    .018766    15.34   0.000     1.221067    1.294639
             Current  |   1.270128   .0423055     7.18   0.000     1.189859    1.355812
                      |
                  imd |
                   2  |   1.076554   .0081151     9.79   0.000     1.060765    1.092577
                   3  |   1.171102   .0133214    13.89   0.000     1.145282    1.197505
                   4  |    1.26755   .0098138    30.62   0.000      1.24846    1.286931
     5 most deprived  |   1.350827   .0131896    30.80   0.000     1.325222    1.376928
                      |
        tot_people_hh |
                   2  |   .9583322   .0074534    -5.47   0.000     .9438346    .9730524
                   3  |   .9730465   .0124117    -2.14   0.032     .9490217    .9976795
                   4  |   .9660194     .01809    -1.85   0.065     .9312064    1.002134
                   5  |    .959458   .0227201    -1.75   0.081      .915945    1.005038
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster saved

. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
(0 observations deleted)

. foreach exposure_type in kids_cat3   {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_12mo, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
  8. 
. }
   1:   1890.21 /        1 =    1890.2070

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,074,725             Number of obs    =  16,074,725
No. of failures      =      629,074
Time at risk         =   2147775808
                                                Wald chi2(9)     =   718465.90
Log pseudolikelihood =   -8348064.1             Prob > chi2      =      0.0000

                               (Std. Err. adjusted for 10 clusters in household_size)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   1.076675   .0265614     2.99   0.003     1.025854    1.130013
     Kids under 18  |   1.052095   .0312196     1.71   0.087      .992651    1.115099
                    |
               age1 |   1.009191    .003561     2.59   0.010     1.002235    1.016194
               age2 |   1.000178   .0133322     0.01   0.989     .9743859    1.026653
               age3 |   1.046891   .0437355     1.10   0.273     .9645865    1.136218
             1.male |   .7580556    .034642    -6.06   0.000     .6931104    .8290862
                    |
          obese4cat |
 Obese I (30-34.9)  |   1.296079    .022686    14.82   0.000     1.252369    1.341314
Obese II (35-39.9)  |   1.505852   .0213298    28.90   0.000     1.464621    1.548243
   Obese III (40+)  |   1.779902   .0198194    51.78   0.000     1.741477    1.819174
                    |
       smoke_nomiss |
            Former  |   1.319687   .0146432    25.00   0.000     1.291296    1.348701
           Current  |   1.297228   .0393122     8.59   0.000     1.222422    1.376613
                    |
                imd |
                 2  |     1.0699    .005643    12.81   0.000     1.058897    1.081017
                 3  |   1.163671   .0123253    14.31   0.000     1.139763     1.18808
                 4  |   1.254069   .0080848    35.12   0.000     1.238322    1.270015
   5 most deprived  |   1.323596   .0187057    19.84   0.000     1.287437    1.360771
                    |
      tot_people_hh |
                 2  |   .9671685   .0079723    -4.05   0.000     .9516686    .9829209
                 3  |   .9630449   .0132301    -2.74   0.006     .9374604    .9893276
                 4  |   .9448751   .0199092    -2.69   0.007     .9066486    .9847134
                 5  |   .9144519    .028741    -2.85   0.004     .8598206    .9725543
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOGADJ_noeth_12mo.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_or_susp_kids_cat3_DEMOGADJ_noeth_12mo.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_covid_tpp_prob_or_susp.log
  log type:  text
 closed on:  16 Jul 2020, 14:27:34
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
