-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivar
> iableDEMOG_cox_models_covid_death_itu.log
  log type:  text
 opened on:  16 Jul 2020, 09:58:30

. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string
> )] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                                  
>       ///
>                         i.male                                               
>    ///
>                         `bmi'                                   ///
>                         `smoking'                                       ///
>                         `ethnicity'                                          
>    ///
>                         i.imd                                                
>    ///
>                         i.tot_people_hh                         ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_size)
  7. timer off 1
  8. timer list
  9. end

. *****************************************************************************
> ********
. foreach exposure_type in kids_cat3  ///
>                 gp_number_kids {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_DEMOGADJ_noeth, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 1) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  9. if _rc==0{
 10. estimates
 11. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_DEMOGADJ_CCeth, replace
 12. *estat concordance /*c-statistic*/
.  }
 13.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `
> outcome')"
 14. 
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 1) bmi(i.bmicat) smoking(i.smoke)
 15. if _rc==0{
 16. estimates
 17. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_DEMOGADJ_CCeth_bmi_smok, replace
 18. *estat concordance /*c-statistic*/
.  }
 19.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCO
> ME `outcome')" 
 20.  
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 0) bmi(i.bmicat) smoking(i.smoke)
 21. if _rc==0{
 22. estimates
 23. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_DEMOGADJ_CCnoeth_bmi_smok, replace
 24. *estat concordance /*c-statistic*/
.  }
 25.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `o
> utcome')" 
 26.  
. }
   1:   4427.91 /        1 =    4427.9060

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,074,725             Number of obs    =  16,074,725
No. of failures      =       49,005
Time at risk         =   2181876321
                                                Wald chi2(9)     =    34622.63
Log pseudolikelihood =    -587547.5             Prob > chi2      =      0.0000

                        (Std. Err. adjusted for 10 clusters in household_size)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |    .454396   .0849128    -4.22   0.000     .3150437    .6553875
Kids unde..  |   .5476649   .0881279    -3.74   0.000     .3995242    .7507349
             |
        age1 |   1.210935   .0510756     4.54   0.000     1.114855    1.315296
        age2 |   .7910602   .0833191    -2.23   0.026      .643511    .9724406
        age3 |   1.790002   .4371136     2.38   0.017     1.109156    2.888781
      1.male |   1.374165   .0904063     4.83   0.000     1.207921     1.56329
             |
   obese4cat |
Obese I ..)  |   .8656937   .0128661    -9.70   0.000     .8408403    .8912817
Obese II..)  |   1.086683   .0076156    11.86   0.000     1.071859    1.101713
Obese II..)  |   1.595867   .0239674    31.12   0.000     1.549576     1.64354
             |
smoke_nomiss |
     Former  |    1.39689   .0307382    15.19   0.000     1.337925    1.458454
    Current  |   2.308538   .1118238    17.27   0.000      2.09945     2.53845
             |
         imd |
          2  |   1.102699   .0237209     4.54   0.000     1.057173    1.150185
          3  |   1.216372   .0356913     6.68   0.000     1.148391    1.288376
          4  |   1.342401   .0597704     6.61   0.000     1.230219    1.464812
5 most de..  |   1.598833   .0950099     7.90   0.000     1.423052    1.796327
             |
tot_people~h |
          2  |   .8953708   .0344832    -2.87   0.004     .8302728    .9655729
          3  |    1.14762   .0623681     2.53   0.011     1.031666    1.276607
          4  |   1.398804   .0910058     5.16   0.000      1.23134    1.589043
          5  |   2.447588   .3785413     5.79   0.000     1.807558    3.314242
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_itu_kids_cat3_DEMOG
> ADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_death_itu_kids_cat3_DEMOGADJ_noe
> th.ster saved
   1:   4030.12 /        1 =    4030.1200

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,174,634             Number of obs    =  12,174,634
No. of failures      =       35,237
Time at risk         =   1652654047
                                                Wald chi2(9)     =     1856.91
Log pseudolikelihood =   -413287.55             Prob > chi2      =      0.0000

                        (Std. Err. adjusted for 10 clusters in household_size)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .4670129   .0785087    -4.53   0.000     .3359192    .6492664
Kids unde..  |   .5453617   .0812145    -4.07   0.000     .4073098    .7302044
             |
        age1 |   1.229928   .0547855     4.65   0.000     1.127104    1.342132
        age2 |   .7612393   .0850467    -2.44   0.015     .6115385     .947586
        age3 |   1.964761   .5114433     2.59   0.009     1.179601    3.272536
      1.male |   1.419772   .0850052     5.85   0.000     1.262569    1.596549
             |
   obese4cat |
Obese I ..)  |    .862037   .0109041   -11.74   0.000     .8409282    .8836757
Obese II..)  |   1.092917   .0194879     4.98   0.000     1.055382    1.131788
Obese II..)  |   1.588796   .0264705    27.79   0.000     1.537753    1.641533
             |
smoke_nomiss |
     Former  |   1.391654   .0420905    10.93   0.000     1.311555    1.476644
    Current  |   2.299397   .1375524    13.92   0.000     2.045004    2.585435
             |
   ethnicity |
      Mixed  |   .9123294   .0928094    -0.90   0.367     .7474131    1.113634
Asian or ..  |   .8739497   .0717914    -1.64   0.101     .7439842    1.026619
      Black  |   .9915285   .0410645    -0.21   0.837     .9142234     1.07537
      Other  |   .7635499   .0718772    -2.87   0.004     .6349055    .9182602
             |
         imd |
          2  |   1.127061   .0179653     7.50   0.000     1.092394    1.162828
          3  |   1.228771   .0371804     6.81   0.000     1.158017    1.303847
          4  |   1.369084    .062531     6.88   0.000     1.251851    1.497296
5 most de..  |   1.641787   .1039742     7.83   0.000     1.450141     1.85876
             |
tot_people~h |
          2  |    .883011   .0319886    -3.43   0.001     .8224885     .947987
          3  |   1.159301   .0607944     2.82   0.005     1.046065    1.284794
          4  |   1.422396   .0939241     5.34   0.000     1.249723    1.618927
          5  |    2.45541   .3733253     5.91   0.000      1.82266    3.307823
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_itu_kids_cat3_DEMOG
> ADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_covid_death_itu_kids_cat3_DEMOGADJ_CCe
> th.ster saved
   1:   3698.23 /        1 =    3698.2340

-----------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   10,271,116             Number of obs    =  10,271,116
No. of failures      =       32,370
Time at risk         =   1394024684
                                                Wald chi2(9)     =     1604.39
Log pseudolikelihood =   -375618.02             Prob > chi2      =      0.0000

                                   (Std. Err. adjusted for 10 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              kids_cat3 |
         Kids under 12  |   .5012307   .0805198    -4.30   0.000      .365845    .6867176
         Kids under 18  |   .5540361   .0837766    -3.91   0.000     .4119331    .7451599
                        |
                   age1 |   1.259378   .0452726     6.42   0.000     1.173699    1.351311
                   age2 |   .7272146   .0683749    -3.39   0.001     .6048256    .8743697
                   age3 |    2.14873   .4769678     3.45   0.001     1.390705    3.319928
                 1.male |   1.553283   .0845289     8.09   0.000     1.396139    1.728115
                        |
                 bmicat |
    Normal (18.5-24.9)  |   .4121226   .0188501   -19.38   0.000     .3767847    .4507749
  Overweight (25-29.9)  |    .281252   .0151678   -23.52   0.000     .2530408    .3126084
     Obese I (30-34.9)  |   .3122929    .020059   -18.12   0.000      .275352    .3541898
    Obese II (35-39.9)  |   .3968923   .0248344   -14.77   0.000     .3510842    .4486774
       Obese III (40+)  |   .5762378   .0249386   -12.74   0.000     .5293747    .6272494
                        |
                  smoke |
                Former  |   1.406198   .0421587    11.37   0.000     1.325949    1.491303
               Current  |   2.142474   .1186003    13.76   0.000     1.922188    2.388006
                        |
              ethnicity |
                 Mixed  |   .9413303   .0766785    -0.74   0.458     .8024265    1.104279
Asian or Asian British  |   .8779627   .0685595    -1.67   0.096     .7533666    1.023165
                 Black  |   1.044693   .0436515     1.05   0.295     .9625473    1.133849
                 Other  |   .7868866   .0708491    -2.66   0.008     .6595873    .9387544
                        |
                    imd |
                     2  |   1.126687   .0176855     7.60   0.000     1.092552    1.161889
                     3  |   1.226055   .0380258     6.57   0.000     1.153746    1.302896
                     4  |   1.364018   .0618675     6.84   0.000     1.247993    1.490829
       5 most deprived  |   1.631062   .1080656     7.38   0.000     1.432434    1.857234
                        |
          tot_people_hh |
                     2  |   .8917782   .0311458    -3.28   0.001     .8327759    .9549607
                     3  |   1.162193   .0576813     3.03   0.002     1.054464    1.280927
                     4  |   1.434644    .088027     5.88   0.000     1.272085    1.617976
                     5  |    2.39106   .3308529     6.30   0.000     1.823094     3.13597
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_itu_kids_cat3_DEMOGADJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_death_itu_kids_cat3_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:   3768.24 /        1 =    3768.2380

-----------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,626,021             Number of obs    =  12,626,021
No. of failures      =       43,523
Time at risk         =   1713322172
                                                Wald chi2(9)     =     3675.85
Log pseudolikelihood =   -514589.52             Prob > chi2      =      0.0000

                                 (Std. Err. adjusted for 10 clusters in household_size)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
            kids_cat3 |
       Kids under 12  |   .4873328   .0865153    -4.05   0.000     .3441227    .6901411
       Kids under 18  |   .5604835    .090748    -3.58   0.000     .4080794    .7698055
                      |
                 age1 |   1.244255   .0461218     5.90   0.000     1.157064    1.338017
                 age2 |   .7493822   .0718158    -3.01   0.003     .6210546    .9042258
                 age3 |   1.994828   .4480811     3.07   0.002     1.284421    3.098158
               1.male |   1.514925   .0893651     7.04   0.000     1.349519    1.700605
                      |
               bmicat |
  Normal (18.5-24.9)  |   .4147294   .0219587   -16.62   0.000      .373849    .4600801
Overweight (25-29.9)  |   .2834569   .0189061   -18.90   0.000     .2487215    .3230434
   Obese I (30-34.9)  |   .3127963   .0232714   -15.62   0.000     .2703547    .3619006
  Obese II (35-39.9)  |   .3928603   .0247923   -14.80   0.000     .3471532    .4445853
     Obese III (40+)  |   .5756183   .0279594   -11.37   0.000     .5233464     .633111
                      |
                smoke |
              Former  |   1.404129   .0345772    13.78   0.000     1.337968    1.473561
             Current  |   2.151181   .1001494    16.45   0.000     1.963581    2.356705
                      |
                  imd |
                   2  |   1.100885   .0216278     4.89   0.000     1.059301    1.144101
                   3  |   1.216591   .0345982     6.89   0.000     1.150634    1.286327
                   4  |   1.339892      .0598     6.56   0.000     1.227666    1.462377
     5 most deprived  |   1.595947   .1011181     7.38   0.000     1.409571    1.806966
                      |
        tot_people_hh |
                   2  |   .9006222   .0336128    -2.80   0.005     .8370941    .9689715
                   3  |   1.163634   .0600874     2.93   0.003     1.051628    1.287569
                   4  |   1.431079   .0863493     5.94   0.000     1.271462    1.610734
                   5  |   2.412374   .3360573     6.32   0.000     1.835978    3.169727
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_itu_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_death_itu_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok.ster saved
   1:   4420.81 /        1 =    4420.8050

-----------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,074,725             Number of obs    =  16,074,725
No. of failures      =       49,005
Time at risk         =   2181876321
                                                Wald chi2(9)     =    28934.78
Log pseudolikelihood =   -587531.26             Prob > chi2      =      0.0000

                               (Std. Err. adjusted for 10 clusters in household_size)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
     gp_number_kids |
    only >12 years  |   .5455773   .0869592    -3.80   0.000     .3991939    .7456391
       1 child <12  |   .5096567   .0892943    -3.85   0.000     .3615291     .718476
    2 children <12  |    .391349   .0756364    -4.85   0.000     .2679488    .5715796
   3+ children <12  |   .3606752   .0686431    -5.36   0.000     .2483803    .5237396
                    |
               age1 |   1.209315   .0510009     4.51   0.000     1.113374    1.313522
               age2 |   .7928339   .0832033    -2.21   0.027     .6454365    .9738922
               age3 |   1.782174   .4330183     2.38   0.017      1.10696    2.869249
             1.male |   1.374551   .0901995     4.85   0.000      1.20866    1.563211
                    |
          obese4cat |
 Obese I (30-34.9)  |   .8657225   .0128782    -9.69   0.000     .8408462    .8913349
Obese II (35-39.9)  |   1.086556   .0076469    11.80   0.000     1.071672    1.101648
   Obese III (40+)  |   1.595333   .0240539    30.98   0.000     1.548878    1.643182
                    |
       smoke_nomiss |
            Former  |   1.396829   .0307166    15.20   0.000     1.337904    1.458348
           Current  |   2.307375   .1123487    17.17   0.000     2.097357    2.538424
                    |
                imd |
                 2  |   1.102603   .0236942     4.55   0.000     1.057128    1.150035
                 3  |   1.216152   .0356242     6.68   0.000     1.148296    1.288017
                 4  |   1.342185   .0596796     6.62   0.000     1.230167    1.464403
   5 most deprived  |   1.599137   .0950128     7.90   0.000      1.42335    1.796635
                    |
      tot_people_hh |
                 2  |   .8951377   .0344061    -2.88   0.004     .8301804    .9651776
                 3  |   1.143872    .062248     2.47   0.014     1.028149     1.27262
                 4  |   1.394314   .0899332     5.15   0.000     1.228734    1.582206
                 5  |   2.467015   .3867672     5.76   0.000     1.814363    3.354433
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_itu_gp_number_kids_DEMOGADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_death_itu_gp_number_kids_DEMOGADJ_noeth.ster saved
   1:   4091.27 /        1 =    4091.2690

-----------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,174,634             Number of obs    =  12,174,634
No. of failures      =       35,237
Time at risk         =   1652654047
                                                Wald chi2(9)     =     1118.16
Log pseudolikelihood =   -413277.47             Prob > chi2      =      0.0000

                                   (Std. Err. adjusted for 10 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |    .543403   .0801908    -4.13   0.000       .40692    .7256632
           1 child <12  |   .5177273   .0814923    -4.18   0.000     .3802933    .7048285
        2 children <12  |   .3993473   .0711549    -5.15   0.000     .2816342    .5662604
       3+ children <12  |   .4087847    .074422    -4.91   0.000     .2861065    .5840654
                        |
                   age1 |   1.228227   .0547713     4.61   0.000     1.125435    1.340408
                   age2 |    .763049   .0849973    -2.43   0.015     .6133885    .9492251
                   age3 |   1.955519   .5067444     2.59   0.010     1.176753    3.249665
                 1.male |   1.420138   .0848118     5.87   0.000     1.263269    1.596485
                        |
              obese4cat |
     Obese I (30-34.9)  |   .8620353   .0108925   -11.75   0.000     .8409487    .8836507
    Obese II (35-39.9)  |   1.092808   .0195137     4.97   0.000     1.055224    1.131732
       Obese III (40+)  |   1.588217   .0265504    27.67   0.000     1.537023    1.641117
                        |
           smoke_nomiss |
                Former  |   1.391735   .0420766    10.93   0.000     1.311663    1.476696
               Current  |   2.298326   .1380072    13.86   0.000     2.043147    2.585375
                        |
              ethnicity |
                 Mixed  |   .9127705   .0926294    -0.90   0.368     .7481356    1.113635
Asian or Asian British  |   .8754883   .0720693    -1.62   0.106     .7450413    1.028775
                 Black  |   .9924356   .0411555    -0.18   0.855     .9149634    1.076467
                 Other  |   .7638653   .0717399    -2.87   0.004       .63544     .918246
                        |
                    imd |
                     2  |   1.126959   .0179324     7.51   0.000     1.092354    1.162659
                     3  |   1.228461   .0370913     6.81   0.000     1.157873    1.303353
                     4  |   1.368639   .0623574     6.89   0.000     1.251719     1.49648
       5 most deprived  |   1.641567   .1038746     7.83   0.000     1.450095    1.858321
                        |
          tot_people_hh |
                     2  |   .8827588   .0319078    -3.45   0.001     .8223845    .9475653
                     3  |   1.155482   .0607712     2.75   0.006     1.042306    1.280947
                     4  |    1.42004   .0929686     5.36   0.000     1.249031    1.614462
                     5  |    2.47158   .3790754     5.90   0.000     1.829881     3.33831
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_itu_gp_number_kids_DEMOGADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_covid_death_itu_gp_number_kids_DEMOGADJ_CCeth.ster saved
   1:   3819.53 /        1 =    3819.5280

-----------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   10,271,116             Number of obs    =  10,271,116
No. of failures      =       32,370
Time at risk         =   1394024684
                                                Wald chi2(9)     =     1425.60
Log pseudolikelihood =   -375610.55             Prob > chi2      =      0.0000

                                   (Std. Err. adjusted for 10 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |    .552336   .0828107    -3.96   0.000     .4117032    .7410072
           1 child <12  |    .549399   .0844344    -3.90   0.000     .4065097    .7425142
        2 children <12  |   .4296011   .0754742    -4.81   0.000     .3044547    .6061891
       3+ children <12  |   .4612885   .0818896    -4.36   0.000     .3257349    .6532524
                        |
                   age1 |   1.257224    .045508     6.32   0.000      1.17112    1.349658
                   age2 |   .7294752   .0686843    -3.35   0.001     .6065477    .8773161
                   age3 |   2.135106   .4736605     3.42   0.001     1.382246    3.298021
                 1.male |    1.55361   .0843635     8.11   0.000     1.396756    1.728079
                        |
                 bmicat |
    Normal (18.5-24.9)  |   .4122486   .0188403   -19.39   0.000     .3769278    .4508793
  Overweight (25-29.9)  |   .2813466   .0151714   -23.52   0.000     .2531287    .3127101
     Obese I (30-34.9)  |   .3123757    .020047   -18.13   0.000     .2754549    .3542453
    Obese II (35-39.9)  |   .3969567   .0248096   -14.78   0.000     .3511911    .4486862
       Obese III (40+)  |   .5761852   .0249121   -12.75   0.000       .52937    .6271405
                        |
                  smoke |
                Former  |   1.406253   .0421444    11.38   0.000     1.326031    1.491329
               Current  |   2.141585   .1190283    13.70   0.000     1.920552    2.388057
                        |
              ethnicity |
                 Mixed  |   .9417762   .0765362    -0.74   0.460     .8031049    1.104392
Asian or Asian British  |   .8793565    .069049    -1.64   0.102     .7539226    1.025659
                 Black  |   1.045314   .0437462     1.06   0.290     .9629951     1.13467
                 Other  |   .7871588   .0707281    -2.66   0.008     .6600545     .938739
                        |
                    imd |
                     2  |   1.126596   .0176502     7.61   0.000     1.092527    1.161726
                     3  |   1.225737   .0379266     6.58   0.000     1.153611    1.302372
                     4  |   1.363566    .061695     6.85   0.000     1.247853     1.49001
       5 most deprived  |   1.630763   .1079515     7.39   0.000     1.432333    1.856683
                        |
          tot_people_hh |
                     2  |   .8915261   .0310698    -3.29   0.001     .8326636    .9545498
                     3  |   1.158814    .057817     2.95   0.003      1.05086     1.27786
                     4  |   1.433582   .0874206     5.91   0.000     1.272084    1.615583
                     5  |   2.404264   .3363036     6.27   0.000     1.827754    3.162616
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_itu_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_death_itu_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:   3977.38 /        1 =    3977.3840

-----------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,626,021             Number of obs    =  12,626,021
No. of failures      =       43,523
Time at risk         =   1713322172
                                                Wald chi2(9)     =    15193.79
Log pseudolikelihood =    -514577.7             Prob > chi2      =      0.0000

                                 (Std. Err. adjusted for 10 clusters in household_size)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
       gp_number_kids |
      only >12 years  |   .5585601   .0896479    -3.63   0.000      .407806    .7650436
         1 child <12  |   .5412154   .0912184    -3.64   0.000     .3889605     .753069
      2 children <12  |   .4221026    .079305    -4.59   0.000     .2920744    .6100178
     3+ children <12  |   .4000649   .0758411    -4.83   0.000     .2759094    .5800886
                      |
                 age1 |   1.241673   .0465128     5.78   0.000     1.153776    1.336266
                 age2 |   .7522117   .0723629    -2.96   0.003     .6229516    .9082927
                 age3 |   1.979468   .4452838     3.04   0.002     1.273708    3.076291
               1.male |   1.515329   .0891505     7.06   0.000     1.350295    1.700534
                      |
               bmicat |
  Normal (18.5-24.9)  |   .4148779   .0219471   -16.63   0.000     .3740172    .4602025
Overweight (25-29.9)  |   .2835738    .018908   -18.90   0.000     .2488342    .3231633
   Obese I (30-34.9)  |   .3129052   .0232644   -15.63   0.000     .2704745    .3619922
  Obese II (35-39.9)  |   .3929358   .0247753   -14.81   0.000     .3472576    .4446225
     Obese III (40+)  |   .5756036   .0279444   -11.38   0.000     .5233586    .6330641
                      |
                smoke |
              Former  |   1.404046   .0345644    13.79   0.000     1.337909    1.473452
             Current  |   2.150147   .1006545    16.35   0.000     1.961647    2.356759
                      |
                  imd |
                   2  |   1.100785   .0215985     4.89   0.000     1.059256    1.143942
                   3  |   1.216353   .0345213     6.90   0.000      1.15054    1.285931
                   4  |   1.339633   .0597021     6.56   0.000     1.227584    1.461909
     5 most deprived  |   1.596175   .1011288     7.38   0.000     1.409779    1.807216
                      |
        tot_people_hh |
                   2  |   .9003759   .0335301    -2.82   0.005     .8369991    .9685515
                   3  |   1.160122   .0600902     2.87   0.004     1.048128    1.284082
                   4  |    1.42734   .0854778     5.94   0.000     1.269265    1.605102
                   5  |       2.43   .3443057     6.27   0.000     1.840771    3.207839
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_itu_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_death_itu_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster saved

. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
(0 observations deleted)

. foreach exposure_type in kids_cat3   {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_12mo, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
  8. 
. }
   1:   4342.08 /        1 =    4342.0800

-----------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,074,725             Number of obs    =  16,074,725
No. of failures      =       49,005
Time at risk         =   2181876321
                                                Wald chi2(9)     =    34622.63
Log pseudolikelihood =    -587547.5             Prob > chi2      =      0.0000

                               (Std. Err. adjusted for 10 clusters in household_size)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |    .454396   .0849128    -4.22   0.000     .3150437    .6553875
     Kids under 18  |   .5476649   .0881279    -3.74   0.000     .3995242    .7507349
                    |
               age1 |   1.210935   .0510756     4.54   0.000     1.114855    1.315296
               age2 |   .7910602   .0833191    -2.23   0.026      .643511    .9724406
               age3 |   1.790002   .4371136     2.38   0.017     1.109156    2.888781
             1.male |   1.374165   .0904063     4.83   0.000     1.207921     1.56329
                    |
          obese4cat |
 Obese I (30-34.9)  |   .8656937   .0128661    -9.70   0.000     .8408403    .8912817
Obese II (35-39.9)  |   1.086683   .0076156    11.86   0.000     1.071859    1.101713
   Obese III (40+)  |   1.595867   .0239674    31.12   0.000     1.549576     1.64354
                    |
       smoke_nomiss |
            Former  |    1.39689   .0307382    15.19   0.000     1.337925    1.458454
           Current  |   2.308538   .1118238    17.27   0.000      2.09945     2.53845
                    |
                imd |
                 2  |   1.102699   .0237209     4.54   0.000     1.057173    1.150185
                 3  |   1.216372   .0356913     6.68   0.000     1.148391    1.288376
                 4  |   1.342401   .0597704     6.61   0.000     1.230219    1.464812
   5 most deprived  |   1.598833   .0950099     7.90   0.000     1.423052    1.796327
                    |
      tot_people_hh |
                 2  |   .8953708   .0344832    -2.87   0.004     .8302728    .9655729
                 3  |    1.14762   .0623681     2.53   0.011     1.031666    1.276607
                 4  |   1.398804   .0910058     5.16   0.000      1.23134    1.589043
                 5  |   2.447588   .3785413     5.79   0.000     1.807558    3.314242
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_itu_kids_cat3_DEMOGADJ_noeth_12mo.ster not found)
file ./output/an_multivariate_cox_models_covid_death_itu_kids_cat3_DEMOGADJ_noeth_12mo.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_covid_death_itu.log
  log type:  text
 closed on:  16 Jul 2020, 20:08:55
-----------------------------------------------------------------------------------------------------------------------------------------------------------
