-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivar
> iableDEMOG_cox_models_covid_tpp_prob.log
  log type:  text
 opened on:  16 Jul 2020, 09:58:29

. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string
> )] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                                  
>       ///
>                         i.male                                               
>    ///
>                         `bmi'                                   ///
>                         `smoking'                                       ///
>                         `ethnicity'                                          
>    ///
>                         i.imd                                                
>    ///
>                         i.tot_people_hh                         ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_size)
  7. timer off 1
  8. timer list
  9. end

. *****************************************************************************
> ********
. foreach exposure_type in kids_cat3  ///
>                 gp_number_kids {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_DEMOGADJ_noeth, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 1) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  9. if _rc==0{
 10. estimates
 11. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_DEMOGADJ_CCeth, replace
 12. *estat concordance /*c-statistic*/
.  }
 13.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `
> outcome')"
 14. 
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 1) bmi(i.bmicat) smoking(i.smoke)
 15. if _rc==0{
 16. estimates
 17. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_DEMOGADJ_CCeth_bmi_smok, replace
 18. *estat concordance /*c-statistic*/
.  }
 19.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCO
> ME `outcome')" 
 20.  
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 0) bmi(i.bmicat) smoking(i.smoke)
 21. if _rc==0{
 22. estimates
 23. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_DEMOGADJ_CCnoeth_bmi_smok, replace
 24. *estat concordance /*c-statistic*/
.  }
 25.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `o
> utcome')" 
 26.  
. }
   1:   1966.96 /        1 =    1966.9580

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,074,725             Number of obs    =  16,074,725
No. of failures      =       37,915
Time at risk         =   2180364256
                                                Wald chi2(9)     =    21296.26
Log pseudolikelihood =    -499374.1             Prob > chi2      =      0.0000

                        (Std. Err. adjusted for 10 clusters in household_size)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .7806132   .0598322    -3.23   0.001     .6717277    .9071489
Kids unde..  |   .9293884   .0662172    -1.03   0.304     .8082593     1.06867
             |
        age1 |   1.097114    .009049    11.24   0.000     1.079521    1.114994
        age2 |   .8133464   .0225716    -7.44   0.000     .7702885    .8588113
        age3 |   1.794005   .1293049     8.11   0.000     1.557659    2.066213
      1.male |   .9234268    .048809    -1.51   0.132     .8325515    1.024222
             |
   obese4cat |
Obese I ..)  |   1.335951   .0404698     9.56   0.000      1.25894    1.417672
Obese II..)  |   1.660292   .0315547    26.68   0.000     1.599584    1.723305
Obese II..)  |     2.0874    .041859    36.70   0.000     2.006949    2.171075
             |
smoke_nomiss |
     Former  |   1.178313   .0486198     3.98   0.000     1.086771    1.277565
    Current  |   .7059336   .0620272    -3.96   0.000     .5942547    .8386006
             |
         imd |
          2  |    1.15237   .0145082    11.26   0.000     1.124282    1.181159
          3  |   1.218301   .0281577     8.54   0.000     1.164345    1.274758
          4  |   1.452378   .0241741    22.42   0.000     1.405762     1.50054
5 most de..  |   1.699194   .0359032    25.09   0.000     1.630262     1.77104
             |
tot_people~h |
          2  |   .9329704   .0067683    -9.56   0.000     .9197986    .9463309
          3  |   1.185725   .0582275     3.47   0.001     1.076921    1.305521
          4  |    1.35529   .1063044     3.88   0.000     1.162162    1.580511
          5  |   1.810479   .2187483     4.91   0.000     1.428724    2.294238
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGA
> DJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_noet
> h.ster saved
   1:   1753.30 /        1 =    1753.3020

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,174,634             Number of obs    =  12,174,634
No. of failures      =       29,550
Time at risk         =   1651476131
                                                Wald chi2(9)     =     5769.53
Log pseudolikelihood =   -381393.41             Prob > chi2      =      0.0000

                        (Std. Err. adjusted for 10 clusters in household_size)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .7420397   .0546739    -4.05   0.000     .6422589    .8573224
Kids unde..  |   .9295029   .0670952    -1.01   0.311     .8068776    1.070764
             |
        age1 |   1.098511   .0082745    12.47   0.000     1.082412    1.114849
        age2 |   .8082562   .0211701    -8.13   0.000     .7678105    .8508324
        age3 |   1.832279   .1237768     8.96   0.000     1.605055     2.09167
      1.male |   .9330275   .0427982    -1.51   0.131     .8528047    1.020797
             |
   obese4cat |
Obese I ..)  |   1.322656   .0430329     8.60   0.000     1.240946    1.409747
Obese II..)  |   1.659363   .0456299    18.42   0.000     1.572297    1.751249
Obese II..)  |   2.138545   .0618362    26.29   0.000     2.020719    2.263242
             |
smoke_nomiss |
     Former  |   1.224856   .0342027     7.26   0.000     1.159621     1.29376
    Current  |    .742035   .0526995    -4.20   0.000     .6456124    .8528584
             |
   ethnicity |
      Mixed  |    1.47159   .0958975     5.93   0.000     1.295142    1.672076
Asian or ..  |   2.089408   .1177946    13.07   0.000     1.870833     2.33352
      Black  |   1.732436   .0705855    13.49   0.000      1.59947    1.876455
      Other  |   1.317232   .1269104     2.86   0.004     1.090566    1.591008
             |
         imd |
          2  |   1.133274    .022105     6.41   0.000     1.090766    1.177437
          3  |   1.178777   .0353483     5.48   0.000     1.111492    1.250135
          4  |   1.354949   .0431133     9.55   0.000     1.273029     1.44214
5 most de..  |   1.547532   .0686719     9.84   0.000     1.418624    1.688153
             |
tot_people~h |
          2  |   .9144304   .0060304   -13.56   0.000     .9026871    .9263265
          3  |   1.153384   .0551085     2.99   0.003     1.050276    1.266613
          4  |   1.305232   .1007255     3.45   0.001     1.122019    1.518363
          5  |   1.535819   .1600678     4.12   0.000      1.25206    1.883887
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGA
> DJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_CCet
> h.ster saved
   1:   1527.74 /        1 =    1527.7370

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   10,271,116             Number of obs    =  10,271,116
No. of failures      =       26,957
Time at risk         =   1392943996
                                                Wald chi2(9)     =     5135.87
Log pseudolikelihood =   -343815.88             Prob > chi2      =      0.0000

                        (Std. Err. adjusted for 10 clusters in household_size)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .7213699   .0505234    -4.66   0.000     .6288419    .8275125
Kids unde..  |   .9246385   .0612108    -1.18   0.237     .8121246     1.05274
             |
        age1 |   1.100368   .0084966    12.39   0.000     1.083841    1.117148
        age2 |   .7993419   .0208515    -8.59   0.000     .7595009    .8412728
        age3 |   1.895281   .1260205     9.62   0.000     1.663703    2.159094
      1.male |   .9808486   .0443018    -0.43   0.669     .8977511    1.071638
             |
      bmicat |
Normal (..)  |   .6759232   .0330654    -8.01   0.000      .614126    .7439388
Overweig..)  |   .7284273   .0526239    -4.39   0.000     .6322558    .8392275
Obese I ..)  |   .9118445   .0782588    -1.08   0.282     .7706669    1.078884
Obese II..)  |   1.146728   .0642003     2.45   0.014     1.027555    1.279721
Obese II..)  |    1.47799   .1250905     4.62   0.000     1.252072     1.74467
             |
       smoke |
     Former  |   1.203893    .036601     6.10   0.000     1.134252     1.27781
    Current  |   .7337694   .0518527    -4.38   0.000      .638864    .8427735
             |
   ethnicity |
      Mixed  |   1.527788   .1201156     5.39   0.000     1.309607    1.782317
Asian or ..  |   2.034474   .1090007    13.26   0.000      1.83167    2.259731
      Black  |    1.73867   .0729877    13.18   0.000     1.601344    1.887773
      Other  |   1.356767   .1367882     3.03   0.002     1.113494     1.65319
             |
         imd |
          2  |    1.13488    .024566     5.85   0.000     1.087738    1.184064
          3  |   1.182435   .0401796     4.93   0.000      1.10625    1.263867
          4  |   1.369497   .0412408    10.44   0.000     1.291006    1.452761
5 most de..  |   1.560485   .0688258    10.09   0.000     1.431255    1.701383
             |
tot_people~h |
          2  |   .9084357   .0057666   -15.13   0.000     .8972034    .9198086
          3  |   1.165175   .0550061     3.24   0.001     1.062202     1.27813
          4  |   1.328202   .1015609     3.71   0.000     1.143344    1.542947
          5  |     1.5925   .1688441     4.39   0.000     1.293693    1.960324
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGA
> DJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_CCet
> h_bmi_smok.ster saved
   1:   1615.91 /        1 =    1615.9090

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,626,021             Number of obs    =  12,626,021
No. of failures      =       33,565
Time at risk         =   1711974960
                                                Wald chi2(9)     =    12903.93
Log pseudolikelihood =   -434912.38             Prob > chi2      =      0.0000

                        (Std. Err. adjusted for 10 clusters in household_size)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .7399676   .0515317    -4.32   0.000      .645557    .8481854
Kids unde..  |   .9155638   .0575211    -1.40   0.160     .8094894    1.035538
             |
        age1 |   1.098714   .0098443    10.51   0.000     1.079588    1.118179
        age2 |    .804079    .023599    -7.43   0.000     .7591309    .8516884
        age3 |   1.857332   .1392216     8.26   0.000      1.60356    2.151264
      1.male |   .9964855   .0472107    -0.07   0.941     .9081204    1.093449
             |
      bmicat |
Normal (..)  |   .6549759   .0242566   -11.43   0.000     .6091183    .7042858
Overweig..)  |   .7044279   .0412054    -5.99   0.000     .6281244    .7900006
Obese I ..)  |   .8654628   .0592061    -2.11   0.035     .7568642    .9896437
Obese II..)  |    1.08034   .0481139     1.74   0.083     .9900368     1.17888
Obese II..)  |   1.358552    .079722     5.22   0.000     1.210951    1.524145
             |
       smoke |
     Former  |   1.136148   .0528651     2.74   0.006     1.037118    1.244633
    Current  |   .6896311    .061423    -4.17   0.000     .5791664    .8211648
             |
         imd |
          2  |   1.161846   .0177598     9.81   0.000     1.127554    1.197181
          3  |   1.225154   .0310837     8.00   0.000     1.165721    1.287617
          4  |   1.465774   .0266249    21.05   0.000     1.414508    1.518898
5 most de..  |    1.72073   .0343685    27.17   0.000      1.65467    1.789427
             |
tot_people~h |
          2  |   .9306654    .006642   -10.07   0.000     .9177379    .9437751
          3  |   1.212808   .0591389     3.96   0.000     1.102265    1.334438
          4  |   1.420575   .1109977     4.49   0.000     1.218862    1.655668
          5  |   1.921594    .238817     5.26   0.000     1.506169    2.451599
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGA
> DJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_CCno
> eth_bmi_smok.ster saved
   1:   2004.06 /        1 =    2004.0600

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,074,725             Number of obs    =  16,074,725
No. of failures      =       37,915
Time at risk         =   2180364256
                                                Wald chi2(9)     =     4829.97
Log pseudolikelihood =   -499350.21             Prob > chi2      =      0.0000

                        (Std. Err. adjusted for 10 clusters in household_size)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
only >12 ..  |   .9205614    .063776    -1.19   0.232     .8036778    1.054444
1 child <12  |   .8326384   .0565043    -2.70   0.007     .7289411    .9510875
2 childre..  |   .7254194   .0498873    -4.67   0.000     .6339453    .8300927
3+ childr..  |   .6585253   .0429439    -6.41   0.000     .5795137    .7483094
             |
        age1 |   1.098319   .0093754    10.99   0.000     1.080097    1.116849
        age2 |   .8106386   .0229382    -7.42   0.000     .7669045    .8568667
        age3 |   1.809667    .132886     8.08   0.000      1.56709    2.089794
      1.male |   .9229434   .0490652    -1.51   0.131     .8316178    1.024298
             |
   obese4cat |
Obese I ..)  |   1.336786   .0406688     9.54   0.000     1.259406     1.41892
Obese II..)  |   1.660886   .0313555    26.87   0.000     1.600553    1.723493
Obese II..)  |   2.087129   .0415951    36.92   0.000     2.007176    2.170267
             |
smoke_nomiss |
     Former  |   1.179176   .0483483     4.02   0.000     1.088123    1.277849
    Current  |   .7055616   .0621271    -3.96   0.000     .5937227    .8384674
             |
         imd |
          2  |   1.151752   .0143946    11.30   0.000     1.123882    1.180313
          3  |   1.217097   .0276952     8.63   0.000     1.164008    1.272607
          4  |   1.450675   .0238555    22.62   0.000     1.404664    1.498192
5 most de..  |   1.698188   .0352425    25.52   0.000       1.6305    1.768686
             |
tot_people~h |
          2  |   .9320421   .0068349    -9.60   0.000     .9187417     .945535
          3  |   1.176119   .0567406     3.36   0.001     1.070006    1.292756
          4  |   1.362425     .09663     4.36   0.000     1.185609    1.565612
          5  |   1.851729   .2191657     5.21   0.000     1.468356    2.335196
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_D
> EMOGADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ
> _noeth.ster saved
   1:   1731.18 /        1 =    1731.1790

-----------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,174,634             Number of obs    =  12,174,634
No. of failures      =       29,550
Time at risk         =   1651476131
                                                Wald chi2(9)     =     5176.48
Log pseudolikelihood =   -381371.31             Prob > chi2      =      0.0000

                                   (Std. Err. adjusted for 10 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |   .9195731   .0642731    -1.20   0.230     .8018478    1.054583
           1 child <12  |   .7949114   .0520626    -3.50   0.000     .6991485    .9037911
        2 children <12  |   .6855285   .0409621    -6.32   0.000     .6097673    .7707029
       3+ children <12  |   .6225281   .0396226    -7.45   0.000     .5495178    .7052387
                        |
                   age1 |   1.099784   .0085424    12.25   0.000     1.083168    1.116655
                   age2 |   .8053993   .0214241    -8.14   0.000     .7644847    .8485036
                   age3 |   1.849344   .1268742     8.96   0.000     1.616669    2.115507
                 1.male |   .9325635   .0430185    -1.51   0.130      .851948    1.020807
                        |
              obese4cat |
     Obese I (30-34.9)  |   1.323438   .0431872     8.59   0.000     1.241443    1.410849
    Obese II (35-39.9)  |   1.659804    .045447    18.51   0.000     1.573077    1.751312
       Obese III (40+)  |   2.137936   .0615501    26.39   0.000      2.02064     2.26204
                        |
           smoke_nomiss |
                Former  |   1.225612    .033931     7.35   0.000     1.160881    1.293953
               Current  |   .7413529   .0527921    -4.20   0.000     .6447784    .8523922
                        |
              ethnicity |
                 Mixed  |   1.471094   .0957579     5.93   0.000     1.294891    1.671274
Asian or Asian British  |   2.086142   .1167374    13.14   0.000     1.869441    2.327962
                 Black  |   1.735232   .0704462    13.58   0.000      1.60251    1.878946
                 Other  |   1.315909   .1260279     2.87   0.004     1.090697    1.587623
                        |
                    imd |
                     2  |   1.132598   .0220828     6.39   0.000     1.090133    1.176718
                     3  |   1.177469   .0351645     5.47   0.000     1.110526    1.248447
                     4  |   1.353145   .0433818     9.43   0.000     1.270734      1.4409
       5 most deprived  |   1.546556   .0688127     9.80   0.000       1.4174    1.687482
                        |
          tot_people_hh |
                     2  |   .9133638   .0058319   -14.19   0.000     .9020046     .924866
                     3  |   1.142619   .0531444     2.87   0.004     1.043064    1.251675
                     4  |   1.314253   .0900713     3.99   0.000      1.14906    1.503195
                     5  |   1.575571   .1544378     4.64   0.000     1.300178    1.909294
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_CCeth.ster saved
   1:   1553.26 /        1 =    1553.2590

-----------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   10,271,116             Number of obs    =  10,271,116
No. of failures      =       26,957
Time at risk         =   1392943996
                                                Wald chi2(9)     =     7128.74
Log pseudolikelihood =   -343788.43             Prob > chi2      =      0.0000

                                   (Std. Err. adjusted for 10 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |   .9130185   .0585029    -1.42   0.156     .8052629    1.035193
           1 child <12  |   .7796001   .0472966    -4.10   0.000     .6921996    .8780362
        2 children <12  |   .6655492   .0358257    -7.56   0.000     .5989093     .739604
       3+ children <12  |   .5741396    .036541    -8.72   0.000     .5068075    .6504172
                        |
                   age1 |   1.101437   .0087486    12.16   0.000     1.084423    1.118718
                   age2 |    .796703   .0211078    -8.58   0.000     .7563882    .8391666
                   age3 |   1.912352   .1293043     9.59   0.000     1.674996    2.183344
                 1.male |   .9802457   .0445326    -0.44   0.661     .8967365    1.071532
                        |
                 bmicat |
    Normal (18.5-24.9)  |   .6771813   .0336735    -7.84   0.000     .6142967    .7465033
  Overweight (25-29.9)  |   .7304043   .0535099    -4.29   0.000     .6327086     .843185
     Obese I (30-34.9)  |    .914258   .0792648    -1.03   0.301     .7713845    1.083594
    Obese II (35-39.9)  |   1.149321   .0649499     2.46   0.014     1.028818    1.283938
       Obese III (40+)  |   1.480365   .1260384     4.61   0.000     1.252845    1.749202
                        |
                  smoke |
                Former  |   1.204554   .0363443     6.17   0.000     1.135386    1.277936
               Current  |   .7329326   .0519695    -4.38   0.000     .6378352    .8422083
                        |
              ethnicity |
                 Mixed  |   1.527311   .1199978     5.39   0.000     1.309334    1.781577
Asian or Asian British  |   2.030959   .1079557    13.33   0.000     1.830018    2.253963
                 Black  |   1.742761    .073318    13.20   0.000     1.604825    1.892552
                 Other  |   1.355505   .1359753     3.03   0.002     1.113561    1.650016
                        |
                    imd |
                     2  |   1.134185   .0245213     5.82   0.000     1.087128    1.183279
                     3  |   1.181041   .0399396     4.92   0.000     1.105299    1.261974
                     4  |   1.367629     .04131    10.36   0.000     1.289013     1.45104
       5 most deprived  |    1.56009   .0687265    10.10   0.000      1.43104    1.700778
                        |
          tot_people_hh |
                     2  |   .9072944    .005626   -15.69   0.000     .8963344    .9183884
                     3  |   1.152705    .052594     3.11   0.002     1.054098    1.260537
                     4  |   1.336904   .0888501     4.37   0.000     1.173626    1.522897
                     5  |   1.643383   .1649263     4.95   0.000     1.349939    2.000615
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:   1707.40 /        1 =    1707.3980

-----------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,626,021             Number of obs    =  12,626,021
No. of failures      =       33,565
Time at risk         =   1711974960
                                                Wald chi2(9)     =     9533.62
Log pseudolikelihood =   -434879.62             Prob > chi2      =      0.0000

                                 (Std. Err. adjusted for 10 clusters in household_size)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
       gp_number_kids |
      only >12 years  |   .9045378   .0551794    -1.64   0.100     .8026035    1.019418
         1 child <12  |   .8009066   .0467124    -3.81   0.000     .7143911    .8978995
      2 children <12  |   .6805311   .0409285    -6.40   0.000     .6048602    .7656688
     3+ children <12  |   .5894535   .0387384    -8.04   0.000     .5182142    .6704862
                      |
                 age1 |   1.099824   .0101378    10.32   0.000     1.080132    1.119874
                 age2 |   .8013525   .0238791    -7.43   0.000     .7558908    .8495484
                 age3 |   1.874411   .1426901     8.25   0.000     1.614607    2.176019
               1.male |   .9958895   .0474377    -0.09   0.931     .9071214    1.093344
                      |
               bmicat |
  Normal (18.5-24.9)  |   .6561989   .0247406   -11.17   0.000     .6094566    .7065262
Overweight (25-29.9)  |   .7063071   .0419609    -5.85   0.000     .6286729    .7935284
   Obese I (30-34.9)  |   .8676938   .0600368    -2.05   0.040     .7576538    .9937157
  Obese II (35-39.9)  |   1.082736   .0487557     1.77   0.078     .9912719    1.182639
     Obese III (40+)  |   1.360691   .0804007     5.21   0.000     1.211891    1.527761
                      |
                smoke |
              Former  |    1.13693   .0526087     2.77   0.006     1.038356    1.244861
             Current  |   .6890325   .0615533    -4.17   0.000     .5783615    .8208806
                      |
                  imd |
                   2  |   1.161131   .0176071     9.85   0.000     1.127129    1.196158
                   3  |   1.223703   .0304962     8.10   0.000     1.165368    1.284959
                   4  |   1.463793   .0259379    21.50   0.000     1.413828    1.515523
     5 most deprived  |   1.720063   .0335687    27.79   0.000     1.655512    1.787131
                      |
        tot_people_hh |
                   2  |   .9295599   .0067767   -10.02   0.000     .9163722    .9429374
                   3  |   1.200474   .0569511     3.85   0.000     1.093884     1.31745
                   4  |   1.428914    .098264     5.19   0.000     1.248735     1.63509
                   5  |     1.9786   .2427305     5.56   0.000      1.55573    2.516411
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster saved

. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
(0 observations deleted)

. foreach exposure_type in kids_cat3   {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_12mo, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
  8. 
. }
   1:   1945.12 /        1 =    1945.1230

-----------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-----------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,074,725             Number of obs    =  16,074,725
No. of failures      =       37,915
Time at risk         =   2180364256
                                                Wald chi2(9)     =    21296.26
Log pseudolikelihood =    -499374.1             Prob > chi2      =      0.0000

                               (Std. Err. adjusted for 10 clusters in household_size)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   .7806132   .0598322    -3.23   0.001     .6717277    .9071489
     Kids under 18  |   .9293884   .0662172    -1.03   0.304     .8082593     1.06867
                    |
               age1 |   1.097114    .009049    11.24   0.000     1.079521    1.114994
               age2 |   .8133464   .0225716    -7.44   0.000     .7702885    .8588113
               age3 |   1.794005   .1293049     8.11   0.000     1.557659    2.066213
             1.male |   .9234268    .048809    -1.51   0.132     .8325515    1.024222
                    |
          obese4cat |
 Obese I (30-34.9)  |   1.335951   .0404698     9.56   0.000      1.25894    1.417672
Obese II (35-39.9)  |   1.660292   .0315547    26.68   0.000     1.599584    1.723305
   Obese III (40+)  |     2.0874    .041859    36.70   0.000     2.006949    2.171075
                    |
       smoke_nomiss |
            Former  |   1.178313   .0486198     3.98   0.000     1.086771    1.277565
           Current  |   .7059336   .0620272    -3.96   0.000     .5942547    .8386006
                    |
                imd |
                 2  |    1.15237   .0145082    11.26   0.000     1.124282    1.181159
                 3  |   1.218301   .0281577     8.54   0.000     1.164345    1.274758
                 4  |   1.452378   .0241741    22.42   0.000     1.405762     1.50054
   5 most deprived  |   1.699194   .0359032    25.09   0.000     1.630262     1.77104
                    |
      tot_people_hh |
                 2  |   .9329704   .0067683    -9.56   0.000     .9197986    .9463309
                 3  |   1.185725   .0582275     3.47   0.001     1.076921    1.305521
                 4  |    1.35529   .1063044     3.88   0.000     1.162162    1.580511
                 5  |   1.810479   .2187483     4.91   0.000     1.428724    2.294238
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_noeth_12mo.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_noeth_12mo.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_covid_tpp_prob.log
  log type:  text
 closed on:  16 Jul 2020, 14:22:43
-----------------------------------------------------------------------------------------------------------------------------------------------------------
