-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\WORMS_an_mu
> ltivariableDEMOG_cox_models_worms.log
  log type:  text
 opened on:  16 Jul 2020, 11:39:16

. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string
> )] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                                  
>       ///
>                         i.male                                               
>    ///
>                         `bmi'                                   ///
>                         `smoking'                                       ///
>                         `ethnicity'                                          
>    ///
>                         i.imd                                                
>    ///
>                         i.tot_people_hh                         ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_size)
  7. timer off 1
  8. timer list
  9. end

. *****************************************************************************
> ********
. foreach exposure_type in kids_cat3 {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_DEMOGADJ_noeth, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
  8. 
. }
   1:   1445.56 /        1 =    1445.5620

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   15,687,878             Number of obs    =  15,687,878
No. of failures      =        1,739
Time at risk         =   5725749941
                                                Wald chi2(9)     =     1274.40
Log pseudolikelihood =   -22740.954             Prob > chi2      =      0.0000

                        (Std. Err. adjusted for 10 clusters in household_size)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   2.430469   .1072365    20.13   0.000     2.229121    2.650005
Kids unde..  |   1.040205    .053081     0.77   0.440     .9412019    1.149622
             |
        age1 |   .9901946   .0200627    -0.49   0.627     .9516431    1.030308
        age2 |   .9599254   .0569008    -0.69   0.490     .8546366    1.078186
        age3 |   1.105571   .1799065     0.62   0.537     .8036615    1.520899
      1.male |   .5810818   .0346314    -9.11   0.000     .5170199    .6530815
             |
   obese4cat |
Obese I ..)  |   .9787993   .0556726    -0.38   0.706     .8755453     1.09423
Obese II..)  |    1.09691   .0774282     1.31   0.190     .9551832    1.259665
Obese II..)  |   1.193091   .1040574     2.02   0.043     1.005621    1.415508
             |
smoke_nomiss |
     Former  |   1.240313   .0675597     3.95   0.000     1.114721    1.380054
    Current  |   1.001915   .0755429     0.03   0.980      .864274    1.161476
             |
         imd |
          2  |   1.157775   .1544661     1.10   0.272     .8913736    1.503794
          3  |   1.078943   .0591846     1.39   0.166     .9689619    1.201408
          4  |    1.29404   .1299389     2.57   0.010     1.062859    1.575505
5 most de..  |   1.441495   .1663601     3.17   0.002     1.149682    1.807377
             |
tot_people~h |
          2  |    .869783    .012082   -10.04   0.000     .8464221    .8937886
          3  |   .8864112   .0262302    -4.07   0.000     .8364634    .9393415
          4  |   .8248402     .03007    -5.28   0.000     .7679604    .8859328
          5  |    1.00986   .0379932     0.26   0.794     .9380742     1.08714
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_worms_kids_cat3_DEMOGADJ_noeth.
> ster not found)
file ./output/an_multivariate_cox_models_worms_kids_cat3_DEMOGADJ_noeth.ster sa
> ved

. 
. log close
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\WORMS_an_mu
> ltivariableDEMOG_cox_models_worms.log
  log type:  text
 closed on:  16 Jul 2020, 12:03:37
-------------------------------------------------------------------------------
