-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\WORMS_04a_a
> n_descriptive_safetables.log
  log type:  text
 opened on:  16 Jul 2020, 11:15:36

. 
. use $tempdir\analysis_dataset_worms, clear

. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 15,910,387     48.1332    18.59669         18        110

. safetab agegroup
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  3,151,355       19.81       19.81
     30-<40 |  2,895,739       18.20       38.01
     40-<50 |  2,568,132       16.14       54.15
     50-<60 |  2,654,101       16.68       70.83
     60-<70 |  2,118,547       13.32       84.15
     70-<80 |  1,661,381       10.44       94.59
        80+ |    861,132        5.41      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00

. safetab age66
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,786,005       80.36       80.36
          1 |  3,124,382       19.64      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00

. safetab male
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,082,916       50.80       50.80
          1 |  7,827,471       49.20      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00

. safetab bmicat
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    289,830        2.28        2.28
  Normal (18.5-24.9) |  4,547,664       35.81       38.10
Overweight (25-29.9) |  4,365,282       34.38       72.47
   Obese I (30-34.9) |  2,207,596       17.39       89.86
  Obese II (35-39.9) |    855,696        6.74       96.60
     Obese III (40+) |    431,934        3.40      100.00
---------------------+-----------------------------------
               Total | 12,698,002      100.00

. safetab bmicat, m
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    289,830        1.82        1.82
  Normal (18.5-24.9) |  4,547,664       28.58       30.40
Overweight (25-29.9) |  4,365,282       27.44       57.84
   Obese I (30-34.9) |  2,207,596       13.88       71.72
  Obese II (35-39.9) |    855,696        5.38       77.09
     Obese III (40+) |    431,934        2.71       79.81
        Unknown (.u) |  3,212,385       20.19      100.00
---------------------+-----------------------------------
               Total | 15,910,387      100.00

. safetab obese4cat
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity | 12,415,161       78.03       78.03
   Obese I (30-34.9) |  2,207,596       13.88       91.91
  Obese II (35-39.9) |    855,696        5.38       97.29
     Obese III (40+) |    431,934        2.71      100.00
---------------------+-----------------------------------
               Total | 15,910,387      100.00

. safetab smoke
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  7,192,556       47.92       47.92
      Former |  5,029,281       33.51       81.43
     Current |  2,786,560       18.57      100.00
-------------+-----------------------------------
       Total | 15,008,397      100.00

. safetab smoke, m
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  7,192,556       45.21       45.21
      Former |  5,029,281       31.61       76.82
     Current |  2,786,560       17.51       94.33
Unknown (.u) |    901,990        5.67      100.00
-------------+-----------------------------------
       Total | 15,910,387      100.00

. safetab bpcat
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,529,116       25.25       25.25
      Elevated |  2,239,967       16.03       41.28
 High, stage I |  4,884,052       34.94       76.22
High, stage II |  3,323,746       23.78      100.00
---------------+-----------------------------------
         Total | 13,976,881      100.00

. safetab bpcat, m
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,529,116       22.18       22.18
      Elevated |  2,239,967       14.08       36.26
 High, stage I |  4,884,052       30.70       66.96
High, stage II |  3,323,746       20.89       87.85
       Unknown |  1,933,506       12.15      100.00
---------------+-----------------------------------
         Total | 15,910,387      100.00

. safetab htdiag_or_highbp
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,673,661       67.09       67.09
          1 |  5,236,726       32.91      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00

. ta shield

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,173,190       76.51       76.51
          1 |  3,737,197       23.49      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00

. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 organ_trans                  
>    /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2.                                                 
. safetab `var'
  3. }
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,258,044       95.90       95.90
          1 |    652,343        4.10      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 13,393,456       84.18       84.18
          1 |  2,516,931       15.82      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 14,838,545       93.26       93.26
          1 |  1,071,842        6.74      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00
0

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 14,307,505       89.93       89.93
          1 |  1,602,882       10.07      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 15,144,903       95.19       95.19
    Last year |     71,536        0.45       95.64
2-5 years ago |    209,163        1.31       96.95
     5+ years |    484,785        3.05      100.00
--------------+-----------------------------------
        Total | 15,910,387      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 15,819,939       99.43       99.43
    Last year |      8,118        0.05       99.48
2-5 years ago |     25,181        0.16       99.64
     5+ years |     57,149        0.36      100.00
--------------+-----------------------------------
        Total | 15,910,387      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,865,403       99.72       99.72
          1 |     44,984        0.28      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00
0

Solid organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,891,940       99.88       99.88
          1 |     18,447        0.12      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,887,540       99.86       99.86
          1 |     22,847        0.14      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,813,543       99.39       99.39
          1 |     96,844        0.61      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,756,755       99.03       99.03
          1 |    153,632        0.97      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,555,381       97.77       97.77
          1 |    355,006        2.23      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,703        0.09        0.09
         15 |     45,351        0.40        0.50
         30 |    199,005        1.76        2.25
         45 |    628,237        5.55        7.81
         60 | 10,432,279       92.19      100.00
------------+-----------------------------------
      Total | 11,315,575      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None | 15,027,091       94.45       94.45
Stage 3a/3b egfr 30-60       |    827,242        5.20       99.65
           Stage 4/5 egfr<30 |     56,054        0.35      100.00
-----------------------------+-----------------------------------
                       Total | 15,910,387      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,586,628       79.11       79.11
          1 |  3,323,759       20.89      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,105,176       94.94       94.94
          1 |    805,211        5.06      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00

. 
. safetab imd 
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  3,343,330       21.01       21.01
               2 |  3,369,824       21.18       42.19
               3 |  3,244,428       20.39       62.59
               4 |  3,200,159       20.11       82.70
 5 most deprived |  2,752,646       17.30      100.00
-----------------+-----------------------------------
           Total | 15,910,387      100.00

. safetab imd, m
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  3,343,330       21.01       21.01
               2 |  3,369,824       21.18       42.19
               3 |  3,244,428       20.39       62.59
               4 |  3,200,159       20.11       82.70
 5 most deprived |  2,752,646       17.30      100.00
-----------------+-----------------------------------
           Total | 15,910,387      100.00

. safetab ethnicity
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White | 10,270,484       84.93       84.93
                 Mixed |    175,808        1.45       86.38
Asian or Asian British |    967,537        8.00       94.38
                 Black |    349,876        2.89       97.27
                 Other |    329,681        2.73      100.00
-----------------------+-----------------------------------
                 Total | 12,093,386      100.00

. safetab ethnicity, m
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White | 10,270,484       64.55       64.55
                 Mixed |    175,808        1.10       65.66
Asian or Asian British |    967,537        6.08       71.74
                 Black |    349,876        2.20       73.94
                 Other |    329,681        2.07       76.01
               Unknown |  3,817,001       23.99      100.00
-----------------------+-----------------------------------
                 Total | 15,910,387      100.00

. safetab stp
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    802,332        5.04        5.04
          2 |  1,419,650        8.92       13.97
          3 |    667,167        4.19       18.16
          4 |    149,244        0.94       19.10
          5 |    105,298        0.66       19.76
          6 |    714,611        4.49       24.25
          7 |     41,453        0.26       24.51
          8 |    571,209        3.59       28.10
          9 |    461,804        2.90       31.00
         10 |    613,700        3.86       34.86
         11 |    664,894        4.18       39.04
         12 |    215,555        1.35       40.39
         13 |    323,349        2.03       42.43
         14 |    409,740        2.58       45.00
         15 |    533,620        3.35       48.36
         16 |    581,157        3.65       52.01
         17 |    480,226        3.02       55.03
         18 |    647,055        4.07       59.09
         19 |    511,099        3.21       62.31
         20 |    760,431        4.78       67.09
         21 |  1,029,722        6.47       73.56
         22 |     67,593        0.42       73.98
         23 |    586,682        3.69       77.67
         24 |     29,152        0.18       77.85
         25 |    131,646        0.83       78.68
         26 |    509,084        3.20       81.88
         27 |    592,442        3.72       85.60
         28 |    511,544        3.22       88.82
         29 |    395,957        2.49       91.31
         30 |    290,288        1.82       93.13
         31 |     18,469        0.12       93.25
         32 |  1,074,214        6.75      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00

. 
. 
. * Outcomes
. safetab worms
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      worms |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,686,139       98.59       98.59
          1 |    224,248        1.41      100.00
------------+-----------------------------------
      Total | 15,910,387      100.00

. 
. 
. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist worms {
  2. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                     
>    `outvar', col
  3.         safetab male                                                      
>       `outvar', col
  4.         safetab bmicat                                                    
>       `outvar', col m 
  5.         safetab smoke                                                     
>       `outvar', col m
  6.         safetab obese4cat                                                 
>       `outvar', col m 
  7.         safetab shield                                                    
>       `outvar', col m 
  8. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 organ_trans                  
>    /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  9.         safetab `var'           `outvar', col
 10. }
 11.         
.         safetab imd                                                          
>    `outvar', col m
 12.         safetab ethnicity                                                 
>       `outvar', col m
 13.         *safetab urban                                                    
>       `outvar', col
.         safetab stp                                                          
>    `outvar', col
 14. }
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped |    outcome: worms
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 3,051,614     99,741 | 3,151,355 
           |     19.45      44.48 |     19.81 
-----------+----------------------+----------
    30-<40 | 2,845,830     49,909 | 2,895,739 
           |     18.14      22.26 |     18.20 
-----------+----------------------+----------
    40-<50 | 2,538,337     29,795 | 2,568,132 
           |     16.18      13.29 |     16.14 
-----------+----------------------+----------
    50-<60 | 2,628,928     25,173 | 2,654,101 
           |     16.76      11.23 |     16.68 
-----------+----------------------+----------
    60-<70 | 2,106,035     12,512 | 2,118,547 
           |     13.43       5.58 |     13.32 
-----------+----------------------+----------
    70-<80 | 1,656,061      5,320 | 1,661,381 
           |     10.56       2.37 |     10.44 
-----------+----------------------+----------
       80+ |   859,334      1,798 |   861,132 
           |      5.48       0.80 |      5.41 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
11

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: worms
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,945,134    137,782 | 8,082,916 
           |     50.65      61.44 |     50.80 
-----------+----------------------+----------
         1 | 7,741,005     86,466 | 7,827,471 
           |     49.35      38.56 |     49.20 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: worms
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   284,525      5,305 |   289,830 
                     |      1.81       2.37 |      1.82 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 4,480,819     66,845 | 4,547,664 
                     |     28.57      29.81 |     28.58 
---------------------+----------------------+----------
Overweight (25-29.9) | 4,314,139     51,143 | 4,365,282 
                     |     27.50      22.81 |     27.44 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,179,593     28,003 | 2,207,596 
                     |     13.90      12.49 |     13.88 
---------------------+----------------------+----------
  Obese II (35-39.9) |   842,687     13,009 |   855,696 
                     |      5.37       5.80 |      5.38 
---------------------+----------------------+----------
     Obese III (40+) |   424,286      7,648 |   431,934 
                     |      2.70       3.41 |      2.71 
---------------------+----------------------+----------
        Unknown (.u) | 3,160,090     52,295 | 3,212,385 
                     |     20.15      23.32 |     20.19 
---------------------+----------------------+----------
               Total |15,686,139    224,248 |15,910,387 
                     |    100.00     100.00 |    100.00 
12

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking |    outcome: worms
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 7,087,981    104,575 | 7,192,556 
             |     45.19      46.63 |     45.21 
-------------+----------------------+----------
      Former | 4,970,032     59,249 | 5,029,281 
             |     31.68      26.42 |     31.61 
-------------+----------------------+----------
     Current | 2,737,786     48,774 | 2,786,560 
             |     17.45      21.75 |     17.51 
-------------+----------------------+----------
Unknown (.u) |   890,340     11,650 |   901,990 
             |      5.68       5.20 |      5.67 
-------------+----------------------+----------
       Total |15,686,139    224,248 |15,910,387 
             |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity |    outcome: worms
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |12,239,573    175,588 |12,415,161 
                     |     78.03      78.30 |     78.03 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,179,593     28,003 | 2,207,596 
                     |     13.90      12.49 |     13.88 
---------------------+----------------------+----------
  Obese II (35-39.9) |   842,687     13,009 |   855,696 
                     |      5.37       5.80 |      5.38 
---------------------+----------------------+----------
     Obese III (40+) |   424,286      7,648 |   431,934 
                     |      2.70       3.41 |      2.71 
---------------------+----------------------+----------
               Total |15,686,139    224,248 |15,910,387 
                     |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable |    outcome: worms
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |12,012,308    160,882 |12,173,190 
           |     76.58      71.74 |     76.51 
-----------+----------------------+----------
         1 | 3,673,831     63,366 | 3,737,197 
           |     23.42      28.26 |     23.49 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator |    outcome: worms
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |15,038,540    219,504 |15,258,044 
           |     95.87      97.88 |     95.90 
-----------+----------------------+----------
         1 |   647,599      4,744 |   652,343 
           |      4.13       2.12 |      4.10 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma |    outcome: worms
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |13,224,647    168,809 |13,393,456 
           |     84.31      75.28 |     84.18 
-----------+----------------------+----------
         1 | 2,461,492     55,439 | 2,516,931 
           |     15.69      24.72 |     15.82 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac |    outcome: worms
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |14,620,628    217,917 |14,838,545 
           |     93.21      97.18 |     93.26 
-----------+----------------------+----------
         1 | 1,065,511      6,331 | 1,071,842 
           |      6.79       2.82 |      6.74 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: worms
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |14,095,397    212,108 |14,307,505 
           |     89.86      94.59 |     89.93 
-----------+----------------------+----------
         1 | 1,590,742     12,140 | 1,602,882 
           |     10.14       5.41 |     10.07 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo |    outcome: worms
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |14,925,419    219,484 |15,144,903 
              |     95.15      97.88 |     95.19 
--------------+----------------------+----------
    Last year |    71,079        457 |    71,536 
              |      0.45       0.20 |      0.45 
--------------+----------------------+----------
2-5 years ago |   207,885      1,278 |   209,163 
              |      1.33       0.57 |      1.31 
--------------+----------------------+----------
     5+ years |   481,756      3,029 |   484,785 
              |      3.07       1.35 |      3.05 
--------------+----------------------+----------
        Total |15,686,139    224,248 |15,910,387 
              |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica |    outcome: worms
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |15,596,401    223,538 |15,819,939 
              |     99.43      99.68 |     99.43 
--------------+----------------------+----------
    Last year |     8,062         56 |     8,118 
              |      0.05       0.02 |      0.05 
--------------+----------------------+----------
2-5 years ago |    24,999        182 |    25,181 
              |      0.16       0.08 |      0.16 
--------------+----------------------+----------
     5+ years |    56,677        472 |    57,149 
              |      0.36       0.21 |      0.36 
--------------+----------------------+----------
        Total |15,686,139    224,248 |15,910,387 
              |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on |    outcome: worms
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |15,641,750    223,653 |15,865,403 
           |     99.72      99.73 |     99.72 
-----------+----------------------+----------
         1 |    44,389        595 |    44,984 
           |      0.28       0.27 |      0.28 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Solid |     indicator for
     organ |    outcome: worms
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |15,667,856    224,084 |15,891,940 
           |     99.88      99.93 |     99.88 
-----------+----------------------+----------
         1 |    18,283        164 |    18,447 
           |      0.12       0.07 |      0.12 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: worms
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |15,663,519    224,021 |15,887,540 
           |     99.86      99.90 |     99.86 
-----------+----------------------+----------
         1 |    22,620        227 |    22,847 
           |      0.14       0.10 |      0.14 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver |    outcome: worms
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,590,109    223,434 |15,813,543 
           |     99.39      99.64 |     99.39 
-----------+----------------------+----------
         1 |    96,030        814 |    96,844 
           |      0.61       0.36 |      0.61 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic |    outcome: worms
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,534,080    222,675 |15,756,755 
           |     99.03      99.30 |     99.03 
-----------+----------------------+----------
         1 |   152,059      1,573 |   153,632 
           |      0.97       0.70 |      0.97 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or |    outcome: worms
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |15,333,022    222,359 |15,555,381 
           |     97.75      99.16 |     97.77 
-----------+----------------------+----------
         1 |   353,117      1,889 |   355,006 
           |      2.25       0.84 |      2.23 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Calculated |    outcome: worms
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,645         58 |    10,703 
           |      0.10       0.04 |      0.09 
-----------+----------------------+----------
        15 |    45,197        154 |    45,351 
           |      0.41       0.10 |      0.40 
-----------+----------------------+----------
        30 |   198,423        582 |   199,005 
           |      1.78       0.36 |      1.76 
-----------+----------------------+----------
        45 |   625,772      2,465 |   628,237 
           |      5.61       1.54 |      5.55 
-----------+----------------------+----------
        60 |10,275,135    157,144 |10,432,279 
           |     92.11      97.97 |     92.19 
-----------+----------------------+----------
     Total |11,155,172    160,403 |11,315,575 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney |    outcome: worms
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |14,806,102    220,989 |15,027,091 
                      |     94.39      98.55 |     94.45 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   824,195      3,047 |   827,242 
                      |      5.25       1.36 |      5.20 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    55,842        212 |    56,054 
                      |      0.36       0.09 |      0.35 
----------------------+----------------------+----------
                Total |15,686,139    224,248 |15,910,387 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi |    outcome: worms
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |12,381,631    204,997 |12,586,628 
           |     78.93      91.42 |     79.11 
-----------+----------------------+----------
         1 | 3,304,508     19,251 | 3,323,759 
           |     21.07       8.58 |     20.89 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune |    outcome: worms
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |14,892,955    212,221 |15,105,176 
           |     94.94      94.64 |     94.94 
-----------+----------------------+----------
         1 |   793,184     12,027 |   805,211 
           |      5.06       5.36 |      5.06 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 
10

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation |    outcome: worms
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 3,301,431     41,899 | 3,343,330 
                 |     21.05      18.68 |     21.01 
-----------------+----------------------+----------
               2 | 3,325,501     44,323 | 3,369,824 
                 |     21.20      19.77 |     21.18 
-----------------+----------------------+----------
               3 | 3,199,314     45,114 | 3,244,428 
                 |     20.40      20.12 |     20.39 
-----------------+----------------------+----------
               4 | 3,151,400     48,759 | 3,200,159 
                 |     20.09      21.74 |     20.11 
-----------------+----------------------+----------
 5 most deprived | 2,708,493     44,153 | 2,752,646 
                 |     17.27      19.69 |     17.30 
-----------------+----------------------+----------
           Total |15,686,139    224,248 |15,910,387 
                 |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: worms
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |10,126,291    144,193 |10,270,484 
                      |     64.56      64.30 |     64.55 
----------------------+----------------------+----------
                Mixed |   173,677      2,131 |   175,808 
                      |      1.11       0.95 |      1.10 
----------------------+----------------------+----------
Asian or Asian Britis |   960,414      7,123 |   967,537 
                      |      6.12       3.18 |      6.08 
----------------------+----------------------+----------
                Black |   346,818      3,058 |   349,876 
                      |      2.21       1.36 |      2.20 
----------------------+----------------------+----------
                Other |   327,764      1,917 |   329,681 
                      |      2.09       0.85 |      2.07 
----------------------+----------------------+----------
              Unknown | 3,751,175     65,826 | 3,817,001 
                      |     23.91      29.35 |     23.99 
----------------------+----------------------+----------
                Total |15,686,139    224,248 |15,910,387 
                      |    100.00     100.00 |    100.00 
10

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi |    outcome: worms
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |   793,248      9,084 |   802,332 
           |      5.06       4.05 |      5.04 
-----------+----------------------+----------
         2 | 1,400,320     19,330 | 1,419,650 
           |      8.93       8.62 |      8.92 
-----------+----------------------+----------
         3 |   656,800     10,367 |   667,167 
           |      4.19       4.62 |      4.19 
-----------+----------------------+----------
         4 |   147,272      1,972 |   149,244 
           |      0.94       0.88 |      0.94 
-----------+----------------------+----------
         5 |   103,653      1,645 |   105,298 
           |      0.66       0.73 |      0.66 
-----------+----------------------+----------
         6 |   703,989     10,622 |   714,611 
           |      4.49       4.74 |      4.49 
-----------+----------------------+----------
         7 |    41,076        377 |    41,453 
           |      0.26       0.17 |      0.26 
-----------+----------------------+----------
         8 |   561,277      9,932 |   571,209 
           |      3.58       4.43 |      3.59 
-----------+----------------------+----------
         9 |   454,596      7,208 |   461,804 
           |      2.90       3.21 |      2.90 
-----------+----------------------+----------
        10 |   605,093      8,607 |   613,700 
           |      3.86       3.84 |      3.86 
-----------+----------------------+----------
        11 |   655,858      9,036 |   664,894 
           |      4.18       4.03 |      4.18 
-----------+----------------------+----------
        12 |   213,358      2,197 |   215,555 
           |      1.36       0.98 |      1.35 
-----------+----------------------+----------
        13 |   318,316      5,033 |   323,349 
           |      2.03       2.24 |      2.03 
-----------+----------------------+----------
        14 |   403,593      6,147 |   409,740 
           |      2.57       2.74 |      2.58 
-----------+----------------------+----------
        15 |   524,473      9,147 |   533,620 
           |      3.34       4.08 |      3.35 
-----------+----------------------+----------
        16 |   571,088     10,069 |   581,157 
           |      3.64       4.49 |      3.65 
-----------+----------------------+----------
        17 |   472,254      7,972 |   480,226 
           |      3.01       3.55 |      3.02 
-----------+----------------------+----------
        18 |   636,821     10,234 |   647,055 
           |      4.06       4.56 |      4.07 
-----------+----------------------+----------
        19 |   504,956      6,143 |   511,099 
           |      3.22       2.74 |      3.21 
-----------+----------------------+----------
        20 |   752,075      8,356 |   760,431 
           |      4.79       3.73 |      4.78 
-----------+----------------------+----------
        21 | 1,021,351      8,371 | 1,029,722 
           |      6.51       3.73 |      6.47 
-----------+----------------------+----------
        22 |    66,993        600 |    67,593 
           |      0.43       0.27 |      0.42 
-----------+----------------------+----------
        23 |   579,219      7,463 |   586,682 
           |      3.69       3.33 |      3.69 
-----------+----------------------+----------
        24 |    28,749        403 |    29,152 
           |      0.18       0.18 |      0.18 
-----------+----------------------+----------
        25 |   130,188      1,458 |   131,646 
           |      0.83       0.65 |      0.83 
-----------+----------------------+----------
        26 |   501,448      7,636 |   509,084 
           |      3.20       3.41 |      3.20 
-----------+----------------------+----------
        27 |   584,628      7,814 |   592,442 
           |      3.73       3.48 |      3.72 
-----------+----------------------+----------
        28 |   505,532      6,012 |   511,544 
           |      3.22       2.68 |      3.22 
-----------+----------------------+----------
        29 |   389,953      6,004 |   395,957 
           |      2.49       2.68 |      2.49 
-----------+----------------------+----------
        30 |   285,892      4,396 |   290,288 
           |      1.82       1.96 |      1.82 
-----------+----------------------+----------
        31 |    18,314        155 |    18,469 
           |      0.12       0.07 |      0.12 
-----------+----------------------+----------
        32 | 1,053,756     20,458 | 1,074,214 
           |      6.72       9.12 |      6.75 
-----------+----------------------+----------
     Total |15,686,139    224,248 |15,910,387 
           |    100.00     100.00 |    100.00 

. 
. 
. ********************************************
. *  Cumulative incidence of WORMS
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_worms.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  worms
   analysis time _t:  (stime_worms-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.6e+06       89              0.0001    0.0000     0.0000    0.0001
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80   1.5e+06       38              0.0000    0.0000     0.0000    0.0000
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.4e+06      107              0.0001    0.0000     0.0001    0.0001
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06       38              0.0000    0.0000     0.0000    0.0000
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.2e+06       42              0.0000    0.0000     0.0000    0.0000
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06       33              0.0000    0.0000     0.0000    0.0000
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06       27              0.0000    0.0000     0.0000    0.0000
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06       26              0.0000    0.0000     0.0000    0.0000
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80   1.1e+06       15              0.0000    0.0000     0.0000    0.0000
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80   1.0e+06       13              0.0000    0.0000     0.0000    0.0000
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    870755        8              0.0000    0.0000     0.0000    0.0000
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    785369        6              0.0000    0.0000     0.0000    0.0000
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    503175        1              0.0000    0.0000     0.0000    0.0000
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    356180        2              0.0000    0.0000     0.0000    0.0000
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\WORMS_04a_a
> n_descriptive_safetables.log
  log type:  text
 closed on:  16 Jul 2020, 11:26:58
-------------------------------------------------------------------------------
