--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\04a_an_descriptive_tables.log
  log type:  text
 opened on:  15 Jul 2020, 00:05:31

. 
. use $tempdir\analysis_dataset, clear

. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 16,340,834    48.85266    18.98495         18        110

. safetab agegroup
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  3,113,091       19.05       19.05
     30-<40 |  2,947,941       18.04       37.09
     40-<50 |  2,596,167       15.89       52.98
     50-<60 |  2,696,558       16.50       69.48
     60-<70 |  2,163,285       13.24       82.72
     70-<80 |  1,765,739       10.81       93.53
        80+ |  1,058,053        6.47      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00

. safetab age66
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,914,044       79.03       79.03
          1 |  3,426,790       20.97      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00

. safetab male
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,295,777       50.77       50.77
          1 |  8,045,057       49.23      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00

. safetab bmicat
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    311,277        2.41        2.41
  Normal (18.5-24.9) |  4,666,243       36.09       38.50
Overweight (25-29.9) |  4,421,741       34.20       72.70
   Obese I (30-34.9) |  2,230,841       17.25       89.95
  Obese II (35-39.9) |    863,897        6.68       96.63
     Obese III (40+) |    435,638        3.37      100.00
---------------------+-----------------------------------
               Total | 12,929,637      100.00

. safetab bmicat, m
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    311,277        1.90        1.90
  Normal (18.5-24.9) |  4,666,243       28.56       30.46
Overweight (25-29.9) |  4,421,741       27.06       57.52
   Obese I (30-34.9) |  2,230,841       13.65       71.17
  Obese II (35-39.9) |    863,897        5.29       76.46
     Obese III (40+) |    435,638        2.67       79.12
        Unknown (.u) |  3,411,197       20.88      100.00
---------------------+-----------------------------------
               Total | 16,340,834      100.00

. safetab obese4cat
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity | 12,810,458       78.40       78.40
   Obese I (30-34.9) |  2,230,841       13.65       92.05
  Obese II (35-39.9) |    863,897        5.29       97.33
     Obese III (40+) |    435,638        2.67      100.00
---------------------+-----------------------------------
               Total | 16,340,834      100.00

. safetab smoke
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  7,474,961       47.90       47.90
      Former |  5,276,611       33.81       81.71
     Current |  2,853,987       18.29      100.00
-------------+-----------------------------------
       Total | 15,605,559      100.00

. safetab smoke, m
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  7,474,961       45.74       45.74
      Former |  5,276,611       32.29       78.04
     Current |  2,853,987       17.47       95.50
Unknown (.u) |    735,275        4.50      100.00
-------------+-----------------------------------
       Total | 16,340,834      100.00

. safetab bpcat
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,681,738       25.28       25.28
      Elevated |  2,332,002       16.02       41.30
 High, stage I |  5,139,719       35.30       76.60
High, stage II |  3,407,786       23.40      100.00
---------------+-----------------------------------
         Total | 14,561,245      100.00

. safetab bpcat, m
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,681,738       22.53       22.53
      Elevated |  2,332,002       14.27       36.80
 High, stage I |  5,139,719       31.45       68.26
High, stage II |  3,407,786       20.85       89.11
       Unknown |  1,779,589       10.89      100.00
---------------+-----------------------------------
         Total | 16,340,834      100.00

. safetab htdiag_or_highbp
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,905,576       66.74       66.74
          1 |  5,435,258       33.26      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00

. ta shield

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,523,665       76.64       76.64
          1 |  3,817,169       23.36      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00

. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 organ_trans                     /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2.                                                 
. safetab `var'
  3. }
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,672,378       95.91       95.91
          1 |    668,456        4.09      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 13,752,373       84.16       84.16
          1 |  2,588,461       15.84      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,233,713       93.22       93.22
          1 |  1,107,121        6.78      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00
0

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 14,699,728       89.96       89.96
          1 |  1,641,106       10.04      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 15,559,284       95.22       95.22
    Last year |     72,840        0.45       95.66
2-5 years ago |    212,154        1.30       96.96
     5+ years |    496,556        3.04      100.00
--------------+-----------------------------------
        Total | 16,340,834      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 16,248,715       99.44       99.44
    Last year |      8,272        0.05       99.49
2-5 years ago |     25,572        0.16       99.64
     5+ years |     58,275        0.36      100.00
--------------+-----------------------------------
        Total | 16,340,834      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,292,663       99.71       99.71
          1 |     48,171        0.29      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00
0

Solid organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,322,202       99.89       99.89
          1 |     18,632        0.11      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,317,679       99.86       99.86
          1 |     23,155        0.14      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,241,875       99.39       99.39
          1 |     98,959        0.61      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,177,112       99.00       99.00
          1 |    163,722        1.00      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,952,819       97.63       97.63
          1 |    388,015        2.37      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,917        0.12        0.12
         15 |     59,435        0.50        0.61
         30 |    238,572        1.99        2.60
         45 |    690,029        5.75        8.36
         60 | 10,988,240       91.64      100.00
------------+-----------------------------------
      Total | 11,990,193      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None | 15,338,881       93.87       93.87
Stage 3a/3b egfr 30-60       |    928,601        5.68       99.55
           Stage 4/5 egfr<30 |     73,352        0.45      100.00
-----------------------------+-----------------------------------
                       Total | 16,340,834      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,943,256       79.21       79.21
          1 |  3,397,578       20.79      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,524,609       95.00       95.00
          1 |    816,225        5.00      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00

. 
. safetab imd 
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  3,445,723       21.09       21.09
               2 |  3,387,653       20.73       41.82
               3 |  3,410,175       20.87       62.69
               4 |  3,277,920       20.06       82.75
 5 most deprived |  2,819,363       17.25      100.00
-----------------+-----------------------------------
           Total | 16,340,834      100.00

. safetab imd, m
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  3,445,723       21.09       21.09
               2 |  3,387,653       20.73       41.82
               3 |  3,410,175       20.87       62.69
               4 |  3,277,920       20.06       82.75
 5 most deprived |  2,819,363       17.25      100.00
-----------------+-----------------------------------
           Total | 16,340,834      100.00

. safetab ethnicity
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White | 10,468,113       84.51       84.51
                 Mixed |    183,139        1.48       85.98
Asian or Asian British |  1,026,223        8.28       94.27
                 Black |    362,669        2.93       97.20
                 Other |    347,422        2.80      100.00
-----------------------+-----------------------------------
                 Total | 12,387,566      100.00

. safetab ethnicity, m
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White | 10,468,113       64.06       64.06
                 Mixed |    183,139        1.12       65.18
Asian or Asian British |  1,026,223        6.28       71.46
                 Black |    362,669        2.22       73.68
                 Other |    347,422        2.13       75.81
               Unknown |  3,953,268       24.19      100.00
-----------------------+-----------------------------------
                 Total | 16,340,834      100.00

. safetab stp
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    185,629        1.14        1.14
          2 |  1,499,542        9.18       10.31
          3 |    701,065        4.29       14.60
          4 |    158,721        0.97       15.57
          5 |    111,693        0.68       16.26
          6 |    754,673        4.62       20.88
          7 |     45,115        0.28       21.15
          8 |    598,246        3.66       24.81
          9 |    486,328        2.98       27.79
         10 |    645,417        3.95       31.74
         11 |    714,704        4.37       36.11
         12 |    231,433        1.42       37.53
         13 |    349,373        2.14       39.67
         14 |    437,171        2.68       42.34
         15 |    579,455        3.55       45.89
         16 |    612,932        3.75       49.64
         17 |    509,443        3.12       52.76
         18 |    690,518        4.23       56.98
         19 |    543,790        3.33       60.31
         20 |    797,931        4.88       65.19
         21 |  1,209,297        7.40       72.59
         22 |     76,353        0.47       73.06
         23 |    630,810        3.86       76.92
         24 |     31,193        0.19       77.11
         25 |    142,718        0.87       77.99
         26 |    541,563        3.31       81.30
         27 |    629,678        3.85       85.15
         28 |    542,943        3.32       88.48
         29 |    427,789        2.62       91.09
         30 |    309,789        1.90       92.99
         31 |     19,659        0.12       93.11
         32 |  1,125,863        6.89      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00

. 
. 
. * Outcomes
. safetab covid_death_itu
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  death/ITU |
       adm. |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,276,582       99.61       99.61
          1 |     64,252        0.39      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00

. safetab covid_tpp_prob_or_susp
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
 prob/susp. |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,688,365       96.01       96.01
          1 |    652,469        3.99      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00

. safetab covid_tpp_prob
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,295,177       99.72       99.72
          1 |     45,657        0.28      100.00
------------+-----------------------------------
      Total | 16,340,834      100.00

. 
. 
. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist covid_tpp_prob covid_death_itu covid_tpp_prob_or_susp {
  2. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                        `outvar', col
  3.         safetab male                                                            `outvar', col
  4.         safetab bmicat                                                          `outvar', col m 
  5.         safetab smoke                                                           `outvar', col m
  6.         safetab obese4cat                                                       `outvar', col m 
  7.         safetab shield                                                          `outvar', col m 
  8. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 organ_trans                     /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  9.         safetab `var'           `outvar', col
 10. }
 11.         
.         safetab imd                                                             `outvar', col m
 12.         safetab ethnicity                                                       `outvar', col m
 13.         *safetab urban                                                          `outvar', col
.         safetab stp                                                             `outvar', col
 14. }
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 3,109,739      3,352 | 3,113,091 
           |     19.08       7.34 |     19.05 
-----------+----------------------+----------
    30-<40 | 2,943,428      4,513 | 2,947,941 
           |     18.06       9.88 |     18.04 
-----------+----------------------+----------
    40-<50 | 2,590,793      5,374 | 2,596,167 
           |     15.90      11.77 |     15.89 
-----------+----------------------+----------
    50-<60 | 2,689,568      6,990 | 2,696,558 
           |     16.51      15.31 |     16.50 
-----------+----------------------+----------
    60-<70 | 2,157,464      5,821 | 2,163,285 
           |     13.24      12.75 |     13.24 
-----------+----------------------+----------
    70-<80 | 1,758,700      7,039 | 1,765,739 
           |     10.79      15.42 |     10.81 
-----------+----------------------+----------
       80+ | 1,045,485     12,568 | 1,058,053 
           |      6.42      27.53 |      6.47 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,270,431     25,346 | 8,295,777 
           |     50.75      55.51 |     50.77 
-----------+----------------------+----------
         1 | 8,024,746     20,311 | 8,045,057 
           |     49.25      44.49 |     49.23 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   309,708      1,569 |   311,277 
                     |      1.90       3.44 |      1.90 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 4,653,647     12,596 | 4,666,243 
                     |     28.56      27.59 |     28.56 
---------------------+----------------------+----------
Overweight (25-29.9) | 4,408,738     13,003 | 4,421,741 
                     |     27.06      28.48 |     27.06 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,222,931      7,910 | 2,230,841 
                     |     13.64      17.32 |     13.65 
---------------------+----------------------+----------
  Obese II (35-39.9) |   860,339      3,558 |   863,897 
                     |      5.28       7.79 |      5.29 
---------------------+----------------------+----------
     Obese III (40+) |   433,530      2,108 |   435,638 
                     |      2.66       4.62 |      2.67 
---------------------+----------------------+----------
        Unknown (.u) | 3,406,284      4,913 | 3,411,197 
                     |     20.90      10.76 |     20.88 
---------------------+----------------------+----------
               Total |16,295,177     45,657 |16,340,834 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 7,455,245     19,716 | 7,474,961 
             |     45.75      43.18 |     45.74 
-------------+----------------------+----------
      Former | 5,255,975     20,636 | 5,276,611 
             |     32.25      45.20 |     32.29 
-------------+----------------------+----------
     Current | 2,849,444      4,543 | 2,853,987 
             |     17.49       9.95 |     17.47 
-------------+----------------------+----------
Unknown (.u) |   734,513        762 |   735,275 
             |      4.51       1.67 |      4.50 
-------------+----------------------+----------
       Total |16,295,177     45,657 |16,340,834 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |12,778,377     32,081 |12,810,458 
                     |     78.42      70.27 |     78.40 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,222,931      7,910 | 2,230,841 
                     |     13.64      17.32 |     13.65 
---------------------+----------------------+----------
  Obese II (35-39.9) |   860,339      3,558 |   863,897 
                     |      5.28       7.79 |      5.29 
---------------------+----------------------+----------
     Obese III (40+) |   433,530      2,108 |   435,638 
                     |      2.66       4.62 |      2.67 
---------------------+----------------------+----------
               Total |16,295,177     45,657 |16,340,834 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |12,495,417     28,248 |12,523,665 
           |     76.68      61.87 |     76.64 
-----------+----------------------+----------
         1 | 3,799,760     17,409 | 3,817,169 
           |     23.32      38.13 |     23.36 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |15,632,891     39,487 |15,672,378 
           |     95.94      86.49 |     95.91 
-----------+----------------------+----------
         1 |   662,286      6,170 |   668,456 
           |      4.06      13.51 |      4.09 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |13,715,221     37,152 |13,752,373 
           |     84.17      81.37 |     84.16 
-----------+----------------------+----------
         1 | 2,579,956      8,505 | 2,588,461 
           |     15.83      18.63 |     15.84 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |15,197,444     36,269 |15,233,713 
           |     93.26      79.44 |     93.22 
-----------+----------------------+----------
         1 | 1,097,733      9,388 | 1,107,121 
           |      6.74      20.56 |      6.78 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |14,665,552     34,176 |14,699,728 
           |     90.00      74.85 |     89.96 
-----------+----------------------+----------
         1 | 1,629,625     11,481 | 1,641,106 
           |     10.00      25.15 |     10.04 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |15,518,268     41,016 |15,559,284 
              |     95.23      89.84 |     95.22 
--------------+----------------------+----------
    Last year |    72,306        534 |    72,840 
              |      0.44       1.17 |      0.45 
--------------+----------------------+----------
2-5 years ago |   211,013      1,141 |   212,154 
              |      1.29       2.50 |      1.30 
--------------+----------------------+----------
     5+ years |   493,590      2,966 |   496,556 
              |      3.03       6.50 |      3.04 
--------------+----------------------+----------
        Total |16,295,177     45,657 |16,340,834 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |16,203,904     44,811 |16,248,715 
              |     99.44      98.15 |     99.44 
--------------+----------------------+----------
    Last year |     8,147        125 |     8,272 
              |      0.05       0.27 |      0.05 
--------------+----------------------+----------
2-5 years ago |    25,318        254 |    25,572 
              |      0.16       0.56 |      0.16 
--------------+----------------------+----------
     5+ years |    57,808        467 |    58,275 
              |      0.35       1.02 |      0.36 
--------------+----------------------+----------
        Total |16,295,177     45,657 |16,340,834 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |16,247,332     45,331 |16,292,663 
           |     99.71      99.29 |     99.71 
-----------+----------------------+----------
         1 |    47,845        326 |    48,171 
           |      0.29       0.71 |      0.29 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |16,276,788     45,414 |16,322,202 
           |     99.89      99.47 |     99.89 
-----------+----------------------+----------
         1 |    18,389        243 |    18,632 
           |      0.11       0.53 |      0.11 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |16,272,199     45,480 |16,317,679 
           |     99.86      99.61 |     99.86 
-----------+----------------------+----------
         1 |    22,978        177 |    23,155 
           |      0.14       0.39 |      0.14 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |16,196,924     44,951 |16,241,875 
           |     99.40      98.45 |     99.39 
-----------+----------------------+----------
         1 |    98,253        706 |    98,959 
           |      0.60       1.55 |      0.61 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |16,133,156     43,956 |16,177,112 
           |     99.01      96.27 |     99.00 
-----------+----------------------+----------
         1 |   162,021      1,701 |   163,722 
           |      0.99       3.73 |      1.00 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |15,912,795     40,024 |15,952,819 
           |     97.65      87.66 |     97.63 
-----------+----------------------+----------
         1 |   382,382      5,633 |   388,015 
           |      2.35      12.34 |      2.37 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,454        463 |    13,917 
           |      0.11       1.12 |      0.12 
-----------+----------------------+----------
        15 |    58,465        970 |    59,435 
           |      0.49       2.35 |      0.50 
-----------+----------------------+----------
        30 |   235,561      3,011 |   238,572 
           |      1.97       7.30 |      1.99 
-----------+----------------------+----------
        45 |   684,914      5,115 |   690,029 
           |      5.73      12.40 |      5.75 
-----------+----------------------+----------
        60 |10,956,542     31,698 |10,988,240 
           |     91.69      76.83 |     91.64 
-----------+----------------------+----------
     Total |11,948,936     41,257 |11,990,193 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |15,302,783     36,098 |15,338,881 
                      |     93.91      79.06 |     93.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   920,475      8,126 |   928,601 
                      |      5.65      17.80 |      5.68 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    71,919      1,433 |    73,352 
                      |      0.44       3.14 |      0.45 
----------------------+----------------------+----------
                Total |16,295,177     45,657 |16,340,834 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |12,917,366     25,890 |12,943,256 
           |     79.27      56.71 |     79.21 
-----------+----------------------+----------
         1 | 3,377,811     19,767 | 3,397,578 
           |     20.73      43.29 |     20.79 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,482,561     42,048 |15,524,609 
           |     95.01      92.10 |     95.00 
-----------+----------------------+----------
         1 |   812,616      3,609 |   816,225 
           |      4.99       7.90 |      5.00 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 3,437,441      8,282 | 3,445,723 
                 |     21.09      18.14 |     21.09 
-----------------+----------------------+----------
               2 | 3,378,760      8,893 | 3,387,653 
                 |     20.73      19.48 |     20.73 
-----------------+----------------------+----------
               3 | 3,401,343      8,832 | 3,410,175 
                 |     20.87      19.34 |     20.87 
-----------------+----------------------+----------
               4 | 3,268,051      9,869 | 3,277,920 
                 |     20.06      21.62 |     20.06 
-----------------+----------------------+----------
 5 most deprived | 2,809,582      9,781 | 2,819,363 
                 |     17.24      21.42 |     17.25 
-----------------+----------------------+----------
           Total |16,295,177     45,657 |16,340,834 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |10,439,638     28,475 |10,468,113 
                      |     64.07      62.37 |     64.06 
----------------------+----------------------+----------
                Mixed |   182,673        466 |   183,139 
                      |      1.12       1.02 |      1.12 
----------------------+----------------------+----------
Asian or Asian Britis | 1,021,740      4,483 | 1,026,223 
                      |      6.27       9.82 |      6.28 
----------------------+----------------------+----------
                Black |   361,295      1,374 |   362,669 
                      |      2.22       3.01 |      2.22 
----------------------+----------------------+----------
                Other |   346,676        746 |   347,422 
                      |      2.13       1.63 |      2.13 
----------------------+----------------------+----------
              Unknown | 3,943,155     10,113 | 3,953,268 
                      |     24.20      22.15 |     24.19 
----------------------+----------------------+----------
                Total |16,295,177     45,657 |16,340,834 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |   184,722        907 |   185,629 
           |      1.13       1.99 |      1.14 
-----------+----------------------+----------
         2 | 1,494,361      5,181 | 1,499,542 
           |      9.17      11.35 |      9.18 
-----------+----------------------+----------
         3 |   699,309      1,756 |   701,065 
           |      4.29       3.85 |      4.29 
-----------+----------------------+----------
         4 |   158,232        489 |   158,721 
           |      0.97       1.07 |      0.97 
-----------+----------------------+----------
         5 |   111,105        588 |   111,693 
           |      0.68       1.29 |      0.68 
-----------+----------------------+----------
         6 |   751,930      2,743 |   754,673 
           |      4.61       6.01 |      4.62 
-----------+----------------------+----------
         7 |    44,956        159 |    45,115 
           |      0.28       0.35 |      0.28 
-----------+----------------------+----------
         8 |   596,492      1,754 |   598,246 
           |      3.66       3.84 |      3.66 
-----------+----------------------+----------
         9 |   485,430        898 |   486,328 
           |      2.98       1.97 |      2.98 
-----------+----------------------+----------
        10 |   643,749      1,668 |   645,417 
           |      3.95       3.65 |      3.95 
-----------+----------------------+----------
        11 |   712,084      2,620 |   714,704 
           |      4.37       5.74 |      4.37 
-----------+----------------------+----------
        12 |   230,648        785 |   231,433 
           |      1.42       1.72 |      1.42 
-----------+----------------------+----------
        13 |   348,582        791 |   349,373 
           |      2.14       1.73 |      2.14 
-----------+----------------------+----------
        14 |   436,099      1,072 |   437,171 
           |      2.68       2.35 |      2.68 
-----------+----------------------+----------
        15 |   578,091      1,364 |   579,455 
           |      3.55       2.99 |      3.55 
-----------+----------------------+----------
        16 |   611,284      1,648 |   612,932 
           |      3.75       3.61 |      3.75 
-----------+----------------------+----------
        17 |   508,335      1,108 |   509,443 
           |      3.12       2.43 |      3.12 
-----------+----------------------+----------
        18 |   687,564      2,954 |   690,518 
           |      4.22       6.47 |      4.23 
-----------+----------------------+----------
        19 |   542,617      1,173 |   543,790 
           |      3.33       2.57 |      3.33 
-----------+----------------------+----------
        20 |   794,556      3,375 |   797,931 
           |      4.88       7.39 |      4.88 
-----------+----------------------+----------
        21 | 1,206,396      2,901 | 1,209,297 
           |      7.40       6.35 |      7.40 
-----------+----------------------+----------
        22 |    76,196        157 |    76,353 
           |      0.47       0.34 |      0.47 
-----------+----------------------+----------
        23 |   629,385      1,425 |   630,810 
           |      3.86       3.12 |      3.86 
-----------+----------------------+----------
        24 |    31,076        117 |    31,193 
           |      0.19       0.26 |      0.19 
-----------+----------------------+----------
        25 |   142,520        198 |   142,718 
           |      0.87       0.43 |      0.87 
-----------+----------------------+----------
        26 |   540,507      1,056 |   541,563 
           |      3.32       2.31 |      3.31 
-----------+----------------------+----------
        27 |   628,657      1,021 |   629,678 
           |      3.86       2.24 |      3.85 
-----------+----------------------+----------
        28 |   542,269        674 |   542,943 
           |      3.33       1.48 |      3.32 
-----------+----------------------+----------
        29 |   426,801        988 |   427,789 
           |      2.62       2.16 |      2.62 
-----------+----------------------+----------
        30 |   309,193        596 |   309,789 
           |      1.90       1.31 |      1.90 
-----------+----------------------+----------
        31 |    19,635         24 |    19,659 
           |      0.12       0.05 |      0.12 
-----------+----------------------+----------
        32 | 1,122,396      3,467 | 1,125,863 
           |      6.89       7.59 |      6.89 
-----------+----------------------+----------
     Total |16,295,177     45,657 |16,340,834 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |    death/ITU adm.
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 3,112,931        160 | 3,113,091 
           |     19.13       0.25 |     19.05 
-----------+----------------------+----------
    30-<40 | 2,947,472        469 | 2,947,941 
           |     18.11       0.73 |     18.04 
-----------+----------------------+----------
    40-<50 | 2,594,900      1,267 | 2,596,167 
           |     15.94       1.97 |     15.89 
-----------+----------------------+----------
    50-<60 | 2,693,053      3,505 | 2,696,558 
           |     16.55       5.46 |     16.50 
-----------+----------------------+----------
    60-<70 | 2,156,359      6,926 | 2,163,285 
           |     13.25      10.78 |     13.24 
-----------+----------------------+----------
    70-<80 | 1,751,564     14,175 | 1,765,739 
           |     10.76      22.06 |     10.81 
-----------+----------------------+----------
       80+ | 1,020,303     37,750 | 1,058,053 
           |      6.27      58.75 |      6.47 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    death/ITU adm.
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,263,029     32,748 | 8,295,777 
           |     50.77      50.97 |     50.77 
-----------+----------------------+----------
         1 | 8,013,553     31,504 | 8,045,057 
           |     49.23      49.03 |     49.23 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |    death/ITU adm.
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   306,276      5,001 |   311,277 
                     |      1.88       7.78 |      1.90 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 4,642,830     23,413 | 4,666,243 
                     |     28.52      36.44 |     28.56 
---------------------+----------------------+----------
Overweight (25-29.9) | 4,405,455     16,286 | 4,421,741 
                     |     27.07      25.35 |     27.06 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,223,016      7,825 | 2,230,841 
                     |     13.66      12.18 |     13.65 
---------------------+----------------------+----------
  Obese II (35-39.9) |   860,961      2,936 |   863,897 
                     |      5.29       4.57 |      5.29 
---------------------+----------------------+----------
     Obese III (40+) |   434,095      1,543 |   435,638 
                     |      2.67       2.40 |      2.67 
---------------------+----------------------+----------
        Unknown (.u) | 3,403,949      7,248 | 3,411,197 
                     |     20.91      11.28 |     20.88 
---------------------+----------------------+----------
               Total |16,276,582     64,252 |16,340,834 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |    death/ITU adm.
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 7,453,813     21,148 | 7,474,961 
             |     45.79      32.91 |     45.74 
-------------+----------------------+----------
      Former | 5,241,998     34,613 | 5,276,611 
             |     32.21      53.87 |     32.29 
-------------+----------------------+----------
     Current | 2,846,184      7,803 | 2,853,987 
             |     17.49      12.14 |     17.47 
-------------+----------------------+----------
Unknown (.u) |   734,587        688 |   735,275 
             |      4.51       1.07 |      4.50 
-------------+----------------------+----------
       Total |16,276,582     64,252 |16,340,834 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |    death/ITU adm.
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |12,758,510     51,948 |12,810,458 
                     |     78.39      80.85 |     78.40 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,223,016      7,825 | 2,230,841 
                     |     13.66      12.18 |     13.65 
---------------------+----------------------+----------
  Obese II (35-39.9) |   860,961      2,936 |   863,897 
                     |      5.29       4.57 |      5.29 
---------------------+----------------------+----------
     Obese III (40+) |   434,095      1,543 |   435,638 
                     |      2.67       2.40 |      2.67 
---------------------+----------------------+----------
               Total |16,276,582     64,252 |16,340,834 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
  Probable |    death/ITU adm.
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |12,495,105     28,560 |12,523,665 
           |     76.77      44.45 |     76.64 
-----------+----------------------+----------
         1 | 3,781,477     35,692 | 3,817,169 
           |     23.23      55.55 |     23.36 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |    death/ITU adm.
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |15,622,284     50,094 |15,672,378 
           |     95.98      77.96 |     95.91 
-----------+----------------------+----------
         1 |   654,298     14,158 |   668,456 
           |      4.02      22.04 |      4.09 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |    death/ITU adm.
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |13,696,372     56,001 |13,752,373 
           |     84.15      87.16 |     84.16 
-----------+----------------------+----------
         1 | 2,580,210      8,251 | 2,588,461 
           |     15.85      12.84 |     15.84 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |    death/ITU adm.
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |15,193,103     40,610 |15,233,713 
           |     93.34      63.20 |     93.22 
-----------+----------------------+----------
         1 | 1,083,479     23,642 | 1,107,121 
           |      6.66      36.80 |      6.78 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    death/ITU adm.
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |14,654,470     45,258 |14,699,728 
           |     90.03      70.44 |     89.96 
-----------+----------------------+----------
         1 | 1,622,112     18,994 | 1,641,106 
           |      9.97      29.56 |     10.04 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |    death/ITU adm.
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |15,513,767     45,517 |15,559,284 
              |     95.31      70.84 |     95.22 
--------------+----------------------+----------
    Last year |    67,952      4,888 |    72,840 
              |      0.42       7.61 |      0.45 
--------------+----------------------+----------
2-5 years ago |   206,871      5,283 |   212,154 
              |      1.27       8.22 |      1.30 
--------------+----------------------+----------
     5+ years |   487,992      8,564 |   496,556 
              |      3.00      13.33 |      3.04 
--------------+----------------------+----------
        Total |16,276,582     64,252 |16,340,834 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |    death/ITU adm.
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |16,186,598     62,117 |16,248,715 
              |     99.45      96.68 |     99.44 
--------------+----------------------+----------
    Last year |     7,832        440 |     8,272 
              |      0.05       0.68 |      0.05 
--------------+----------------------+----------
2-5 years ago |    24,894        678 |    25,572 
              |      0.15       1.06 |      0.16 
--------------+----------------------+----------
     5+ years |    57,258      1,017 |    58,275 
              |      0.35       1.58 |      0.36 
--------------+----------------------+----------
        Total |16,276,582     64,252 |16,340,834 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |    death/ITU adm.
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |16,228,729     63,934 |16,292,663 
           |     99.71      99.51 |     99.71 
-----------+----------------------+----------
         1 |    47,853        318 |    48,171 
           |      0.29       0.49 |      0.29 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |    outcome: covid
     organ |    death/ITU adm.
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |16,258,171     64,031 |16,322,202 
           |     99.89      99.66 |     99.89 
-----------+----------------------+----------
         1 |    18,411        221 |    18,632 
           |      0.11       0.34 |      0.11 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    death/ITU adm.
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |16,253,709     63,970 |16,317,679 
           |     99.86      99.56 |     99.86 
-----------+----------------------+----------
         1 |    22,873        282 |    23,155 
           |      0.14       0.44 |      0.14 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |    death/ITU adm.
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |16,179,443     62,432 |16,241,875 
           |     99.40      97.17 |     99.39 
-----------+----------------------+----------
         1 |    97,139      1,820 |    98,959 
           |      0.60       2.83 |      0.61 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |    death/ITU adm.
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |16,116,394     60,718 |16,177,112 
           |     99.02      94.50 |     99.00 
-----------+----------------------+----------
         1 |   160,188      3,534 |   163,722 
           |      0.98       5.50 |      1.00 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |    death/ITU adm.
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |15,902,174     50,645 |15,952,819 
           |     97.70      78.82 |     97.63 
-----------+----------------------+----------
         1 |   374,408     13,607 |   388,015 
           |      2.30      21.18 |      2.37 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |    death/ITU adm.
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,887      1,030 |    13,917 
           |      0.11       1.67 |      0.12 
-----------+----------------------+----------
        15 |    55,573      3,862 |    59,435 
           |      0.47       6.27 |      0.50 
-----------+----------------------+----------
        30 |   229,566      9,006 |   238,572 
           |      1.92      14.63 |      1.99 
-----------+----------------------+----------
        45 |   677,721     12,308 |   690,029 
           |      5.68      19.99 |      5.75 
-----------+----------------------+----------
        60 |10,952,872     35,368 |10,988,240 
           |     91.82      57.44 |     91.64 
-----------+----------------------+----------
     Total |11,928,619     61,574 |11,990,193 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |    death/ITU adm.
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |15,300,835     38,046 |15,338,881 
                      |     94.01      59.21 |     93.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   907,287     21,314 |   928,601 
                      |      5.57      33.17 |      5.68 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    68,460      4,892 |    73,352 
                      |      0.42       7.61 |      0.45 
----------------------+----------------------+----------
                Total |16,276,582     64,252 |16,340,834 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |    death/ITU adm.
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |12,919,341     23,915 |12,943,256 
           |     79.37      37.22 |     79.21 
-----------+----------------------+----------
         1 | 3,357,241     40,337 | 3,397,578 
           |     20.63      62.78 |     20.79 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |    death/ITU adm.
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,465,628     58,981 |15,524,609 
           |     95.02      91.80 |     95.00 
-----------+----------------------+----------
         1 |   810,954      5,271 |   816,225 
           |      4.98       8.20 |      5.00 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |    death/ITU adm.
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 3,432,519     13,204 | 3,445,723 
                 |     21.09      20.55 |     21.09 
-----------------+----------------------+----------
               2 | 3,374,246     13,407 | 3,387,653 
                 |     20.73      20.87 |     20.73 
-----------------+----------------------+----------
               3 | 3,396,552     13,623 | 3,410,175 
                 |     20.87      21.20 |     20.87 
-----------------+----------------------+----------
               4 | 3,265,326     12,594 | 3,277,920 
                 |     20.06      19.60 |     20.06 
-----------------+----------------------+----------
 5 most deprived | 2,807,939     11,424 | 2,819,363 
                 |     17.25      17.78 |     17.25 
-----------------+----------------------+----------
           Total |16,276,582     64,252 |16,340,834 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |    death/ITU adm.
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |10,424,261     43,852 |10,468,113 
                      |     64.04      68.25 |     64.06 
----------------------+----------------------+----------
                Mixed |   182,950        189 |   183,139 
                      |      1.12       0.29 |      1.12 
----------------------+----------------------+----------
Asian or Asian Britis | 1,024,717      1,506 | 1,026,223 
                      |      6.30       2.34 |      6.28 
----------------------+----------------------+----------
                Black |   362,037        632 |   362,669 
                      |      2.22       0.98 |      2.22 
----------------------+----------------------+----------
                Other |   347,087        335 |   347,422 
                      |      2.13       0.52 |      2.13 
----------------------+----------------------+----------
              Unknown | 3,935,530     17,738 | 3,953,268 
                      |     24.18      27.61 |     24.19 
----------------------+----------------------+----------
                Total |16,276,582     64,252 |16,340,834 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |    outcome: covid
Partnershi |    death/ITU adm.
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |   184,682        947 |   185,629 
           |      1.13       1.47 |      1.14 
-----------+----------------------+----------
         2 | 1,493,707      5,835 | 1,499,542 
           |      9.18       9.08 |      9.18 
-----------+----------------------+----------
         3 |   698,035      3,030 |   701,065 
           |      4.29       4.72 |      4.29 
-----------+----------------------+----------
         4 |   158,059        662 |   158,721 
           |      0.97       1.03 |      0.97 
-----------+----------------------+----------
         5 |   111,208        485 |   111,693 
           |      0.68       0.75 |      0.68 
-----------+----------------------+----------
         6 |   751,520      3,153 |   754,673 
           |      4.62       4.91 |      4.62 
-----------+----------------------+----------
         7 |    44,883        232 |    45,115 
           |      0.28       0.36 |      0.28 
-----------+----------------------+----------
         8 |   595,763      2,483 |   598,246 
           |      3.66       3.86 |      3.66 
-----------+----------------------+----------
         9 |   483,986      2,342 |   486,328 
           |      2.97       3.65 |      2.98 
-----------+----------------------+----------
        10 |   642,842      2,575 |   645,417 
           |      3.95       4.01 |      3.95 
-----------+----------------------+----------
        11 |   712,143      2,561 |   714,704 
           |      4.38       3.99 |      4.37 
-----------+----------------------+----------
        12 |   230,500        933 |   231,433 
           |      1.42       1.45 |      1.42 
-----------+----------------------+----------
        13 |   348,049      1,324 |   349,373 
           |      2.14       2.06 |      2.14 
-----------+----------------------+----------
        14 |   435,645      1,526 |   437,171 
           |      2.68       2.38 |      2.68 
-----------+----------------------+----------
        15 |   577,555      1,900 |   579,455 
           |      3.55       2.96 |      3.55 
-----------+----------------------+----------
        16 |   610,074      2,858 |   612,932 
           |      3.75       4.45 |      3.75 
-----------+----------------------+----------
        17 |   507,269      2,174 |   509,443 
           |      3.12       3.38 |      3.12 
-----------+----------------------+----------
        18 |   688,269      2,249 |   690,518 
           |      4.23       3.50 |      4.23 
-----------+----------------------+----------
        19 |   541,602      2,188 |   543,790 
           |      3.33       3.41 |      3.33 
-----------+----------------------+----------
        20 |   794,569      3,362 |   797,931 
           |      4.88       5.23 |      4.88 
-----------+----------------------+----------
        21 | 1,207,142      2,155 | 1,209,297 
           |      7.42       3.35 |      7.40 
-----------+----------------------+----------
        22 |    76,207        146 |    76,353 
           |      0.47       0.23 |      0.47 
-----------+----------------------+----------
        23 |   628,100      2,710 |   630,810 
           |      3.86       4.22 |      3.86 
-----------+----------------------+----------
        24 |    31,028        165 |    31,193 
           |      0.19       0.26 |      0.19 
-----------+----------------------+----------
        25 |   142,117        601 |   142,718 
           |      0.87       0.94 |      0.87 
-----------+----------------------+----------
        26 |   539,077      2,486 |   541,563 
           |      3.31       3.87 |      3.31 
-----------+----------------------+----------
        27 |   627,212      2,466 |   629,678 
           |      3.85       3.84 |      3.85 
-----------+----------------------+----------
        28 |   540,361      2,582 |   542,943 
           |      3.32       4.02 |      3.32 
-----------+----------------------+----------
        29 |   426,048      1,741 |   427,789 
           |      2.62       2.71 |      2.62 
-----------+----------------------+----------
        30 |   308,553      1,236 |   309,789 
           |      1.90       1.92 |      1.90 
-----------+----------------------+----------
        31 |    19,590         69 |    19,659 
           |      0.12       0.11 |      0.12 
-----------+----------------------+----------
        32 | 1,120,787      5,076 | 1,125,863 
           |      6.89       7.90 |      6.89 
-----------+----------------------+----------
     Total |16,276,582     64,252 |16,340,834 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |    prob/susp. case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 3,036,221     76,870 | 3,113,091 
           |     19.35      11.78 |     19.05 
-----------+----------------------+----------
    30-<40 | 2,863,193     84,748 | 2,947,941 
           |     18.25      12.99 |     18.04 
-----------+----------------------+----------
    40-<50 | 2,510,229     85,938 | 2,596,167 
           |     16.00      13.17 |     15.89 
-----------+----------------------+----------
    50-<60 | 2,590,407    106,151 | 2,696,558 
           |     16.51      16.27 |     16.50 
-----------+----------------------+----------
    60-<70 | 2,065,747     97,538 | 2,163,285 
           |     13.17      14.95 |     13.24 
-----------+----------------------+----------
    70-<80 | 1,661,429    104,310 | 1,765,739 
           |     10.59      15.99 |     10.81 
-----------+----------------------+----------
       80+ |   961,139     96,914 | 1,058,053 
           |      6.13      14.85 |      6.47 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,913,877    381,900 | 8,295,777 
           |     50.44      58.53 |     50.77 
-----------+----------------------+----------
         1 | 7,774,488    270,569 | 8,045,057 
           |     49.56      41.47 |     49.23 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |    prob/susp. case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   295,513     15,764 |   311,277 
                     |      1.88       2.42 |      1.90 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 4,481,899    184,344 | 4,666,243 
                     |     28.57      28.25 |     28.56 
---------------------+----------------------+----------
Overweight (25-29.9) | 4,229,310    192,431 | 4,421,741 
                     |     26.96      29.49 |     27.06 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,117,386    113,455 | 2,230,841 
                     |     13.50      17.39 |     13.65 
---------------------+----------------------+----------
  Obese II (35-39.9) |   813,571     50,326 |   863,897 
                     |      5.19       7.71 |      5.29 
---------------------+----------------------+----------
     Obese III (40+) |   406,533     29,105 |   435,638 
                     |      2.59       4.46 |      2.67 
---------------------+----------------------+----------
        Unknown (.u) | 3,344,153     67,044 | 3,411,197 
                     |     21.32      10.28 |     20.88 
---------------------+----------------------+----------
               Total |15,688,365    652,469 |16,340,834 
                     |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |    prob/susp. case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 7,216,877    258,084 | 7,474,961 
             |     46.00      39.55 |     45.74 
-------------+----------------------+----------
      Former | 5,003,335    273,276 | 5,276,611 
             |     31.89      41.88 |     32.29 
-------------+----------------------+----------
     Current | 2,742,627    111,360 | 2,853,987 
             |     17.48      17.07 |     17.47 
-------------+----------------------+----------
Unknown (.u) |   725,526      9,749 |   735,275 
             |      4.62       1.49 |      4.50 
-------------+----------------------+----------
       Total |15,688,365    652,469 |16,340,834 
             |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |    prob/susp. case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |12,350,875    459,583 |12,810,458 
                     |     78.73      70.44 |     78.40 
---------------------+----------------------+----------
   Obese I (30-34.9) | 2,117,386    113,455 | 2,230,841 
                     |     13.50      17.39 |     13.65 
---------------------+----------------------+----------
  Obese II (35-39.9) |   813,571     50,326 |   863,897 
                     |      5.19       7.71 |      5.29 
---------------------+----------------------+----------
     Obese III (40+) |   406,533     29,105 |   435,638 
                     |      2.59       4.46 |      2.67 
---------------------+----------------------+----------
               Total |15,688,365    652,469 |16,340,834 
                     |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
  Probable |    prob/susp. case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |12,141,598    382,067 |12,523,665 
           |     77.39      58.56 |     76.64 
-----------+----------------------+----------
         1 | 3,546,767    270,402 | 3,817,169 
           |     22.61      41.44 |     23.36 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
51

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |    prob/susp. case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |15,108,497    563,881 |15,672,378 
           |     96.30      86.42 |     95.91 
-----------+----------------------+----------
         1 |   579,868     88,588 |   668,456 
           |      3.70      13.58 |      4.09 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |    prob/susp. case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |13,250,386    501,987 |13,752,373 
           |     84.46      76.94 |     84.16 
-----------+----------------------+----------
         1 | 2,437,979    150,482 | 2,588,461 
           |     15.54      23.06 |     15.84 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
47

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |    prob/susp. case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |14,682,853    550,860 |15,233,713 
           |     93.59      84.43 |     93.22 
-----------+----------------------+----------
         1 | 1,005,512    101,609 | 1,107,121 
           |      6.41      15.57 |      6.78 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |14,177,903    521,825 |14,699,728 
           |     90.37      79.98 |     89.96 
-----------+----------------------+----------
         1 | 1,510,462    130,644 | 1,641,106 
           |      9.63      20.02 |     10.04 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
41

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |    prob/susp. case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |14,969,209    590,075 |15,559,284 
              |     95.42      90.44 |     95.22 
--------------+----------------------+----------
    Last year |    64,469      8,371 |    72,840 
              |      0.41       1.28 |      0.45 
--------------+----------------------+----------
2-5 years ago |   194,466     17,688 |   212,154 
              |      1.24       2.71 |      1.30 
--------------+----------------------+----------
     5+ years |   460,221     36,335 |   496,556 
              |      2.93       5.57 |      3.04 
--------------+----------------------+----------
        Total |15,688,365    652,469 |16,340,834 
              |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |    prob/susp. case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |15,608,733    639,982 |16,248,715 
              |     99.49      98.09 |     99.44 
--------------+----------------------+----------
    Last year |     6,845      1,427 |     8,272 
              |      0.04       0.22 |      0.05 
--------------+----------------------+----------
2-5 years ago |    21,573      3,999 |    25,572 
              |      0.14       0.61 |      0.16 
--------------+----------------------+----------
     5+ years |    51,214      7,061 |    58,275 
              |      0.33       1.08 |      0.36 
--------------+----------------------+----------
        Total |15,688,365    652,469 |16,340,834 
              |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |    prob/susp. case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |15,644,543    648,120 |16,292,663 
           |     99.72      99.33 |     99.71 
-----------+----------------------+----------
         1 |    43,822      4,349 |    48,171 
           |      0.28       0.67 |      0.29 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
35

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |    outcome: covid
     organ |    prob/susp. case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |15,673,278    648,924 |16,322,202 
           |     99.90      99.46 |     99.89 
-----------+----------------------+----------
         1 |    15,087      3,545 |    18,632 
           |      0.10       0.54 |      0.11 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |15,669,580    648,099 |16,317,679 
           |     99.88      99.33 |     99.86 
-----------+----------------------+----------
         1 |    18,785      4,370 |    23,155 
           |      0.12       0.67 |      0.14 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
45

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |    prob/susp. case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,598,765    643,110 |16,241,875 
           |     99.43      98.57 |     99.39 
-----------+----------------------+----------
         1 |    89,600      9,359 |    98,959 
           |      0.57       1.43 |      0.61 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
35

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |    prob/susp. case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |15,539,654    637,458 |16,177,112 
           |     99.05      97.70 |     99.00 
-----------+----------------------+----------
         1 |   148,711     15,011 |   163,722 
           |      0.95       2.30 |      1.00 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |    prob/susp. case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |15,340,411    612,408 |15,952,819 
           |     97.78      93.86 |     97.63 
-----------+----------------------+----------
         1 |   347,954     40,061 |   388,015 
           |      2.22       6.14 |      2.37 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |    prob/susp. case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |    11,334      2,583 |    13,917 
           |      0.10       0.45 |      0.12 
-----------+----------------------+----------
        15 |    51,841      7,594 |    59,435 
           |      0.45       1.31 |      0.50 
-----------+----------------------+----------
        30 |   213,387     25,185 |   238,572 
           |      1.87       4.35 |      1.99 
-----------+----------------------+----------
        45 |   637,543     52,486 |   690,029 
           |      5.59       9.07 |      5.75 
-----------+----------------------+----------
        60 |10,497,689    490,551 |10,988,240 
           |     91.99      84.81 |     91.64 
-----------+----------------------+----------
     Total |11,411,794    578,399 |11,990,193 
           |    100.00     100.00 |    100.00 
47

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |    prob/susp. case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |14,774,260    564,621 |15,338,881 
                      |     94.17      86.54 |     93.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   850,930     77,671 |   928,601 
                      |      5.42      11.90 |      5.68 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    63,175     10,177 |    73,352 
                      |      0.40       1.56 |      0.45 
----------------------+----------------------+----------
                Total |15,688,365    652,469 |16,340,834 
                      |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |    prob/susp. case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |12,520,183    423,073 |12,943,256 
           |     79.81      64.84 |     79.21 
-----------+----------------------+----------
         1 | 3,168,182    229,396 | 3,397,578 
           |     20.19      35.16 |     20.79 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |    prob/susp. case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |14,930,826    593,783 |15,524,609 
           |     95.17      91.01 |     95.00 
-----------+----------------------+----------
         1 |   757,539     58,686 |   816,225 
           |      4.83       8.99 |      5.00 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |    prob/susp. case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 3,319,265    126,458 | 3,445,723 
                 |     21.16      19.38 |     21.09 
-----------------+----------------------+----------
               2 | 3,258,267    129,386 | 3,387,653 
                 |     20.77      19.83 |     20.73 
-----------------+----------------------+----------
               3 | 3,271,574    138,601 | 3,410,175 
                 |     20.85      21.24 |     20.87 
-----------------+----------------------+----------
               4 | 3,141,261    136,659 | 3,277,920 
                 |     20.02      20.94 |     20.06 
-----------------+----------------------+----------
 5 most deprived | 2,697,998    121,365 | 2,819,363 
                 |     17.20      18.60 |     17.25 
-----------------+----------------------+----------
           Total |15,688,365    652,469 |16,340,834 
                 |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |    prob/susp. case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |10,025,170    442,943 |10,468,113 
                      |     63.90      67.89 |     64.06 
----------------------+----------------------+----------
                Mixed |   176,809      6,330 |   183,139 
                      |      1.13       0.97 |      1.12 
----------------------+----------------------+----------
Asian or Asian Britis |   987,269     38,954 | 1,026,223 
                      |      6.29       5.97 |      6.28 
----------------------+----------------------+----------
                Black |   347,916     14,753 |   362,669 
                      |      2.22       2.26 |      2.22 
----------------------+----------------------+----------
                Other |   339,100      8,322 |   347,422 
                      |      2.16       1.28 |      2.13 
----------------------+----------------------+----------
              Unknown | 3,812,101    141,167 | 3,953,268 
                      |     24.30      21.64 |     24.19 
----------------------+----------------------+----------
                Total |15,688,365    652,469 |16,340,834 
                      |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |    outcome: covid
Partnershi |    prob/susp. case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |   179,269      6,360 |   185,629 
           |      1.14       0.97 |      1.14 
-----------+----------------------+----------
         2 | 1,423,572     75,970 | 1,499,542 
           |      9.07      11.64 |      9.18 
-----------+----------------------+----------
         3 |   667,224     33,841 |   701,065 
           |      4.25       5.19 |      4.29 
-----------+----------------------+----------
         4 |   155,357      3,364 |   158,721 
           |      0.99       0.52 |      0.97 
-----------+----------------------+----------
         5 |   106,760      4,933 |   111,693 
           |      0.68       0.76 |      0.68 
-----------+----------------------+----------
         6 |   728,740     25,933 |   754,673 
           |      4.65       3.97 |      4.62 
-----------+----------------------+----------
         7 |    44,664        451 |    45,115 
           |      0.28       0.07 |      0.28 
-----------+----------------------+----------
         8 |   579,691     18,555 |   598,246 
           |      3.70       2.84 |      3.66 
-----------+----------------------+----------
         9 |   469,315     17,013 |   486,328 
           |      2.99       2.61 |      2.98 
-----------+----------------------+----------
        10 |   623,209     22,208 |   645,417 
           |      3.97       3.40 |      3.95 
-----------+----------------------+----------
        11 |   691,280     23,424 |   714,704 
           |      4.41       3.59 |      4.37 
-----------+----------------------+----------
        12 |   225,033      6,400 |   231,433 
           |      1.43       0.98 |      1.42 
-----------+----------------------+----------
        13 |   330,130     19,243 |   349,373 
           |      2.10       2.95 |      2.14 
-----------+----------------------+----------
        14 |   421,320     15,851 |   437,171 
           |      2.69       2.43 |      2.68 
-----------+----------------------+----------
        15 |   558,951     20,504 |   579,455 
           |      3.56       3.14 |      3.55 
-----------+----------------------+----------
        16 |   578,799     34,133 |   612,932 
           |      3.69       5.23 |      3.75 
-----------+----------------------+----------
        17 |   497,195     12,248 |   509,443 
           |      3.17       1.88 |      3.12 
-----------+----------------------+----------
        18 |   656,864     33,654 |   690,518 
           |      4.19       5.16 |      4.23 
-----------+----------------------+----------
        19 |   510,471     33,319 |   543,790 
           |      3.25       5.11 |      3.33 
-----------+----------------------+----------
        20 |   764,367     33,564 |   797,931 
           |      4.87       5.14 |      4.88 
-----------+----------------------+----------
        21 | 1,169,895     39,402 | 1,209,297 
           |      7.46       6.04 |      7.40 
-----------+----------------------+----------
        22 |    75,664        689 |    76,353 
           |      0.48       0.11 |      0.47 
-----------+----------------------+----------
        23 |   607,153     23,657 |   630,810 
           |      3.87       3.63 |      3.86 
-----------+----------------------+----------
        24 |    30,585        608 |    31,193 
           |      0.19       0.09 |      0.19 
-----------+----------------------+----------
        25 |   138,317      4,401 |   142,718 
           |      0.88       0.67 |      0.87 
-----------+----------------------+----------
        26 |   524,454     17,109 |   541,563 
           |      3.34       2.62 |      3.31 
-----------+----------------------+----------
        27 |   602,518     27,160 |   629,678 
           |      3.84       4.16 |      3.85 
-----------+----------------------+----------
        28 |   517,855     25,088 |   542,943 
           |      3.30       3.85 |      3.32 
-----------+----------------------+----------
        29 |   408,233     19,556 |   427,789 
           |      2.60       3.00 |      2.62 
-----------+----------------------+----------
        30 |   293,895     15,894 |   309,789 
           |      1.87       2.44 |      1.90 
-----------+----------------------+----------
        31 |    19,120        539 |    19,659 
           |      0.12       0.08 |      0.12 
-----------+----------------------+----------
        32 | 1,088,465     37,398 | 1,125,863 
           |      6.94       5.73 |      6.89 
-----------+----------------------+----------
     Total |15,688,365    652,469 |16,340,834 
           |    100.00     100.00 |    100.00 

. 
. 
. ********************************************
. *  Cumulative incidence of ONS COVID DEATH /ICNARC ITU ADM.*
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_death_itu.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_death_itu
   analysis time _t:  (stime_covid_death_itu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.6e+06       34              0.0000    0.0000     0.0000    0.0000
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80   1.5e+06       83              0.0001    0.0000     0.0000    0.0001
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.5e+06      156              0.0001    0.0000     0.0001    0.0001
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.5e+06      197              0.0001    0.0000     0.0001    0.0002
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06      386              0.0003    0.0000     0.0003    0.0003
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06      555              0.0004    0.0000     0.0004    0.0005
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     1019              0.0008    0.0000     0.0007    0.0008
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06     1556              0.0011    0.0000     0.0011    0.0012
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80   1.1e+06     1903              0.0017    0.0000     0.0017    0.0018
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80   1.1e+06     3018              0.0028    0.0001     0.0027    0.0029
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    920197     4319              0.0047    0.0001     0.0045    0.0048
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    833901     5661              0.0067    0.0001     0.0066    0.0069
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    609329    15162              0.0242    0.0002     0.0238    0.0246
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    417868    11500              0.0267    0.0002     0.0262    0.0272
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. ***************************************
. *  Cumulative incidence of TPP COVID PROB/SUSP CASES *
. ***************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob_or_susp.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_tpp_prob_or_susp
   analysis time _t:  (stime_covid_tpp_prob_or_susp-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.6e+06    32531              0.0205    0.0001     0.0203    0.0208
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80   1.5e+06    16546              0.0108    0.0001     0.0107    0.0110
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.4e+06    35626              0.0242    0.0001     0.0240    0.0245
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.5e+06    20611              0.0140    0.0001     0.0138    0.0142
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.2e+06    34963              0.0278    0.0001     0.0275    0.0280
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06    22886              0.0171    0.0001     0.0169    0.0174
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06    41216              0.0310    0.0002     0.0307    0.0313
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06    29893              0.0219    0.0001     0.0217    0.0222
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80   1.1e+06    34352              0.0314    0.0002     0.0310    0.0317
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80   1.0e+06    30618              0.0288    0.0002     0.0284    0.0291
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    885430    35303              0.0383    0.0002     0.0379    0.0387
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    801835    33041              0.0395    0.0002     0.0391    0.0399
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    574091    36989              0.0603    0.0003     0.0597    0.0609
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    393162    26473              0.0628    0.0004     0.0620    0.0635
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. ***************************************
. *  Cumulative incidence of TPP COVID PROBABLE CASES *
. ***************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.6e+06      918              0.0006    0.0000     0.0005    0.0006
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80   1.5e+06      443              0.0003    0.0000     0.0003    0.0003
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.5e+06     1365              0.0009    0.0000     0.0009    0.0010
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.5e+06      856              0.0006    0.0000     0.0005    0.0006
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     1631              0.0013    0.0000     0.0012    0.0014
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     1204              0.0009    0.0000     0.0009    0.0010
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     2128              0.0016    0.0000     0.0015    0.0017
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06     1956              0.0014    0.0000     0.0014    0.0015
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80   1.1e+06     1596              0.0015    0.0000     0.0014    0.0015
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80   1.1e+06     1932              0.0018    0.0000     0.0017    0.0019
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    918542     1917              0.0021    0.0000     0.0020    0.0022
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    832082     2390              0.0029    0.0001     0.0027    0.0030
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    606263     3768              0.0061    0.0001     0.0060    0.0063
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    415577     3133              0.0074    0.0001     0.0072    0.0077
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\04a_an_descriptive_tables.log
  log type:  text
 closed on:  15 Jul 2020, 00:29:00
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
