--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_covid_tpp_prob_or_susp.log
  log type:  text
 opened on:  14 Jul 2020, 14:46:45

. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                                        ///
>                         i.male                                                  ///
>                         `bmi'                                   ///
>                         `smoking'                                       ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         i.tot_people_hh                         ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_size)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. foreach exposure_type in kids_cat3  ///
>                 gp_number_kids {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  9. if _rc==0{
 10. estimates
 11. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth, replace
 12. *estat concordance /*c-statistic*/
.  }
 13.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 14. 
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.bmicat) smoking(i.smoke)
 15. if _rc==0{
 16. estimates
 17. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth_bmi_smok, replace
 18. *estat concordance /*c-statistic*/
.  }
 19.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 20.  
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.bmicat) smoking(i.smoke)
 21. if _rc==0{
 22. estimates
 23. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCnoeth_bmi_smok, replace
 24. *estat concordance /*c-statistic*/
.  }
 25.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 26.  
. }
   1:      2.62 /        1 =       2.6240
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6270
WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6330
WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6300
WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6280
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6310
WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6310
WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6270
WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)

. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
(0 observations deleted)

. foreach exposure_type in kids_cat3   {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_12mo, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
  8. 
. }
   1:      2.62 /        1 =       2.6240
WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)

. 
. log close
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_covid_tpp_prob_or_susp.log
  log type:  text
 closed on:  14 Jul 2020, 14:47:18
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
