--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_covid_tpp_prob.log
  log type:  text
 opened on:  15 Jul 2020, 01:37:29

. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                                        ///
>                         i.male                                                  ///
>                         `bmi'                                   ///
>                         `smoking'                                       ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         i.tot_people_hh                         ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_size)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. foreach exposure_type in kids_cat3  ///
>                 gp_number_kids {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
  8. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  9. if _rc==0{
 10. estimates
 11. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth, replace
 12. *estat concordance /*c-statistic*/
.  }
 13.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 14. 
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.bmicat) smoking(i.smoke)
 15. if _rc==0{
 16. estimates
 17. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth_bmi_smok, replace
 18. *estat concordance /*c-statistic*/
.  }
 19.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 20.  
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.bmicat) smoking(i.smoke)
 21. if _rc==0{
 22. estimates
 23. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCnoeth_bmi_smok, replace
 24. *estat concordance /*c-statistic*/
.  }
 25.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 26.  
. }
   1:   1939.07 /        1 =    1939.0720

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,340,834             Number of obs    =  16,340,834
No. of failures      =       45,657
Time at risk         =   2214894017
                                                Wald chi2(19)    =   737850.44
Log pseudolikelihood =   -589445.55             Prob > chi2      =      0.0000

                              (Std. Err. adjusted for 173 clusters in household_size)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   .4892948   .0948225    -3.69   0.000     .3346668    .7153663
     Kids under 18  |     .61783   .1137225    -2.62   0.009     .4307153    .8862324
                    |
               age1 |   1.096774   .0151459     6.69   0.000     1.067486    1.126864
               age2 |   .8253743   .0397005    -3.99   0.000     .7511179    .9069717
               age3 |   1.741139    .221361     4.36   0.000     1.357111    2.233838
             1.male |   .9344417   .0476022    -1.33   0.183     .8456496    1.032557
                    |
          obese4cat |
 Obese I (30-34.9)  |   1.284512   .0342335     9.39   0.000     1.219138    1.353392
Obese II (35-39.9)  |   1.582095   .0469003    15.48   0.000     1.492792    1.676741
   Obese III (40+)  |   2.021468    .053209    26.74   0.000     1.919825    2.128493
                    |
       smoke_nomiss |
            Former  |   1.231356   .0350139     7.32   0.000     1.164608    1.301931
           Current  |   .7446234    .052758    -4.16   0.000     .6480781    .8555512
                    |
                imd |
                 2  |   1.131083   .0212844     6.55   0.000     1.090126    1.173578
                 3  |   1.169569   .0318093     5.76   0.000     1.108856    1.233605
                 4  |   1.359287   .0491848     8.48   0.000     1.266226    1.459188
   5 most deprived  |   1.550779   .0776569     8.76   0.000     1.405805    1.710704
                    |
      tot_people_hh |
                 2  |   .9586798   .0173076    -2.34   0.019     .9253506    .9932094
                 3  |   1.472042   .0917296     6.20   0.000     1.302801    1.663269
                 4  |   1.992524     .22517     6.10   0.000     1.596657    2.486541
                 5  |   4.569488   .9400382     7.39   0.000     3.053218    6.838759
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_noeth.ster saved
   1:   1778.13 /        1 =    1778.1270

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,387,566             Number of obs    =  12,387,566
No. of failures      =       35,544
Time at risk         =   1679191147
                                                Wald chi2(23)    =   628895.70
Log pseudolikelihood =   -450206.16             Prob > chi2      =      0.0000

                                  (Std. Err. adjusted for 173 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              kids_cat3 |
         Kids under 12  |   .4593547   .0854182    -4.18   0.000     .3190546      .66135
         Kids under 18  |   .6098163   .1107559    -2.72   0.006     .4271715     .870554
                        |
                   age1 |   1.101491   .0150822     7.06   0.000     1.072324    1.131452
                   age2 |   .8116914   .0387009    -4.38   0.000     .7392752     .891201
                   age3 |   1.831941   .2315989     4.79   0.000     1.429882    2.347052
                 1.male |   .9443514   .0449147    -1.20   0.229     .8602987    1.036616
                        |
              obese4cat |
     Obese I (30-34.9)  |    1.26994   .0358014     8.48   0.000     1.201674    1.342085
    Obese II (35-39.9)  |    1.56382   .0617899    11.32   0.000     1.447285    1.689739
       Obese III (40+)  |   2.041657    .055672    26.18   0.000     1.935407    2.153741
                        |
           smoke_nomiss |
                Former  |   1.246142   .0263593    10.40   0.000     1.195535    1.298891
               Current  |   .7598634   .0474172    -4.40   0.000      .672386    .8587217
                        |
              ethnicity |
                 Mixed  |   1.342322   .0692695     5.70   0.000     1.213196    1.485191
Asian or Asian British  |   1.574142   .1376626     5.19   0.000     1.326185    1.868459
                 Black  |   1.520615    .084458     7.55   0.000     1.363772    1.695496
                 Other  |   1.117114   .0996982     1.24   0.215     .9378451    1.330651
                        |
                    imd |
                     2  |   1.122349   .0247472     5.23   0.000     1.074878    1.171916
                     3  |   1.160738   .0339994     5.09   0.000     1.095977    1.229325
                     4  |   1.302874   .0504454     6.83   0.000     1.207661    1.405594
       5 most deprived  |   1.473807   .0782359     7.31   0.000     1.328174    1.635407
                        |
          tot_people_hh |
                     2  |   .9424751   .0148701    -3.76   0.000     .9137762    .9720754
                     3  |     1.4656   .0884892     6.33   0.000     1.302033    1.649715
                     4  |   1.996554   .2321709     5.95   0.000     1.589638    2.507631
                     5  |   4.202858   .8983978     6.72   0.000      2.76435    6.389937
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_CCeth.ster saved
   1:   1644.24 /        1 =    1644.2440

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   10,438,702             Number of obs    =  10,438,702
No. of failures      =       32,484
Time at risk         =   1414608407
                                                Wald chi2(25)    =   543386.03
Log pseudolikelihood =   -406372.76             Prob > chi2      =      0.0000

                                  (Std. Err. adjusted for 171 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              kids_cat3 |
         Kids under 12  |   .4493311   .0812068    -4.43   0.000     .3153046    .6403283
         Kids under 18  |   .6105524   .1084802    -2.78   0.005     .4310079    .8648896
                        |
                   age1 |   1.099198   .0168049     6.19   0.000      1.06675    1.132634
                   age2 |   .8103439   .0413062    -4.13   0.000      .733298    .8954848
                   age3 |   1.848392    .248471     4.57   0.000      1.42027    2.405566
                 1.male |   .9983203   .0463175    -0.04   0.971     .9115448    1.093356
                        |
                 bmicat |
    Normal (18.5-24.9)  |   .7098217   .0450503    -5.40   0.000     .6267956    .8038455
  Overweight (25-29.9)  |   .7176275   .0462628    -5.15   0.000     .6324485    .8142785
     Obese I (30-34.9)  |   .8875225   .0595861    -1.78   0.076     .7780935    1.012341
    Obese II (35-39.9)  |   1.094753   .0561982     1.76   0.078     .9899661    1.210631
       Obese III (40+)  |      1.427   .0947732     5.35   0.000      1.25283    1.625384
                        |
                  smoke |
                Former  |    1.22166    .028705     8.52   0.000     1.166675    1.279236
               Current  |   .7454746   .0467609    -4.68   0.000     .6592348    .8429962
                        |
              ethnicity |
                 Mixed  |   1.396347   .0850169     5.48   0.000     1.239275    1.573327
Asian or Asian British  |   1.522897   .1336552     4.79   0.000     1.282229    1.808736
                 Black  |   1.528497   .0879789     7.37   0.000     1.365433    1.711036
                 Other  |   1.162428    .107642     1.63   0.104     .9694918    1.393761
                        |
                    imd |
                     2  |    1.12562   .0260773     5.11   0.000     1.075653    1.177909
                     3  |   1.161689   .0373754     4.66   0.000     1.090696    1.237302
                     4  |   1.316947   .0489583     7.41   0.000     1.224403    1.416486
       5 most deprived  |   1.488698   .0778205     7.61   0.000     1.343726    1.649311
                        |
          tot_people_hh |
                     2  |   .9335783   .0148221    -4.33   0.000     .9049748    .9630858
                     3  |   1.466194     .08535     6.57   0.000     1.308101    1.643393
                     4  |   2.008955   .2285444     6.13   0.000     1.607442    2.510761
                     5  |    4.33372   .9211386     6.90   0.000     2.857174    6.573324
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:   1723.62 /        1 =    1723.6240

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,825,008             Number of obs    =  12,825,008
No. of failures      =       40,523
Time at risk         =   1737578674
                                                Wald chi2(21)    =   559105.21
Log pseudolikelihood =   -514406.96             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 173 clusters in household_size)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
            kids_cat3 |
       Kids under 12  |   .4696976   .0864518    -4.11   0.000      .327452     .673735
       Kids under 18  |   .6143457   .1096654    -2.73   0.006      .432979    .8716835
                      |
                 age1 |   1.093587   .0169078     5.79   0.000     1.060945    1.127232
                 age2 |   .8245207   .0425673    -3.74   0.000     .7451725    .9123181
                 age3 |   1.754601   .2375854     4.15   0.000     1.345611      2.2879
               1.male |   1.009912   .0480301     0.21   0.836     .9200291    1.108577
                      |
               bmicat |
  Normal (18.5-24.9)  |    .701084   .0435166    -5.72   0.000     .6207769    .7917801
Overweight (25-29.9)  |   .7112172   .0450462    -5.38   0.000     .6281885      .80522
   Obese I (30-34.9)  |   .8630359   .0547927    -2.32   0.020     .7620571    .9773952
  Obese II (35-39.9)  |    1.06653   .0563786     1.22   0.223      .961562    1.182958
     Obese III (40+)  |   1.359336   .0836437     4.99   0.000     1.204897     1.53357
                      |
                smoke |
              Former  |   1.184541    .038841     5.16   0.000     1.110808    1.263167
             Current  |   .7226888   .0519599    -4.52   0.000     .6276993     .832053
                      |
                  imd |
                   2  |   1.139249   .0233313     6.37   0.000     1.094426    1.185907
                   3  |   1.172956   .0341214     5.48   0.000     1.107951    1.241776
                   4  |    1.36902   .0485313     8.86   0.000      1.27713    1.467522
     5 most deprived  |   1.570346    .077563     9.14   0.000     1.425451    1.729968
                      |
        tot_people_hh |
                   2  |   .9516001    .017251    -2.74   0.006     .9183823    .9860193
                   3  |   1.483766   .0878776     6.66   0.000      1.32115    1.666398
                   4  |   2.051715    .225762     6.53   0.000     1.653691    2.545538
                   5  |   4.764517   .9652157     7.71   0.000     3.203162    7.086941
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok.ster saved
   1:   2034.31 /        1 =    2034.3070

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,340,834             Number of obs    =  16,340,834
No. of failures      =       45,657
Time at risk         =   2214894017
                                                Wald chi2(21)    =   790100.79
Log pseudolikelihood =   -589350.42             Prob > chi2      =      0.0000

                              (Std. Err. adjusted for 173 clusters in household_size)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
     gp_number_kids |
    only >12 years  |   .6133379    .111031    -2.70   0.007     .4301391    .8745621
       1 child <12  |   .5621065   .1038974    -3.12   0.002     .3912786    .8075161
    2 children <12  |   .4523344   .0966532    -3.71   0.000     .2975623    .6876087
   3+ children <12  |   .3537802   .0725236    -5.07   0.000      .236723    .5287212
                    |
               age1 |   1.098225    .015229     6.76   0.000     1.068779    1.128482
               age2 |   .8218821   .0395176    -4.08   0.000     .7479666    .9031022
               age3 |   1.759859   .2237475     4.45   0.000     1.371692    2.257871
             1.male |   .9345487   .0473918    -1.33   0.182     .8461293    1.032208
                    |
          obese4cat |
 Obese I (30-34.9)  |   1.286366   .0347919     9.31   0.000     1.219951    1.356396
Obese II (35-39.9)  |   1.583772   .0467214    15.59   0.000     1.494797    1.678043
   Obese III (40+)  |   2.021653   .0536345    26.53   0.000     1.919217    2.129555
                    |
       smoke_nomiss |
            Former  |   1.231823   .0347936     7.38   0.000     1.165482     1.30194
           Current  |   .7437059   .0527186    -4.18   0.000      .647236    .8545546
                    |
                imd |
                 2  |   1.130141   .0212951     6.49   0.000     1.089165    1.172659
                 3  |   1.168414   .0315481     5.76   0.000     1.108188    1.231912
                 4  |   1.358029   .0485347     8.56   0.000     1.266158    1.456566
   5 most deprived  |   1.552109   .0764124     8.93   0.000     1.409342    1.709338
                    |
      tot_people_hh |
                 2  |   .9569626   .0176817    -2.38   0.017     .9229271    .9922533
                 3  |    1.44871   .0983698     5.46   0.000     1.268187    1.654929
                 4  |   1.973784   .2208884     6.08   0.000     1.585042    2.457868
                 5  |   4.630311   .9568495     7.42   0.000     3.088234    6.942409
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_noeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_noeth.ster saved
   1:   1829.31 /        1 =    1829.3100

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,387,566             Number of obs    =  12,387,566
No. of failures      =       35,544
Time at risk         =   1679191147
                                                Wald chi2(25)    =   808572.79
Log pseudolikelihood =   -450115.06             Prob > chi2      =      0.0000

                                  (Std. Err. adjusted for 173 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |   .6046017   .1075659    -2.83   0.005     .4266093     .856857
           1 child <12  |   .5341056   .0951288    -3.52   0.000     .3767218    .7572399
        2 children <12  |   .4222556    .084347    -4.32   0.000     .2854598    .6246054
       3+ children <12  |   .3260775   .0662576    -5.51   0.000     .2189577     .485603
                        |
                   age1 |    1.10293   .0151455     7.13   0.000     1.073641    1.133018
                   age2 |   .8082312    .038445    -4.48   0.000     .7362861    .8872063
                   age3 |   1.851905   .2336855     4.88   0.000     1.446134    2.371532
                 1.male |   .9444502   .0446037    -1.21   0.226     .8609526    1.036046
                        |
              obese4cat |
     Obese I (30-34.9)  |   1.271954   .0363982     8.41   0.000     1.202579    1.345332
    Obese II (35-39.9)  |   1.565763   .0615292    11.41   0.000     1.449695    1.691123
       Obese III (40+)  |   2.042122   .0562927    25.90   0.000     1.934718    2.155489
                        |
           smoke_nomiss |
                Former  |   1.247061    .026099    10.55   0.000     1.196943    1.299278
               Current  |    .758941   .0473703    -4.42   0.000     .6715512     .857703
                        |
              ethnicity |
                 Mixed  |   1.343751   .0694413     5.72   0.000     1.214314    1.486985
Asian or Asian British  |   1.580095   .1378421     5.24   0.000     1.331764    1.874731
                 Black  |   1.529001   .0846199     7.67   0.000     1.371827    1.704182
                 Other  |   1.118146   .0991632     1.26   0.208     .9397436    1.330417
                        |
                    imd |
                     2  |   1.121194   .0248878     5.15   0.000      1.07346    1.171049
                     3  |   1.159162   .0339379     5.04   0.000     1.094518    1.227625
                     4  |   1.300905   .0501671     6.82   0.000     1.206203    1.403042
       5 most deprived  |    1.47425   .0774229     7.39   0.000     1.330053    1.634081
                        |
          tot_people_hh |
                     2  |   .9405909   .0150662    -3.82   0.000     .9115204    .9705884
                     3  |   1.438483   .0952351     5.49   0.000     1.263429    1.637792
                     4  |   1.976727   .2252166     5.98   0.000     1.581124    2.471312
                     5  |   4.267197   .9114057     6.79   0.000     2.807628    6.485536
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_CCeth.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_CCeth.ster saved
   1:   1703.36 /        1 =    1703.3600

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   10,438,702             Number of obs    =  10,438,702
No. of failures      =       32,484
Time at risk         =   1414608407
                                                Wald chi2(27)    =   738953.11
Log pseudolikelihood =    -406274.8             Prob > chi2      =      0.0000

                                  (Std. Err. adjusted for 171 clusters in household_size)
-----------------------------------------------------------------------------------------
                        |               Robust
                     _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         gp_number_kids |
        only >12 years  |   .6048456   .1052897    -2.89   0.004     .4300014    .8507837
           1 child <12  |    .528372   .0907103    -3.72   0.000     .3774041    .7397297
        2 children <12  |    .413814    .079421    -4.60   0.000     .2840788    .6027976
       3+ children <12  |   .3040751    .060789    -5.95   0.000     .2055008    .4499334
                        |
                   age1 |   1.100092   .0167712     6.26   0.000     1.067707    1.133459
                   age2 |   .8076187   .0409146    -4.22   0.000     .7312802    .8919262
                   age3 |    1.86508   .2493489     4.66   0.000     1.435151    2.423804
                 1.male |    .998246   .0459482    -0.04   0.970     .9121319     1.09249
                        |
                 bmicat |
    Normal (18.5-24.9)  |   .7126512   .0452524    -5.33   0.000     .6292552    .8070998
  Overweight (25-29.9)  |   .7219668   .0474217    -4.96   0.000     .6347561    .8211597
     Obese I (30-34.9)  |   .8930798   .0616539    -1.64   0.101      .780059    1.022476
    Obese II (35-39.9)  |   1.101154   .0580234     1.83   0.067     .9931052    1.220957
       Obese III (40+)  |    1.43372   .0981071     5.26   0.000      1.25377    1.639497
                        |
                  smoke |
                Former  |     1.2224   .0284683     8.62   0.000     1.167857     1.27949
               Current  |   .7444641   .0467461    -4.70   0.000     .6582569    .8419612
                        |
              ethnicity |
                 Mixed  |   1.398048   .0853495     5.49   0.000     1.240387    1.575749
Asian or Asian British  |   1.529754   .1341369     4.85   0.000     1.288201      1.8166
                 Black  |   1.538566   .0884362     7.50   0.000     1.374641    1.722038
                 Other  |   1.163964   .1071844     1.65   0.099     .9717535    1.394193
                        |
                    imd |
                     2  |   1.124448    .026196     5.03   0.000     1.074259    1.176981
                     3  |   1.160036    .037316     4.61   0.000     1.089156    1.235529
                     4  |   1.314942   .0486458     7.40   0.000     1.222973    1.413828
       5 most deprived  |   1.489736   .0768704     7.72   0.000     1.346441    1.648282
                        |
          tot_people_hh |
                     2  |    .931565   .0150828    -4.38   0.000     .9024674    .9616009
                     3  |   1.436759   .0923504     5.64   0.000     1.266693    1.629658
                     4  |   1.985896   .2194688     6.21   0.000     1.599142    2.466186
                     5  |   4.407551   .9366708     6.98   0.000     2.906057    6.684831
-----------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_CCeth_bmi_smok.ster saved
   1:   1880.33 /        1 =    1880.3330

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,825,008             Number of obs    =  12,825,008
No. of failures      =       40,523
Time at risk         =   1737578674
                                                Wald chi2(23)    =   645291.85
Log pseudolikelihood =   -514301.58             Prob > chi2      =      0.0000

                                (Std. Err. adjusted for 173 clusters in household_size)
---------------------------------------------------------------------------------------
                      |               Robust
                   _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
       gp_number_kids |
      only >12 years  |   .6092241   .1069708    -2.82   0.005     .4318357    .8594797
         1 child <12  |   .5488065   .0951162    -3.46   0.001     .3907451    .7708059
      2 children <12  |   .4317901   .0861095    -4.21   0.000     .2920938    .6382974
     3+ children <12  |   .3231397   .0643211    -5.68   0.000     .2187551    .4773339
                      |
                 age1 |   1.094617   .0169221     5.85   0.000     1.061947    1.128291
                 age2 |    .821518   .0422266    -3.82   0.000     .7427878     .908593
                 age3 |   1.771534   .2389663     4.24   0.000     1.359969    2.307651
               1.male |   1.010026   .0476487     0.21   0.833     .9208243     1.10787
                      |
               bmicat |
  Normal (18.5-24.9)  |   .7036755   .0437926    -5.65   0.000     .6228719    .7949617
Overweight (25-29.9)  |   .7151916   .0461912    -5.19   0.000     .6301544    .8117043
   Obese I (30-34.9)  |   .8679041   .0567491    -2.17   0.030     .7635101    .9865718
  Obese II (35-39.9)  |   1.072015   .0581953     1.28   0.200     .9638123    1.192364
     Obese III (40+)  |   1.364753   .0865498     4.90   0.000     1.205238    1.545381
                      |
                smoke |
              Former  |   1.184757   .0386443     5.20   0.000     1.111386    1.262972
             Current  |   .7215124   .0519487    -4.53   0.000     .6265527    .8308642
                      |
                  imd |
                   2  |   1.138248   .0233133     6.32   0.000      1.09346    1.184871
                   3  |   1.171672   .0338155     5.49   0.000     1.107234    1.239859
                   4  |   1.367692   .0477756     8.96   0.000     1.277187     1.46461
     5 most deprived  |   1.572231   .0762038     9.34   0.000     1.429749    1.728912
                      |
        tot_people_hh |
                   2  |   .9496595   .0176502    -2.78   0.005     .9156882    .9848912
                   3  |    1.45691   .0949395     5.77   0.000     1.282225    1.655394
                   4  |   2.029865    .218724     6.57   0.000     1.643417    2.507187
                   5  |   4.837381   .9855581     7.74   0.000     3.244802    7.211612
---------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok.ster saved

. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
(0 observations deleted)

. foreach exposure_type in kids_cat3   {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_12mo, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
  8. 
. }
   1:   1918.91 /        1 =    1918.9070

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,340,834             Number of obs    =  16,340,834
No. of failures      =       45,657
Time at risk         =   2214894017
                                                Wald chi2(19)    =   737850.55
Log pseudolikelihood =   -589445.55             Prob > chi2      =      0.0000

                              (Std. Err. adjusted for 173 clusters in household_size)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   .4892948   .0948225    -3.69   0.000     .3346668    .7153663
     Kids under 18  |     .61783   .1137225    -2.62   0.009     .4307153    .8862324
                    |
               age1 |   1.096774   .0151459     6.69   0.000     1.067486    1.126864
               age2 |   .8253743   .0397005    -3.99   0.000     .7511179    .9069717
               age3 |   1.741139    .221361     4.36   0.000     1.357111    2.233838
             1.male |   .9344417   .0476022    -1.33   0.183     .8456496    1.032557
                    |
          obese4cat |
 Obese I (30-34.9)  |   1.284512   .0342335     9.39   0.000     1.219138    1.353392
Obese II (35-39.9)  |   1.582095   .0469003    15.48   0.000     1.492792    1.676741
   Obese III (40+)  |   2.021468    .053209    26.74   0.000     1.919825    2.128493
                    |
       smoke_nomiss |
            Former  |   1.231356   .0350139     7.32   0.000     1.164608    1.301931
           Current  |   .7446234    .052758    -4.16   0.000     .6480781    .8555512
                    |
                imd |
                 2  |   1.131083   .0212844     6.55   0.000     1.090126    1.173578
                 3  |   1.169569   .0318093     5.76   0.000     1.108856    1.233605
                 4  |   1.359287   .0491848     8.48   0.000     1.266226    1.459188
   5 most deprived  |   1.550779   .0776569     8.76   0.000     1.405805    1.710704
                    |
      tot_people_hh |
                 2  |   .9586798   .0173076    -2.34   0.019     .9253506    .9932094
                 3  |   1.472042   .0917296     6.20   0.000     1.302801    1.663269
                 4  |   1.992524     .22517     6.10   0.000     1.596657    2.486541
                 5  |   4.569488   .9400382     7.39   0.000     3.053218    6.838759
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_noeth_12mo.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_DEMOGADJ_noeth_12mo.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivariableDEMOG_cox_models_covid_tpp_prob.log
  log type:  text
 closed on:  15 Jul 2020, 06:12:26
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
