--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivariableFULL_cox_models_covid_tpp_prob_or_susp.log
  log type:  text
 opened on:  14 Jul 2020, 14:47:18

. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                ///
>                         i.male                                                  ///
>                         `bmi'                                                   ///
>                         `smoking'                                               ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                                ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabetes                                              ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.organ_trans                                   ///
>                         i.tot_people_hh                                 ///
>                         i.asplenia                                              ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_size)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. foreach exposure_type in        kids_cat3  ///
>                 gp_number_kids {
  2. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth, replace
  6. *estat concordance /*c-statistic*/
.         /*  Proportional Hazards test  */
.         * Based on Schoenfeld residuals
.         timer clear 
  7.         timer on 1
  8.         if e(N_fail)>0 estat phtest, d
  9.         timer off 1
 10.         timer list
 11. }
 12. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 13. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(1) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 14. if _rc==0{
 15. estimates
 16. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_CCeth, replace
 17. *estat concordance /*c-statistic*/
.  }
 18.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 19. 
.  
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(1) bmi(i.bmicat) smoking(i.smoke)
 20. if _rc==0{
 21. estimates
 22. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_CCeth_bmi_smoke, replace
 23. *estat concordance /*c-statistic*/
.  }
 24.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 25.  
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.bmicat) smoking(i.smoke)
 26. if _rc==0{
 27. estimates
 28. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_CCnoeth_bmi_smoke, replace
 29. *estat concordance /*c-statistic*/
.  }
 30.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 31.  }
   1:      2.63 /        1 =       2.6280
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6290
WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6310
WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6250
WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6250
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6280
WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6300
WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)
   1:      2.63 /        1 =       2.6300
WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)

. 
. 
. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
(0 observations deleted)

. 
. foreach exposure_type in kids_cat3  {
  2. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  3. if _rc==0{
  4. estimates
  5. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth_12mo, replace
  6. *estat concordance /*c-statistic*/
. }
  7. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
  8. 
. }
   1:      2.63 /        1 =       2.6290
WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME covid_tpp_prob_or_susp)

. 
. 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_multivariableFULL_cox_models_covid_tpp_prob_or_susp.log
  log type:  text
 closed on:  14 Jul 2020, 14:47:51
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
