--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_univariable_cox_models_covid_death_itu_SENSE12mo.log
  log type:  text
 opened on:  14 Jul 2020, 14:45:05

. 
. * Open dataset and fit specified model(s)
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
(0 observations deleted)

. foreach var of any `varlist' {
  2. 
.         *General form of model
.         else local model "age1 age2 age3 i.male i.`var'"
  3. 
.         *Fit and save model
.         cap erase ./output/an_univariable_cox_models_`outcome'_AGESEX_`var'_12mo.ster
  4.         capture stcox `model' , strata(stp) vce(cluster household_size)
  5.         if _rc==0 {
  6.                 estimates
  7.                 estimates save ./output/an_univariable_cox_models_`outcome'_AGESEX_`var'_12mo.ster, replace
  8.                 }
  9.         else di "WARNING - `var' vs `outcome' MODEL DID NOT SUCCESSFULLY FIT"
 10. 
. }
WARNING - kids_cat3 vs covid_death_itu MODEL DID NOT SUCCESSFULLY FIT

. 
. 
. * Close log file
. log close
      name:  <unnamed>
       log:  E:\caroline\school-age-children-and-covid\analysis\log\an_univariable_cox_models_covid_death_itu_SENSE12mo.log
  log type:  text
 closed on:  14 Jul 2020, 14:45:16
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
