-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\ENCDHFOR\Documents\GitHub\school-age-children-and-covid\analy
> sis\output/03_an_descriptive_tables.log
  log type:  text
 opened on:   6 Jul 2020, 17:03:51

. 
. use $tempdir\analysis_dataset, clear

. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      4,767    48.83071     19.0054         18        108

. tab agegroup

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |        963       20.20       20.20
     30-<40 |        791       16.59       36.79
     40-<50 |        723       15.17       51.96
     50-<60 |        827       17.35       69.31
     60-<70 |        685       14.37       83.68
     70-<80 |        470        9.86       93.54
        80+ |        308        6.46      100.00
------------+-----------------------------------
      Total |      4,767      100.00

. tab age66

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,777       79.23       79.23
          1 |        990       20.77      100.00
------------+-----------------------------------
      Total |      4,767      100.00

. tab male

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,427       50.91       50.91
          1 |      2,340       49.09      100.00
------------+-----------------------------------
      Total |      4,767      100.00

. tab bmicat

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |         26        3.03        3.03
  Normal (18.5-24.9) |        110       12.82       15.85
Overweight (25-29.9) |        154       17.95       33.80
   Obese I (30-34.9) |        176       20.51       54.31
  Obese II (35-39.9) |        168       19.58       73.89
     Obese III (40+) |        224       26.11      100.00
---------------------+-----------------------------------
               Total |        858      100.00

. tab bmicat, m

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |         26        0.55        0.55
  Normal (18.5-24.9) |        110        2.31        2.85
Overweight (25-29.9) |        154        3.23        6.08
   Obese I (30-34.9) |        176        3.69        9.78
  Obese II (35-39.9) |        168        3.52       13.30
     Obese III (40+) |        224        4.70       18.00
        Unknown (.u) |      3,909       82.00      100.00
---------------------+-----------------------------------
               Total |      4,767      100.00

. tab obese4cat

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |      4,199       88.08       88.08
   Obese I (30-34.9) |        176        3.69       91.78
  Obese II (35-39.9) |        168        3.52       95.30
     Obese III (40+) |        224        4.70      100.00
---------------------+-----------------------------------
               Total |      4,767      100.00

. tab smoke

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        196       22.22       22.22
      Former |         91       10.32       32.54
     Current |        595       67.46      100.00
-------------+-----------------------------------
       Total |        882      100.00

. tab smoke, m

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        196        4.11        4.11
      Former |         91        1.91        6.02
     Current |        595       12.48       18.50
Unknown (.u) |      3,885       81.50      100.00
-------------+-----------------------------------
       Total |      4,767      100.00

. tab bpcat

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |          1        0.02        0.02
 High, stage I |          4        0.09        0.12
High, stage II |      4,299       99.88      100.00
---------------+-----------------------------------
         Total |      4,304      100.00

. tab bpcat, m

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |          1        0.02        0.02
 High, stage I |          4        0.08        0.10
High, stage II |      4,299       90.18       90.29
       Unknown |        463        9.71      100.00
---------------+-----------------------------------
         Total |      4,767      100.00

. tab htdiag_or_highbp

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        364        7.64        7.64
          1 |      4,403       92.36      100.00
------------+-----------------------------------
      Total |      4,767      100.00

. ta shield

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        901       18.90       18.90
          1 |      3,866       81.10      100.00
------------+-----------------------------------
      Total |      4,767      100.00

. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat                
>                                ///
>                                                 cancer_haem_cat                  
>                                ///
>                                                 other_immuno    ///
>                                                 organ_trans                     /
> // 
>                                                 asplenia                        /
> // 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                  
>        ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2.                                                 
. tab `var'
  3. }

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,827       80.28       80.28
          1 |        940       19.72      100.00
------------+-----------------------------------
      Total |      4,767      100.00

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,411       92.53       92.53
          1 |        356        7.47      100.00
------------+-----------------------------------
      Total |      4,767      100.00

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,801       79.74       79.74
          1 |        966       20.26      100.00
------------+-----------------------------------
      Total |      4,767      100.00

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,813       79.99       79.99
          1 |        954       20.01      100.00
------------+-----------------------------------
      Total |      4,767      100.00

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,780       79.30       79.30
    Last year |         20        0.42       79.71
2-5 years ago |         70        1.47       81.18
     5+ years |        897       18.82      100.00
--------------+-----------------------------------
        Total |      4,767      100.00

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,802       79.76       79.76
    Last year |         20        0.42       80.18
2-5 years ago |         69        1.45       81.62
     5+ years |        876       18.38      100.00
--------------+-----------------------------------
        Total |      4,767      100.00

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,029       63.54       63.54
          1 |      1,738       36.46      100.00
------------+-----------------------------------
      Total |      4,767      100.00

Solid organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,853       80.83       80.83
          1 |        914       19.17      100.00
------------+-----------------------------------
      Total |      4,767      100.00

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,830       80.34       80.34
          1 |        937       19.66      100.00
------------+-----------------------------------
      Total |      4,767      100.00

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,827       80.28       80.28
          1 |        940       19.72      100.00
------------+-----------------------------------
      Total |      4,767      100.00

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,786       79.42       79.42
          1 |        981       20.58      100.00
------------+-----------------------------------
      Total |      4,767      100.00

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,804       79.80       79.80
          1 |        963       20.20      100.00
------------+-----------------------------------
      Total |      4,767      100.00

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
         30 |          1        0.02        0.02
         45 |         60        1.33        1.35
         60 |      4,444       98.65      100.00
------------+-----------------------------------
      Total |      4,505      100.00

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |      4,706       98.72       98.72
Stage 3a/3b egfr 30-60       |         61        1.28      100.00
-----------------------------+-----------------------------------
                       Total |      4,767      100.00

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,832       80.39       80.39
          1 |        935       19.61      100.00
------------+-----------------------------------
      Total |      4,767      100.00

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,816       80.05       80.05
          1 |        951       19.95      100.00
------------+-----------------------------------
      Total |      4,767      100.00

. 
. tab imd 

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,343       70.13       70.13
               4 |        950       19.93       90.06
 5 most deprived |        474        9.94      100.00
-----------------+-----------------------------------
           Total |      4,767      100.00

. tab imd, m

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,343       70.13       70.13
               4 |        950       19.93       90.06
 5 most deprived |        474        9.94      100.00
-----------------+-----------------------------------
           Total |      4,767      100.00

. tab ethnicity

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      2,856       80.11       80.11
Asian or Asian British |        378       10.60       90.72
                 Other |        331        9.28      100.00
-----------------------+-----------------------------------
                 Total |      3,565      100.00

. tab ethnicity, m

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      2,856       59.91       59.91
Asian or Asian British |        378        7.93       67.84
                 Other |        331        6.94       74.78
               Unknown |      1,202       25.22      100.00
-----------------------+-----------------------------------
                 Total |      4,767      100.00

. tab stp

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        492       10.32       10.32
          2 |        480       10.07       20.39
          3 |        497       10.43       30.82
          4 |        445        9.34       40.15
          5 |        475        9.96       50.12
          6 |        485       10.17       60.29
          7 |        451        9.46       69.75
          8 |        464        9.73       79.48
          9 |        465        9.75       89.24
         10 |        513       10.76      100.00
------------+-----------------------------------
      Total |      4,767      100.00

. 
. 
. * Outcomes
. tab covid_death_itu

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  death/ITU |
       adm. |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,753       99.71       99.71
          1 |         14        0.29      100.00
------------+-----------------------------------
      Total |      4,767      100.00

. tab covid_tpp_prob_or_susp

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
 prob/susp. |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,131       65.68       65.68
          1 |      1,636       34.32      100.00
------------+-----------------------------------
      Total |      4,767      100.00

. tab covid_tpp_prob

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,854       80.85       80.85
          1 |        913       19.15      100.00
------------+-----------------------------------
      Total |      4,767      100.00

. 
. 
. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist covid_tpp_prob covid_death_itu covid_tpp_prob_or_susp {
  2. 
. *** Repeat for each outcome
. 
.         * Demographics
.         tab agegroup                                                    `outvar',
>  col
  3.         tab male                                                              
>   `outvar', col
  4.         tab bmicat                                                            
>   `outvar', col m 
  5.         tab smoke                                                             
>   `outvar', col m
  6.         tab obese4cat                                                   `outva
> r', col m 
  7.         tab shield                                                      `outva
> r', col m 
  8. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat                
>                                ///
>                                                 cancer_haem_cat                  
>                                ///
>                                                 other_immuno    ///
>                                                 organ_trans                     /
> // 
>                                                 asplenia                        /
> // 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                  
>        ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  9.         tab `var'               `outvar', col
 10. }
 11.         
.         tab imd                                                                 `
> outvar', col m
 12.         tab ethnicity                                                   `outva
> r', col m
 13.         *tab urban                                                            
>   `outvar', col
.         tab stp                                                                 `
> outvar', col
 14. }

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       748        215 |       963 
           |     19.41      23.55 |     20.20 
-----------+----------------------+----------
    30-<40 |       642        149 |       791 
           |     16.66      16.32 |     16.59 
-----------+----------------------+----------
    40-<50 |       590        133 |       723 
           |     15.31      14.57 |     15.17 
-----------+----------------------+----------
    50-<60 |       679        148 |       827 
           |     17.62      16.21 |     17.35 
-----------+----------------------+----------
    60-<70 |       561        124 |       685 
           |     14.56      13.58 |     14.37 
-----------+----------------------+----------
    70-<80 |       373         97 |       470 
           |      9.68      10.62 |      9.86 
-----------+----------------------+----------
       80+ |       261         47 |       308 
           |      6.77       5.15 |      6.46 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,975        452 |     2,427 
           |     51.25      49.51 |     50.91 
-----------+----------------------+----------
         1 |     1,879        461 |     2,340 
           |     48.75      50.49 |     49.09 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |        18          8 |        26 
                     |      0.47       0.88 |      0.55 
---------------------+----------------------+----------
  Normal (18.5-24.9) |        89         21 |       110 
                     |      2.31       2.30 |      2.31 
---------------------+----------------------+----------
Overweight (25-29.9) |       125         29 |       154 
                     |      3.24       3.18 |      3.23 
---------------------+----------------------+----------
   Obese I (30-34.9) |       151         25 |       176 
                     |      3.92       2.74 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |       138         30 |       168 
                     |      3.58       3.29 |      3.52 
---------------------+----------------------+----------
     Obese III (40+) |       181         43 |       224 
                     |      4.70       4.71 |      4.70 
---------------------+----------------------+----------
        Unknown (.u) |     3,152        757 |     3,909 
                     |     81.79      82.91 |     82.00 
---------------------+----------------------+----------
               Total |     3,854        913 |     4,767 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       163         33 |       196 
             |      4.23       3.61 |      4.11 
-------------+----------------------+----------
      Former |        70         21 |        91 
             |      1.82       2.30 |      1.91 
-------------+----------------------+----------
     Current |       485        110 |       595 
             |     12.58      12.05 |     12.48 
-------------+----------------------+----------
Unknown (.u) |     3,136        749 |     3,885 
             |     81.37      82.04 |     81.50 
-------------+----------------------+----------
       Total |     3,854        913 |     4,767 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     3,384        815 |     4,199 
                     |     87.80      89.27 |     88.08 
---------------------+----------------------+----------
   Obese I (30-34.9) |       151         25 |       176 
                     |      3.92       2.74 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |       138         30 |       168 
                     |      3.58       3.29 |      3.52 
---------------------+----------------------+----------
     Obese III (40+) |       181         43 |       224 
                     |      4.70       4.71 |      4.70 
---------------------+----------------------+----------
               Total |     3,854        913 |     4,767 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       714        187 |       901 
           |     18.53      20.48 |     18.90 
-----------+----------------------+----------
         1 |     3,140        726 |     3,866 
           |     81.47      79.52 |     81.10 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,093        734 |     3,827 
           |     80.25      80.39 |     80.28 
-----------+----------------------+----------
         1 |       761        179 |       940 
           |     19.75      19.61 |     19.72 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,570        841 |     4,411 
           |     92.63      92.11 |     92.53 
-----------+----------------------+----------
         1 |       284         72 |       356 
           |      7.37       7.89 |      7.47 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,076        725 |     3,801 
           |     79.81      79.41 |     79.74 
-----------+----------------------+----------
         1 |       778        188 |       966 
           |     20.19      20.59 |     20.26 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,057        756 |     3,813 
           |     79.32      82.80 |     79.99 
-----------+----------------------+----------
         1 |       797        157 |       954 
           |     20.68      17.20 |     20.01 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     3,052        728 |     3,780 
              |     79.19      79.74 |     79.30 
--------------+----------------------+----------
    Last year |        16          4 |        20 
              |      0.42       0.44 |      0.42 
--------------+----------------------+----------
2-5 years ago |        53         17 |        70 
              |      1.38       1.86 |      1.47 
--------------+----------------------+----------
     5+ years |       733        164 |       897 
              |     19.02      17.96 |     18.82 
--------------+----------------------+----------
        Total |     3,854        913 |     4,767 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     3,070        732 |     3,802 
              |     79.66      80.18 |     79.76 
--------------+----------------------+----------
    Last year |        16          4 |        20 
              |      0.42       0.44 |      0.42 
--------------+----------------------+----------
2-5 years ago |        57         12 |        69 
              |      1.48       1.31 |      1.45 
--------------+----------------------+----------
     5+ years |       711        165 |       876 
              |     18.45      18.07 |     18.38 
--------------+----------------------+----------
        Total |     3,854        913 |     4,767 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,448        581 |     3,029 
           |     63.52      63.64 |     63.54 
-----------+----------------------+----------
         1 |     1,406        332 |     1,738 
           |     36.48      36.36 |     36.46 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,114        739 |     3,853 
           |     80.80      80.94 |     80.83 
-----------+----------------------+----------
         1 |       740        174 |       914 
           |     19.20      19.06 |     19.17 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,110        720 |     3,830 
           |     80.70      78.86 |     80.34 
-----------+----------------------+----------
         1 |       744        193 |       937 
           |     19.30      21.14 |     19.66 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,085        742 |     3,827 
           |     80.05      81.27 |     80.28 
-----------+----------------------+----------
         1 |       769        171 |       940 
           |     19.95      18.73 |     19.72 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,058        728 |     3,786 
           |     79.35      79.74 |     79.42 
-----------+----------------------+----------
         1 |       796        185 |       981 
           |     20.65      20.26 |     20.58 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,088        716 |     3,804 
           |     80.12      78.42 |     79.80 
-----------+----------------------+----------
         1 |       766        197 |       963 
           |     19.88      21.58 |     20.20 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        30 |         1          0 |         1 
           |      0.03       0.00 |      0.02 
-----------+----------------------+----------
        45 |        50         10 |        60 
           |      1.37       1.16 |      1.33 
-----------+----------------------+----------
        60 |     3,595        849 |     4,444 
           |     98.60      98.84 |     98.65 
-----------+----------------------+----------
     Total |     3,646        859 |     4,505 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     3,803        903 |     4,706 
                      |     98.68      98.90 |     98.72 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        51         10 |        61 
                      |      1.32       1.10 |      1.28 
----------------------+----------------------+----------
                Total |     3,854        913 |     4,767 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,110        722 |     3,832 
           |     80.70      79.08 |     80.39 
-----------+----------------------+----------
         1 |       744        191 |       935 
           |     19.30      20.92 |     19.61 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,084        732 |     3,816 
           |     80.02      80.18 |     80.05 
-----------+----------------------+----------
         1 |       770        181 |       951 
           |     19.98      19.82 |     19.95 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     2,708        635 |     3,343 
                 |     70.26      69.55 |     70.13 
-----------------+----------------------+----------
               4 |       762        188 |       950 
                 |     19.77      20.59 |     19.93 
-----------------+----------------------+----------
 5 most deprived |       384         90 |       474 
                 |      9.96       9.86 |      9.94 
-----------------+----------------------+----------
           Total |     3,854        913 |     4,767 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     2,307        549 |     2,856 
                      |     59.86      60.13 |     59.91 
----------------------+----------------------+----------
Asian or Asian Britis |       306         72 |       378 
                      |      7.94       7.89 |      7.93 
----------------------+----------------------+----------
                Other |       276         55 |       331 
                      |      7.16       6.02 |      6.94 
----------------------+----------------------+----------
              Unknown |       965        237 |     1,202 
                      |     25.04      25.96 |     25.22 
----------------------+----------------------+----------
                Total |     3,854        913 |     4,767 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       399         93 |       492 
           |     10.35      10.19 |     10.32 
-----------+----------------------+----------
         2 |       378        102 |       480 
           |      9.81      11.17 |     10.07 
-----------+----------------------+----------
         3 |       405         92 |       497 
           |     10.51      10.08 |     10.43 
-----------+----------------------+----------
         4 |       363         82 |       445 
           |      9.42       8.98 |      9.34 
-----------+----------------------+----------
         5 |       394         81 |       475 
           |     10.22       8.87 |      9.96 
-----------+----------------------+----------
         6 |       389         96 |       485 
           |     10.09      10.51 |     10.17 
-----------+----------------------+----------
         7 |       383         68 |       451 
           |      9.94       7.45 |      9.46 
-----------+----------------------+----------
         8 |       364        100 |       464 
           |      9.44      10.95 |      9.73 
-----------+----------------------+----------
         9 |       366         99 |       465 
           |      9.50      10.84 |      9.75 
-----------+----------------------+----------
        10 |       413        100 |       513 
           |     10.72      10.95 |     10.76 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |    death/ITU adm.
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       961          2 |       963 
           |     20.22      14.29 |     20.20 
-----------+----------------------+----------
    30-<40 |       786          5 |       791 
           |     16.54      35.71 |     16.59 
-----------+----------------------+----------
    40-<50 |       722          1 |       723 
           |     15.19       7.14 |     15.17 
-----------+----------------------+----------
    50-<60 |       826          1 |       827 
           |     17.38       7.14 |     17.35 
-----------+----------------------+----------
    60-<70 |       682          3 |       685 
           |     14.35      21.43 |     14.37 
-----------+----------------------+----------
    70-<80 |       468          2 |       470 
           |      9.85      14.29 |      9.86 
-----------+----------------------+----------
       80+ |       308          0 |       308 
           |      6.48       0.00 |      6.46 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    death/ITU adm.
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,421          6 |     2,427 
           |     50.94      42.86 |     50.91 
-----------+----------------------+----------
         1 |     2,332          8 |     2,340 
           |     49.06      57.14 |     49.09 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |    death/ITU adm.
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |        26          0 |        26 
                     |      0.55       0.00 |      0.55 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       110          0 |       110 
                     |      2.31       0.00 |      2.31 
---------------------+----------------------+----------
Overweight (25-29.9) |       153          1 |       154 
                     |      3.22       7.14 |      3.23 
---------------------+----------------------+----------
   Obese I (30-34.9) |       175          1 |       176 
                     |      3.68       7.14 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |       168          0 |       168 
                     |      3.53       0.00 |      3.52 
---------------------+----------------------+----------
     Obese III (40+) |       224          0 |       224 
                     |      4.71       0.00 |      4.70 
---------------------+----------------------+----------
        Unknown (.u) |     3,897         12 |     3,909 
                     |     81.99      85.71 |     82.00 
---------------------+----------------------+----------
               Total |     4,753         14 |     4,767 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |    death/ITU adm.
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       195          1 |       196 
             |      4.10       7.14 |      4.11 
-------------+----------------------+----------
      Former |        91          0 |        91 
             |      1.91       0.00 |      1.91 
-------------+----------------------+----------
     Current |       594          1 |       595 
             |     12.50       7.14 |     12.48 
-------------+----------------------+----------
Unknown (.u) |     3,873         12 |     3,885 
             |     81.49      85.71 |     81.50 
-------------+----------------------+----------
       Total |     4,753         14 |     4,767 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |    death/ITU adm.
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     4,186         13 |     4,199 
                     |     88.07      92.86 |     88.08 
---------------------+----------------------+----------
   Obese I (30-34.9) |       175          1 |       176 
                     |      3.68       7.14 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |       168          0 |       168 
                     |      3.53       0.00 |      3.52 
---------------------+----------------------+----------
     Obese III (40+) |       224          0 |       224 
                     |      4.71       0.00 |      4.70 
---------------------+----------------------+----------
               Total |     4,753         14 |     4,767 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
  Probable |    death/ITU adm.
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       899          2 |       901 
           |     18.91      14.29 |     18.90 
-----------+----------------------+----------
         1 |     3,854         12 |     3,866 
           |     81.09      85.71 |     81.10 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |    death/ITU adm.
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,814         13 |     3,827 
           |     80.24      92.86 |     80.28 
-----------+----------------------+----------
         1 |       939          1 |       940 
           |     19.76       7.14 |     19.72 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |    death/ITU adm.
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,399         12 |     4,411 
           |     92.55      85.71 |     92.53 
-----------+----------------------+----------
         1 |       354          2 |       356 
           |      7.45      14.29 |      7.47 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |    death/ITU adm.
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,789         12 |     3,801 
           |     79.72      85.71 |     79.74 
-----------+----------------------+----------
         1 |       964          2 |       966 
           |     20.28      14.29 |     20.26 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    death/ITU adm.
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,803         10 |     3,813 
           |     80.01      71.43 |     79.99 
-----------+----------------------+----------
         1 |       950          4 |       954 
           |     19.99      28.57 |     20.01 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |    death/ITU adm.
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     3,773          7 |     3,780 
              |     79.38      50.00 |     79.30 
--------------+----------------------+----------
    Last year |        20          0 |        20 
              |      0.42       0.00 |      0.42 
--------------+----------------------+----------
2-5 years ago |        70          0 |        70 
              |      1.47       0.00 |      1.47 
--------------+----------------------+----------
     5+ years |       890          7 |       897 
              |     18.73      50.00 |     18.82 
--------------+----------------------+----------
        Total |     4,753         14 |     4,767 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |    death/ITU adm.
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     3,790         12 |     3,802 
              |     79.74      85.71 |     79.76 
--------------+----------------------+----------
    Last year |        20          0 |        20 
              |      0.42       0.00 |      0.42 
--------------+----------------------+----------
2-5 years ago |        69          0 |        69 
              |      1.45       0.00 |      1.45 
--------------+----------------------+----------
     5+ years |       874          2 |       876 
              |     18.39      14.29 |     18.38 
--------------+----------------------+----------
        Total |     4,753         14 |     4,767 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |    death/ITU adm.
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,018         11 |     3,029 
           |     63.50      78.57 |     63.54 
-----------+----------------------+----------
         1 |     1,735          3 |     1,738 
           |     36.50      21.43 |     36.46 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |    outcome: covid
     organ |    death/ITU adm.
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,842         11 |     3,853 
           |     80.83      78.57 |     80.83 
-----------+----------------------+----------
         1 |       911          3 |       914 
           |     19.17      21.43 |     19.17 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    death/ITU adm.
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,820         10 |     3,830 
           |     80.37      71.43 |     80.34 
-----------+----------------------+----------
         1 |       933          4 |       937 
           |     19.63      28.57 |     19.66 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |    death/ITU adm.
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,815         12 |     3,827 
           |     80.27      85.71 |     80.28 
-----------+----------------------+----------
         1 |       938          2 |       940 
           |     19.73      14.29 |     19.72 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |    death/ITU adm.
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,776         10 |     3,786 
           |     79.44      71.43 |     79.42 
-----------+----------------------+----------
         1 |       977          4 |       981 
           |     20.56      28.57 |     20.58 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |    death/ITU adm.
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,794         10 |     3,804 
           |     79.82      71.43 |     79.80 
-----------+----------------------+----------
         1 |       959          4 |       963 
           |     20.18      28.57 |     20.20 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |    death/ITU adm.
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        30 |         1          0 |         1 
           |      0.02       0.00 |      0.02 
-----------+----------------------+----------
        45 |        60          0 |        60 
           |      1.34       0.00 |      1.33 
-----------+----------------------+----------
        60 |     4,430         14 |     4,444 
           |     98.64     100.00 |     98.65 
-----------+----------------------+----------
     Total |     4,491         14 |     4,505 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |    death/ITU adm.
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     4,692         14 |     4,706 
                      |     98.72     100.00 |     98.72 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        61          0 |        61 
                      |      1.28       0.00 |      1.28 
----------------------+----------------------+----------
                Total |     4,753         14 |     4,767 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |    death/ITU adm.
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,820         12 |     3,832 
           |     80.37      85.71 |     80.39 
-----------+----------------------+----------
         1 |       933          2 |       935 
           |     19.63      14.29 |     19.61 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |    death/ITU adm.
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,803         13 |     3,816 
           |     80.01      92.86 |     80.05 
-----------+----------------------+----------
         1 |       950          1 |       951 
           |     19.99       7.14 |     19.95 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |    death/ITU adm.
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     3,335          8 |     3,343 
                 |     70.17      57.14 |     70.13 
-----------------+----------------------+----------
               4 |       944          6 |       950 
                 |     19.86      42.86 |     19.93 
-----------------+----------------------+----------
 5 most deprived |       474          0 |       474 
                 |      9.97       0.00 |      9.94 
-----------------+----------------------+----------
           Total |     4,753         14 |     4,767 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |    death/ITU adm.
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     2,848          8 |     2,856 
                      |     59.92      57.14 |     59.91 
----------------------+----------------------+----------
Asian or Asian Britis |       377          1 |       378 
                      |      7.93       7.14 |      7.93 
----------------------+----------------------+----------
                Other |       330          1 |       331 
                      |      6.94       7.14 |      6.94 
----------------------+----------------------+----------
              Unknown |     1,198          4 |     1,202 
                      |     25.21      28.57 |     25.22 
----------------------+----------------------+----------
                Total |     4,753         14 |     4,767 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |    outcome: covid
Partnershi |    death/ITU adm.
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       490          2 |       492 
           |     10.31      14.29 |     10.32 
-----------+----------------------+----------
         2 |       479          1 |       480 
           |     10.08       7.14 |     10.07 
-----------+----------------------+----------
         3 |       495          2 |       497 
           |     10.41      14.29 |     10.43 
-----------+----------------------+----------
         4 |       444          1 |       445 
           |      9.34       7.14 |      9.34 
-----------+----------------------+----------
         5 |       472          3 |       475 
           |      9.93      21.43 |      9.96 
-----------+----------------------+----------
         6 |       482          3 |       485 
           |     10.14      21.43 |     10.17 
-----------+----------------------+----------
         7 |       450          1 |       451 
           |      9.47       7.14 |      9.46 
-----------+----------------------+----------
         8 |       464          0 |       464 
           |      9.76       0.00 |      9.73 
-----------+----------------------+----------
         9 |       465          0 |       465 
           |      9.78       0.00 |      9.75 
-----------+----------------------+----------
        10 |       512          1 |       513 
           |     10.77       7.14 |     10.76 
-----------+----------------------+----------
     Total |     4,753         14 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |    prob/susp. case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       595        368 |       963 
           |     19.00      22.49 |     20.20 
-----------+----------------------+----------
    30-<40 |       527        264 |       791 
           |     16.83      16.14 |     16.59 
-----------+----------------------+----------
    40-<50 |       469        254 |       723 
           |     14.98      15.53 |     15.17 
-----------+----------------------+----------
    50-<60 |       562        265 |       827 
           |     17.95      16.20 |     17.35 
-----------+----------------------+----------
    60-<70 |       454        231 |       685 
           |     14.50      14.12 |     14.37 
-----------+----------------------+----------
    70-<80 |       308        162 |       470 
           |      9.84       9.90 |      9.86 
-----------+----------------------+----------
       80+ |       216         92 |       308 
           |      6.90       5.62 |      6.46 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,615        812 |     2,427 
           |     51.58      49.63 |     50.91 
-----------+----------------------+----------
         1 |     1,516        824 |     2,340 
           |     48.42      50.37 |     49.09 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |    prob/susp. case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |        15         11 |        26 
                     |      0.48       0.67 |      0.55 
---------------------+----------------------+----------
  Normal (18.5-24.9) |        72         38 |       110 
                     |      2.30       2.32 |      2.31 
---------------------+----------------------+----------
Overweight (25-29.9) |       103         51 |       154 
                     |      3.29       3.12 |      3.23 
---------------------+----------------------+----------
   Obese I (30-34.9) |       115         61 |       176 
                     |      3.67       3.73 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |       114         54 |       168 
                     |      3.64       3.30 |      3.52 
---------------------+----------------------+----------
     Obese III (40+) |       143         81 |       224 
                     |      4.57       4.95 |      4.70 
---------------------+----------------------+----------
        Unknown (.u) |     2,569      1,340 |     3,909 
                     |     82.05      81.91 |     82.00 
---------------------+----------------------+----------
               Total |     3,131      1,636 |     4,767 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |    prob/susp. case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       136         60 |       196 
             |      4.34       3.67 |      4.11 
-------------+----------------------+----------
      Former |        59         32 |        91 
             |      1.88       1.96 |      1.91 
-------------+----------------------+----------
     Current |       392        203 |       595 
             |     12.52      12.41 |     12.48 
-------------+----------------------+----------
Unknown (.u) |     2,544      1,341 |     3,885 
             |     81.25      81.97 |     81.50 
-------------+----------------------+----------
       Total |     3,131      1,636 |     4,767 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |    prob/susp. case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     2,759      1,440 |     4,199 
                     |     88.12      88.02 |     88.08 
---------------------+----------------------+----------
   Obese I (30-34.9) |       115         61 |       176 
                     |      3.67       3.73 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |       114         54 |       168 
                     |      3.64       3.30 |      3.52 
---------------------+----------------------+----------
     Obese III (40+) |       143         81 |       224 
                     |      4.57       4.95 |      4.70 
---------------------+----------------------+----------
               Total |     3,131      1,636 |     4,767 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
  Probable |    prob/susp. case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       594        307 |       901 
           |     18.97      18.77 |     18.90 
-----------+----------------------+----------
         1 |     2,537      1,329 |     3,866 
           |     81.03      81.23 |     81.10 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |    prob/susp. case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,505      1,322 |     3,827 
           |     80.01      80.81 |     80.28 
-----------+----------------------+----------
         1 |       626        314 |       940 
           |     19.99      19.19 |     19.72 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |    prob/susp. case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,898      1,513 |     4,411 
           |     92.56      92.48 |     92.53 
-----------+----------------------+----------
         1 |       233        123 |       356 
           |      7.44       7.52 |      7.47 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |    prob/susp. case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,495      1,306 |     3,801 
           |     79.69      79.83 |     79.74 
-----------+----------------------+----------
         1 |       636        330 |       966 
           |     20.31      20.17 |     20.26 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      1,322 |     3,813 
           |     79.56      80.81 |     79.99 
-----------+----------------------+----------
         1 |       640        314 |       954 
           |     20.44      19.19 |     20.01 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |    prob/susp. case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     2,459      1,321 |     3,780 
              |     78.54      80.75 |     79.30 
--------------+----------------------+----------
    Last year |        13          7 |        20 
              |      0.42       0.43 |      0.42 
--------------+----------------------+----------
2-5 years ago |        45         25 |        70 
              |      1.44       1.53 |      1.47 
--------------+----------------------+----------
     5+ years |       614        283 |       897 
              |     19.61      17.30 |     18.82 
--------------+----------------------+----------
        Total |     3,131      1,636 |     4,767 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |    prob/susp. case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     2,506      1,296 |     3,802 
              |     80.04      79.22 |     79.76 
--------------+----------------------+----------
    Last year |        10         10 |        20 
              |      0.32       0.61 |      0.42 
--------------+----------------------+----------
2-5 years ago |        45         24 |        69 
              |      1.44       1.47 |      1.45 
--------------+----------------------+----------
     5+ years |       570        306 |       876 
              |     18.21      18.70 |     18.38 
--------------+----------------------+----------
        Total |     3,131      1,636 |     4,767 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |    prob/susp. case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,003      1,026 |     3,029 
           |     63.97      62.71 |     63.54 
-----------+----------------------+----------
         1 |     1,128        610 |     1,738 
           |     36.03      37.29 |     36.46 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |    outcome: covid
     organ |    prob/susp. case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,523      1,330 |     3,853 
           |     80.58      81.30 |     80.83 
-----------+----------------------+----------
         1 |       608        306 |       914 
           |     19.42      18.70 |     19.17 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,535      1,295 |     3,830 
           |     80.96      79.16 |     80.34 
-----------+----------------------+----------
         1 |       596        341 |       937 
           |     19.04      20.84 |     19.66 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |    prob/susp. case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,506      1,321 |     3,827 
           |     80.04      80.75 |     80.28 
-----------+----------------------+----------
         1 |       625        315 |       940 
           |     19.96      19.25 |     19.72 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |    prob/susp. case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,475      1,311 |     3,786 
           |     79.05      80.13 |     79.42 
-----------+----------------------+----------
         1 |       656        325 |       981 
           |     20.95      19.87 |     20.58 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |    prob/susp. case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,489      1,315 |     3,804 
           |     79.50      80.38 |     79.80 
-----------+----------------------+----------
         1 |       642        321 |       963 
           |     20.50      19.62 |     20.20 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |    prob/susp. case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        30 |         1          0 |         1 
           |      0.03       0.00 |      0.02 
-----------+----------------------+----------
        45 |        41         19 |        60 
           |      1.39       1.23 |      1.33 
-----------+----------------------+----------
        60 |     2,915      1,529 |     4,444 
           |     98.58      98.77 |     98.65 
-----------+----------------------+----------
     Total |     2,957      1,548 |     4,505 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |    prob/susp. case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     3,089      1,617 |     4,706 
                      |     98.66      98.84 |     98.72 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        42         19 |        61 
                      |      1.34       1.16 |      1.28 
----------------------+----------------------+----------
                Total |     3,131      1,636 |     4,767 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |    prob/susp. case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,531      1,301 |     3,832 
           |     80.84      79.52 |     80.39 
-----------+----------------------+----------
         1 |       600        335 |       935 
           |     19.16      20.48 |     19.61 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |    prob/susp. case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,489      1,327 |     3,816 
           |     79.50      81.11 |     80.05 
-----------+----------------------+----------
         1 |       642        309 |       951 
           |     20.50      18.89 |     19.95 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |    prob/susp. case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     2,195      1,148 |     3,343 
                 |     70.11      70.17 |     70.13 
-----------------+----------------------+----------
               4 |       618        332 |       950 
                 |     19.74      20.29 |     19.93 
-----------------+----------------------+----------
 5 most deprived |       318        156 |       474 
                 |     10.16       9.54 |      9.94 
-----------------+----------------------+----------
           Total |     3,131      1,636 |     4,767 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |    prob/susp. case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     1,870        986 |     2,856 
                      |     59.73      60.27 |     59.91 
----------------------+----------------------+----------
Asian or Asian Britis |       249        129 |       378 
                      |      7.95       7.89 |      7.93 
----------------------+----------------------+----------
                Other |       226        105 |       331 
                      |      7.22       6.42 |      6.94 
----------------------+----------------------+----------
              Unknown |       786        416 |     1,202 
                      |     25.10      25.43 |     25.22 
----------------------+----------------------+----------
                Total |     3,131      1,636 |     4,767 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |    outcome: covid
Partnershi |    prob/susp. case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       322        170 |       492 
           |     10.28      10.39 |     10.32 
-----------+----------------------+----------
         2 |       327        153 |       480 
           |     10.44       9.35 |     10.07 
-----------+----------------------+----------
         3 |       332        165 |       497 
           |     10.60      10.09 |     10.43 
-----------+----------------------+----------
         4 |       294        151 |       445 
           |      9.39       9.23 |      9.34 
-----------+----------------------+----------
         5 |       326        149 |       475 
           |     10.41       9.11 |      9.96 
-----------+----------------------+----------
         6 |       304        181 |       485 
           |      9.71      11.06 |     10.17 
-----------+----------------------+----------
         7 |       297        154 |       451 
           |      9.49       9.41 |      9.46 
-----------+----------------------+----------
         8 |       301        163 |       464 
           |      9.61       9.96 |      9.73 
-----------+----------------------+----------
         9 |       297        168 |       465 
           |      9.49      10.27 |      9.75 
-----------+----------------------+----------
        10 |       331        182 |       513 
           |     10.57      11.12 |     10.76 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |    100.00     100.00 |    100.00 

. 
. 
. ********************************************
. *  Cumulative incidence of ONS COVID DEATH /ICNARC ITU ADM.*
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_death_itu.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_death_itu
   analysis time _t:  (stime_covid_death_itu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80       457        1              0.0022    0.0022     0.0003    0.0154
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80       400        3              0.0075    0.0043     0.0024    0.0230
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80       389        1              0.0026    0.0026     0.0004    0.0181
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80       355        0              0.0000         .          .         .
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80       368        1              0.0027    0.0027     0.0004    0.0191
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80       423        0              0.0000         .          .         .
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80       404        1              0.0025    0.0025     0.0003    0.0174
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80       349        1              0.0029    0.0029     0.0004    0.0202
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80       336        1              0.0030    0.0030     0.0004    0.0209
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
80+ male=0 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
80+ male=1 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. ***************************************
. *  Cumulative incidence of TPP COVID PROB/SUSP CASES *
. ***************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob_or_susp.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_tpp_prob_or_susp
   analysis time _t:  (stime_covid_tpp_prob_or_susp-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80       423      125              0.2475    0.0192     0.2122    0.2876
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80       387      114              0.2492    0.0202     0.2121    0.2914
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80       348       74              0.1844    0.0194     0.1498    0.2259
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80       324       96              0.2468    0.0219     0.2070    0.2928
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80       299       79              0.2228    0.0221     0.1829    0.2698
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80       301       91              0.2473    0.0225     0.2064    0.2947
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80       370       78              0.1846    0.0189     0.1507    0.2250
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80       348       80              0.1980    0.0198     0.1624    0.2403
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80       305       69              0.1977    0.0213     0.1596    0.2435
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80       285       73              0.2173    0.0225     0.1769    0.2653
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80       205       50              0.2137    0.0268     0.1665    0.2719
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80       199       56              0.2373    0.0277     0.1880    0.2969
80+ male=0 
       0         0        0              0.0000         .          .         .
      80       144       19              0.1195    0.0257     0.0779    0.1809
80+ male=1 
       0         0        0              0.0000         .          .         .
      80       130       28              0.1879    0.0320     0.1338    0.2604
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. ***************************************
. *  Cumulative incidence of TPP COVID PROBABLE CASES *
. ***************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80       456       66              0.1307    0.0150     0.1042    0.1633
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80       417       65              0.1421    0.0163     0.1132    0.1775
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80       375       38              0.0947    0.0146     0.0698    0.1278
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80       348       58              0.1491    0.0181     0.1173    0.1885
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80       332       37              0.1044    0.0162     0.0767    0.1411
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80       340       43              0.1168    0.0167     0.0880    0.1543
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80       395       45              0.1065    0.0150     0.0806    0.1400
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80       371       48              0.1190    0.0161     0.0911    0.1548
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80       326       36              0.1032    0.0163     0.0755    0.1401
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80       308       44              0.1310    0.0184     0.0992    0.1719
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80       215       33              0.1410    0.0228     0.1024    0.1926
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80       219       29              0.1229    0.0214     0.0871    0.1720
80+ male=0 
       0         0        0              0.0000         .          .         .
      80       152        8              0.0503    0.0173     0.0255    0.0981
80+ male=1 
       0         0        0              0.0000         .          .         .
      80       140       13              0.0872    0.0231     0.0516    0.1455
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  C:\Users\ENCDHFOR\Documents\GitHub\school-age-children-and-covid\analy
> sis\output/03_an_descriptive_tables.log
  log type:  text
 closed on:   6 Jul 2020, 17:03:52
-----------------------------------------------------------------------------------
