-------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\ENCDHFOR\Documents\GitHub\school-age-children-and-covid\analysis\output/03_an_descriptive_tables.log
  log type:  text
 opened on:   7 Jul 2020, 13:30:24

. 
. use $tempdir\analysis_dataset, clear

. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      5,028    48.86814    18.97797         18        108

. tab agegroup

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |      1,009       20.07       20.07
     30-<40 |        835       16.61       36.67
     40-<50 |        769       15.29       51.97
     50-<60 |        862       17.14       69.11
     60-<70 |        732       14.56       83.67
     70-<80 |        501        9.96       93.64
        80+ |        320        6.36      100.00
------------+-----------------------------------
      Total |      5,028      100.00

. tab age66

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,979       79.14       79.14
          1 |      1,049       20.86      100.00
------------+-----------------------------------
      Total |      5,028      100.00

. tab male

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,545       50.62       50.62
          1 |      2,483       49.38      100.00
------------+-----------------------------------
      Total |      5,028      100.00

. tab bmicat

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |         28        3.10        3.10
  Normal (18.5-24.9) |        113       12.51       15.61
Overweight (25-29.9) |        159       17.61       33.22
   Obese I (30-34.9) |        188       20.82       54.04
  Obese II (35-39.9) |        178       19.71       73.75
     Obese III (40+) |        237       26.25      100.00
---------------------+-----------------------------------
               Total |        903      100.00

. tab bmicat, m

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |         28        0.56        0.56
  Normal (18.5-24.9) |        113        2.25        2.80
Overweight (25-29.9) |        159        3.16        5.97
   Obese I (30-34.9) |        188        3.74        9.71
  Obese II (35-39.9) |        178        3.54       13.25
     Obese III (40+) |        237        4.71       17.96
        Unknown (.u) |      4,125       82.04      100.00
---------------------+-----------------------------------
               Total |      5,028      100.00

. tab obese4cat

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |      4,425       88.01       88.01
   Obese I (30-34.9) |        188        3.74       91.75
  Obese II (35-39.9) |        178        3.54       95.29
     Obese III (40+) |        237        4.71      100.00
---------------------+-----------------------------------
               Total |      5,028      100.00

. tab smoke

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        204       21.98       21.98
      Former |         96       10.34       32.33
     Current |        628       67.67      100.00
-------------+-----------------------------------
       Total |        928      100.00

. tab smoke, m

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        204        4.06        4.06
      Former |         96        1.91        5.97
     Current |        628       12.49       18.46
Unknown (.u) |      4,100       81.54      100.00
-------------+-----------------------------------
       Total |      5,028      100.00

. tab bpcat

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |          1        0.02        0.02
 High, stage I |          4        0.09        0.11
High, stage II |      4,528       99.89      100.00
---------------+-----------------------------------
         Total |      4,533      100.00

. tab bpcat, m

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |          1        0.02        0.02
 High, stage I |          4        0.08        0.10
High, stage II |      4,528       90.06       90.16
       Unknown |        495        9.84      100.00
---------------+-----------------------------------
         Total |      5,028      100.00

. tab htdiag_or_highbp

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        391        7.78        7.78
          1 |      4,637       92.22      100.00
------------+-----------------------------------
      Total |      5,028      100.00

. 
. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 organ_trans                     /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2.                                                 
. tab `var'
  3. }

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,049       80.53       80.53
          1 |        979       19.47      100.00
------------+-----------------------------------
      Total |      5,028      100.00

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,650       92.48       92.48
          1 |        378        7.52      100.00
------------+-----------------------------------
      Total |      5,028      100.00

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,002       79.59       79.59
          1 |      1,026       20.41      100.00
------------+-----------------------------------
      Total |      5,028      100.00

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,032       80.19       80.19
          1 |        996       19.81      100.00
------------+-----------------------------------
      Total |      5,028      100.00

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      4,001       79.57       79.57
    Last year |         23        0.46       80.03
2-5 years ago |         72        1.43       81.46
     5+ years |        932       18.54      100.00
--------------+-----------------------------------
        Total |      5,028      100.00

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      4,016       79.87       79.87
    Last year |         21        0.42       80.29
2-5 years ago |         70        1.39       81.68
     5+ years |        921       18.32      100.00
--------------+-----------------------------------
        Total |      5,028      100.00

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      5,028      100.00      100.00
------------+-----------------------------------
      Total |      5,028      100.00

Solid organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,068       80.91       80.91
          1 |        960       19.09      100.00
------------+-----------------------------------
      Total |      5,028      100.00

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,039       80.33       80.33
          1 |        989       19.67      100.00
------------+-----------------------------------
      Total |      5,028      100.00

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,022       79.99       79.99
          1 |      1,006       20.01      100.00
------------+-----------------------------------
      Total |      5,028      100.00

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,992       79.40       79.40
          1 |      1,036       20.60      100.00
------------+-----------------------------------
      Total |      5,028      100.00

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,011       79.77       79.77
          1 |      1,017       20.23      100.00
------------+-----------------------------------
      Total |      5,028      100.00

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
         30 |          1        0.02        0.02
         45 |         64        1.35        1.37
         60 |      4,693       98.63      100.00
------------+-----------------------------------
      Total |      4,758      100.00

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |      4,963       98.71       98.71
Stage 3a/3b egfr 30-60       |         65        1.29      100.00
-----------------------------+-----------------------------------
                       Total |      5,028      100.00

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,038       80.31       80.31
          1 |        990       19.69      100.00
------------+-----------------------------------
      Total |      5,028      100.00

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,028       80.11       80.11
          1 |      1,000       19.89      100.00
------------+-----------------------------------
      Total |      5,028      100.00

. 
. tab imd 

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,524       70.09       70.09
               4 |      1,009       20.07       90.16
 5 most deprived |        495        9.84      100.00
-----------------+-----------------------------------
           Total |      5,028      100.00

. tab imd, m

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,524       70.09       70.09
               4 |      1,009       20.07       90.16
 5 most deprived |        495        9.84      100.00
-----------------+-----------------------------------
           Total |      5,028      100.00

. tab ethnicity

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,012       80.09       80.09
Asian or Asian British |        398       10.58       90.67
                 Other |        351        9.33      100.00
-----------------------+-----------------------------------
                 Total |      3,761      100.00

. tab ethnicity, m

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,012       59.90       59.90
Asian or Asian British |        398        7.92       67.82
                 Other |        351        6.98       74.80
               Unknown |      1,267       25.20      100.00
-----------------------+-----------------------------------
                 Total |      5,028      100.00

. tab stp

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        521       10.36       10.36
          2 |        503       10.00       20.37
          3 |        525       10.44       30.81
          4 |        466        9.27       40.08
          5 |        494        9.82       49.90
          6 |        526       10.46       60.36
          7 |        473        9.41       69.77
          8 |        487        9.69       79.46
          9 |        490        9.75       89.20
         10 |        543       10.80      100.00
------------+-----------------------------------
      Total |      5,028      100.00

. 
. 
. * Outcomes
. tab covid_death_itu

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  death/ITU |
       adm. |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,016       99.76       99.76
          1 |         12        0.24      100.00
------------+-----------------------------------
      Total |      5,028      100.00

. tab covid_tpp_prob_or_susp

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
 prob/susp. |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,302       65.67       65.67
          1 |      1,726       34.33      100.00
------------+-----------------------------------
      Total |      5,028      100.00

. 
. 
. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist covid_death_itu covid_tpp_prob_or_susp {
  2. 
. *** Repeat for each outcome
. 
.         * Demographics
.         tab agegroup                                                    `outvar', col
  3.         tab male                                                                `outvar', col
  4.         tab bmicat                                                              `outvar', col m 
  5.         tab smoke                                                               `outvar', col m
  6.         tab obese4cat                                                   `outvar', col m 
  7. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 organ_trans                     /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  8.         tab `var'               `outvar', col
  9. }
 10.         
.         tab imd                                                                 `outvar', col m
 11.         tab ethnicity                                                   `outvar', col m
 12.         *tab urban                                                              `outvar', col
.         tab stp                                                                 `outvar', col
 13. }

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |    death/ITU adm.
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     1,007          2 |     1,009 
           |     20.08      16.67 |     20.07 
-----------+----------------------+----------
    30-<40 |       831          4 |       835 
           |     16.57      33.33 |     16.61 
-----------+----------------------+----------
    40-<50 |       768          1 |       769 
           |     15.31       8.33 |     15.29 
-----------+----------------------+----------
    50-<60 |       861          1 |       862 
           |     17.17       8.33 |     17.14 
-----------+----------------------+----------
    60-<70 |       729          3 |       732 
           |     14.53      25.00 |     14.56 
-----------+----------------------+----------
    70-<80 |       500          1 |       501 
           |      9.97       8.33 |      9.96 
-----------+----------------------+----------
       80+ |       320          0 |       320 
           |      6.38       0.00 |      6.36 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    death/ITU adm.
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,540          5 |     2,545 
           |     50.64      41.67 |     50.62 
-----------+----------------------+----------
         1 |     2,476          7 |     2,483 
           |     49.36      58.33 |     49.38 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |    death/ITU adm.
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |        28          0 |        28 
                     |      0.56       0.00 |      0.56 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       113          0 |       113 
                     |      2.25       0.00 |      2.25 
---------------------+----------------------+----------
Overweight (25-29.9) |       158          1 |       159 
                     |      3.15       8.33 |      3.16 
---------------------+----------------------+----------
   Obese I (30-34.9) |       187          1 |       188 
                     |      3.73       8.33 |      3.74 
---------------------+----------------------+----------
  Obese II (35-39.9) |       178          0 |       178 
                     |      3.55       0.00 |      3.54 
---------------------+----------------------+----------
     Obese III (40+) |       237          0 |       237 
                     |      4.72       0.00 |      4.71 
---------------------+----------------------+----------
        Unknown (.u) |     4,115         10 |     4,125 
                     |     82.04      83.33 |     82.04 
---------------------+----------------------+----------
               Total |     5,016         12 |     5,028 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |    death/ITU adm.
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       203          1 |       204 
             |      4.05       8.33 |      4.06 
-------------+----------------------+----------
      Former |        96          0 |        96 
             |      1.91       0.00 |      1.91 
-------------+----------------------+----------
     Current |       627          1 |       628 
             |     12.50       8.33 |     12.49 
-------------+----------------------+----------
Unknown (.u) |     4,090         10 |     4,100 
             |     81.54      83.33 |     81.54 
-------------+----------------------+----------
       Total |     5,016         12 |     5,028 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |    death/ITU adm.
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     4,414         11 |     4,425 
                     |     88.00      91.67 |     88.01 
---------------------+----------------------+----------
   Obese I (30-34.9) |       187          1 |       188 
                     |      3.73       8.33 |      3.74 
---------------------+----------------------+----------
  Obese II (35-39.9) |       178          0 |       178 
                     |      3.55       0.00 |      3.54 
---------------------+----------------------+----------
     Obese III (40+) |       237          0 |       237 
                     |      4.72       0.00 |      4.71 
---------------------+----------------------+----------
               Total |     5,016         12 |     5,028 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |    death/ITU adm.
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,038         11 |     4,049 
           |     80.50      91.67 |     80.53 
-----------+----------------------+----------
         1 |       978          1 |       979 
           |     19.50       8.33 |     19.47 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |    death/ITU adm.
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,639         11 |     4,650 
           |     92.48      91.67 |     92.48 
-----------+----------------------+----------
         1 |       377          1 |       378 
           |      7.52       8.33 |      7.52 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |    death/ITU adm.
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,991         11 |     4,002 
           |     79.57      91.67 |     79.59 
-----------+----------------------+----------
         1 |     1,025          1 |     1,026 
           |     20.43       8.33 |     20.41 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    death/ITU adm.
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,023          9 |     4,032 
           |     80.20      75.00 |     80.19 
-----------+----------------------+----------
         1 |       993          3 |       996 
           |     19.80      25.00 |     19.81 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |    death/ITU adm.
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     3,995          6 |     4,001 
              |     79.65      50.00 |     79.57 
--------------+----------------------+----------
    Last year |        23          0 |        23 
              |      0.46       0.00 |      0.46 
--------------+----------------------+----------
2-5 years ago |        72          0 |        72 
              |      1.44       0.00 |      1.43 
--------------+----------------------+----------
     5+ years |       926          6 |       932 
              |     18.46      50.00 |     18.54 
--------------+----------------------+----------
        Total |     5,016         12 |     5,028 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |    death/ITU adm.
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     4,005         11 |     4,016 
              |     79.84      91.67 |     79.87 
--------------+----------------------+----------
    Last year |        21          0 |        21 
              |      0.42       0.00 |      0.42 
--------------+----------------------+----------
2-5 years ago |        70          0 |        70 
              |      1.40       0.00 |      1.39 
--------------+----------------------+----------
     5+ years |       920          1 |       921 
              |     18.34       8.33 |     18.32 
--------------+----------------------+----------
        Total |     5,016         12 |     5,028 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |    death/ITU adm.
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         1 |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |    outcome: covid
     organ |    death/ITU adm.
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,058         10 |     4,068 
           |     80.90      83.33 |     80.91 
-----------+----------------------+----------
         1 |       958          2 |       960 
           |     19.10      16.67 |     19.09 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    death/ITU adm.
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,031          8 |     4,039 
           |     80.36      66.67 |     80.33 
-----------+----------------------+----------
         1 |       985          4 |       989 
           |     19.64      33.33 |     19.67 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |    death/ITU adm.
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,012         10 |     4,022 
           |     79.98      83.33 |     79.99 
-----------+----------------------+----------
         1 |     1,004          2 |     1,006 
           |     20.02      16.67 |     20.01 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |    death/ITU adm.
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,983          9 |     3,992 
           |     79.41      75.00 |     79.40 
-----------+----------------------+----------
         1 |     1,033          3 |     1,036 
           |     20.59      25.00 |     20.60 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |    death/ITU adm.
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,002          9 |     4,011 
           |     79.78      75.00 |     79.77 
-----------+----------------------+----------
         1 |     1,014          3 |     1,017 
           |     20.22      25.00 |     20.23 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |    death/ITU adm.
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        30 |         1          0 |         1 
           |      0.02       0.00 |      0.02 
-----------+----------------------+----------
        45 |        64          0 |        64 
           |      1.35       0.00 |      1.35 
-----------+----------------------+----------
        60 |     4,681         12 |     4,693 
           |     98.63     100.00 |     98.63 
-----------+----------------------+----------
     Total |     4,746         12 |     4,758 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |    death/ITU adm.
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     4,951         12 |     4,963 
                      |     98.70     100.00 |     98.71 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        65          0 |        65 
                      |      1.30       0.00 |      1.29 
----------------------+----------------------+----------
                Total |     5,016         12 |     5,028 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |    death/ITU adm.
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,027         11 |     4,038 
           |     80.28      91.67 |     80.31 
-----------+----------------------+----------
         1 |       989          1 |       990 
           |     19.72       8.33 |     19.69 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |    death/ITU adm.
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,017         11 |     4,028 
           |     80.08      91.67 |     80.11 
-----------+----------------------+----------
         1 |       999          1 |     1,000 
           |     19.92       8.33 |     19.89 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |    death/ITU adm.
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     3,518          6 |     3,524 
                 |     70.14      50.00 |     70.09 
-----------------+----------------------+----------
               4 |     1,003          6 |     1,009 
                 |     20.00      50.00 |     20.07 
-----------------+----------------------+----------
 5 most deprived |       495          0 |       495 
                 |      9.87       0.00 |      9.84 
-----------------+----------------------+----------
           Total |     5,016         12 |     5,028 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |    death/ITU adm.
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     3,005          7 |     3,012 
                      |     59.91      58.33 |     59.90 
----------------------+----------------------+----------
Asian or Asian Britis |       397          1 |       398 
                      |      7.91       8.33 |      7.92 
----------------------+----------------------+----------
                Other |       350          1 |       351 
                      |      6.98       8.33 |      6.98 
----------------------+----------------------+----------
              Unknown |     1,264          3 |     1,267 
                      |     25.20      25.00 |     25.20 
----------------------+----------------------+----------
                Total |     5,016         12 |     5,028 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |    outcome: covid
Partnershi |    death/ITU adm.
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       519          2 |       521 
           |     10.35      16.67 |     10.36 
-----------+----------------------+----------
         2 |       502          1 |       503 
           |     10.01       8.33 |     10.00 
-----------+----------------------+----------
         3 |       524          1 |       525 
           |     10.45       8.33 |     10.44 
-----------+----------------------+----------
         4 |       465          1 |       466 
           |      9.27       8.33 |      9.27 
-----------+----------------------+----------
         5 |       491          3 |       494 
           |      9.79      25.00 |      9.82 
-----------+----------------------+----------
         6 |       524          2 |       526 
           |     10.45      16.67 |     10.46 
-----------+----------------------+----------
         7 |       472          1 |       473 
           |      9.41       8.33 |      9.41 
-----------+----------------------+----------
         8 |       487          0 |       487 
           |      9.71       0.00 |      9.69 
-----------+----------------------+----------
         9 |       490          0 |       490 
           |      9.77       0.00 |      9.75 
-----------+----------------------+----------
        10 |       542          1 |       543 
           |     10.81       8.33 |     10.80 
-----------+----------------------+----------
     Total |     5,016         12 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |    prob/susp. case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       629        380 |     1,009 
           |     19.05      22.02 |     20.07 
-----------+----------------------+----------
    30-<40 |       557        278 |       835 
           |     16.87      16.11 |     16.61 
-----------+----------------------+----------
    40-<50 |       495        274 |       769 
           |     14.99      15.87 |     15.29 
-----------+----------------------+----------
    50-<60 |       588        274 |       862 
           |     17.81      15.87 |     17.14 
-----------+----------------------+----------
    60-<70 |       484        248 |       732 
           |     14.66      14.37 |     14.56 
-----------+----------------------+----------
    70-<80 |       326        175 |       501 
           |      9.87      10.14 |      9.96 
-----------+----------------------+----------
       80+ |       223         97 |       320 
           |      6.75       5.62 |      6.36 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,694        851 |     2,545 
           |     51.30      49.30 |     50.62 
-----------+----------------------+----------
         1 |     1,608        875 |     2,483 
           |     48.70      50.70 |     49.38 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |    prob/susp. case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |        17         11 |        28 
                     |      0.51       0.64 |      0.56 
---------------------+----------------------+----------
  Normal (18.5-24.9) |        75         38 |       113 
                     |      2.27       2.20 |      2.25 
---------------------+----------------------+----------
Overweight (25-29.9) |       108         51 |       159 
                     |      3.27       2.95 |      3.16 
---------------------+----------------------+----------
   Obese I (30-34.9) |       126         62 |       188 
                     |      3.82       3.59 |      3.74 
---------------------+----------------------+----------
  Obese II (35-39.9) |       121         57 |       178 
                     |      3.66       3.30 |      3.54 
---------------------+----------------------+----------
     Obese III (40+) |       152         85 |       237 
                     |      4.60       4.92 |      4.71 
---------------------+----------------------+----------
        Unknown (.u) |     2,703      1,422 |     4,125 
                     |     81.86      82.39 |     82.04 
---------------------+----------------------+----------
               Total |     3,302      1,726 |     5,028 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |    prob/susp. case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       140         64 |       204 
             |      4.24       3.71 |      4.06 
-------------+----------------------+----------
      Former |        63         33 |        96 
             |      1.91       1.91 |      1.91 
-------------+----------------------+----------
     Current |       414        214 |       628 
             |     12.54      12.40 |     12.49 
-------------+----------------------+----------
Unknown (.u) |     2,685      1,415 |     4,100 
             |     81.31      81.98 |     81.54 
-------------+----------------------+----------
       Total |     3,302      1,726 |     5,028 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |    prob/susp. case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     2,903      1,522 |     4,425 
                     |     87.92      88.18 |     88.01 
---------------------+----------------------+----------
   Obese I (30-34.9) |       126         62 |       188 
                     |      3.82       3.59 |      3.74 
---------------------+----------------------+----------
  Obese II (35-39.9) |       121         57 |       178 
                     |      3.66       3.30 |      3.54 
---------------------+----------------------+----------
     Obese III (40+) |       152         85 |       237 
                     |      4.60       4.92 |      4.71 
---------------------+----------------------+----------
               Total |     3,302      1,726 |     5,028 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |    prob/susp. case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,654      1,395 |     4,049 
           |     80.38      80.82 |     80.53 
-----------+----------------------+----------
         1 |       648        331 |       979 
           |     19.62      19.18 |     19.47 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |    prob/susp. case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,058      1,592 |     4,650 
           |     92.61      92.24 |     92.48 
-----------+----------------------+----------
         1 |       244        134 |       378 
           |      7.39       7.76 |      7.52 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |    prob/susp. case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,628      1,374 |     4,002 
           |     79.59      79.61 |     79.59 
-----------+----------------------+----------
         1 |       674        352 |     1,026 
           |     20.41      20.39 |     20.41 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,640      1,392 |     4,032 
           |     79.95      80.65 |     80.19 
-----------+----------------------+----------
         1 |       662        334 |       996 
           |     20.05      19.35 |     19.81 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |    prob/susp. case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     2,607      1,394 |     4,001 
              |     78.95      80.76 |     79.57 
--------------+----------------------+----------
    Last year |        16          7 |        23 
              |      0.48       0.41 |      0.46 
--------------+----------------------+----------
2-5 years ago |        46         26 |        72 
              |      1.39       1.51 |      1.43 
--------------+----------------------+----------
     5+ years |       633        299 |       932 
              |     19.17      17.32 |     18.54 
--------------+----------------------+----------
        Total |     3,302      1,726 |     5,028 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |    prob/susp. case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     2,650      1,366 |     4,016 
              |     80.25      79.14 |     79.87 
--------------+----------------------+----------
    Last year |        10         11 |        21 
              |      0.30       0.64 |      0.42 
--------------+----------------------+----------
2-5 years ago |        46         24 |        70 
              |      1.39       1.39 |      1.39 
--------------+----------------------+----------
     5+ years |       596        325 |       921 
              |     18.05      18.83 |     18.32 
--------------+----------------------+----------
        Total |     3,302      1,726 |     5,028 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |    prob/susp. case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         1 |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Solid |    outcome: covid
     organ |    prob/susp. case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,666      1,402 |     4,068 
           |     80.74      81.23 |     80.91 
-----------+----------------------+----------
         1 |       636        324 |       960 
           |     19.26      18.77 |     19.09 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |    prob/susp. case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,674      1,365 |     4,039 
           |     80.98      79.08 |     80.33 
-----------+----------------------+----------
         1 |       628        361 |       989 
           |     19.02      20.92 |     19.67 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |    prob/susp. case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,634      1,388 |     4,022 
           |     79.77      80.42 |     79.99 
-----------+----------------------+----------
         1 |       668        338 |     1,006 
           |     20.23      19.58 |     20.01 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |    prob/susp. case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,612      1,380 |     3,992 
           |     79.10      79.95 |     79.40 
-----------+----------------------+----------
         1 |       690        346 |     1,036 
           |     20.90      20.05 |     20.60 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |    prob/susp. case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,629      1,382 |     4,011 
           |     79.62      80.07 |     79.77 
-----------+----------------------+----------
         1 |       673        344 |     1,017 
           |     20.38      19.93 |     20.23 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |    prob/susp. case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        30 |         1          0 |         1 
           |      0.03       0.00 |      0.02 
-----------+----------------------+----------
        45 |        43         21 |        64 
           |      1.38       1.28 |      1.35 
-----------+----------------------+----------
        60 |     3,079      1,614 |     4,693 
           |     98.59      98.72 |     98.63 
-----------+----------------------+----------
     Total |     3,123      1,635 |     4,758 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |    prob/susp. case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     3,258      1,705 |     4,963 
                      |     98.67      98.78 |     98.71 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        44         21 |        65 
                      |      1.33       1.22 |      1.29 
----------------------+----------------------+----------
                Total |     3,302      1,726 |     5,028 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |    prob/susp. case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,662      1,376 |     4,038 
           |     80.62      79.72 |     80.31 
-----------+----------------------+----------
         1 |       640        350 |       990 
           |     19.38      20.28 |     19.69 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |    prob/susp. case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,625      1,403 |     4,028 
           |     79.50      81.29 |     80.11 
-----------+----------------------+----------
         1 |       677        323 |     1,000 
           |     20.50      18.71 |     19.89 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |    prob/susp. case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     2,316      1,208 |     3,524 
                 |     70.14      69.99 |     70.09 
-----------------+----------------------+----------
               4 |       655        354 |     1,009 
                 |     19.84      20.51 |     20.07 
-----------------+----------------------+----------
 5 most deprived |       331        164 |       495 
                 |     10.02       9.50 |      9.84 
-----------------+----------------------+----------
           Total |     3,302      1,726 |     5,028 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |    prob/susp. case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     1,973      1,039 |     3,012 
                      |     59.75      60.20 |     59.90 
----------------------+----------------------+----------
Asian or Asian Britis |       262        136 |       398 
                      |      7.93       7.88 |      7.92 
----------------------+----------------------+----------
                Other |       240        111 |       351 
                      |      7.27       6.43 |      6.98 
----------------------+----------------------+----------
              Unknown |       827        440 |     1,267 
                      |     25.05      25.49 |     25.20 
----------------------+----------------------+----------
                Total |     3,302      1,726 |     5,028 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |    outcome: covid
Partnershi |    prob/susp. case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       340        181 |       521 
           |     10.30      10.49 |     10.36 
-----------+----------------------+----------
         2 |       343        160 |       503 
           |     10.39       9.27 |     10.00 
-----------+----------------------+----------
         3 |       351        174 |       525 
           |     10.63      10.08 |     10.44 
-----------+----------------------+----------
         4 |       310        156 |       466 
           |      9.39       9.04 |      9.27 
-----------+----------------------+----------
         5 |       337        157 |       494 
           |     10.21       9.10 |      9.82 
-----------+----------------------+----------
         6 |       324        202 |       526 
           |      9.81      11.70 |     10.46 
-----------+----------------------+----------
         7 |       314        159 |       473 
           |      9.51       9.21 |      9.41 
-----------+----------------------+----------
         8 |       316        171 |       487 
           |      9.57       9.91 |      9.69 
-----------+----------------------+----------
         9 |       315        175 |       490 
           |      9.54      10.14 |      9.75 
-----------+----------------------+----------
        10 |       352        191 |       543 
           |     10.66      11.07 |     10.80 
-----------+----------------------+----------
     Total |     3,302      1,726 |     5,028 
           |    100.00     100.00 |    100.00 

. 
. 
. ********************************************
. *  Cumulative incidence of ONS COVID DEATH /ICNARC ITU ADM.*
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_death_itu.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_death_itu
   analysis time _t:  (stime_covid_death_itu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80       479        1              0.0021    0.0021     0.0003    0.0147
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80       417        3              0.0072    0.0041     0.0023    0.0220
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80       416        1              0.0024    0.0024     0.0003    0.0169
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80       374        0              0.0000         .          .         .
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80       395        1              0.0025    0.0025     0.0004    0.0178
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80       441        0              0.0000         .          .         .
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80       421        1              0.0024    0.0024     0.0003    0.0167
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80       369        1              0.0027    0.0027     0.0004    0.0191
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80       363        1              0.0028    0.0028     0.0004    0.0194
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
80+ male=0 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
80+ male=1 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. ***************************************
. *  Cumulative incidence of TPP COVID CASES *
. ***************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob_or_susp.dta", clear

. 
. sts list , at(0 80) by(agegroup male) fail

         failure _d:  covid_tpp_prob_or_susp
   analysis time _t:  (stime_covid_tpp_prob_or_susp-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80       445      128              0.2420    0.0186     0.2077    0.2808
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80       404      120              0.2502    0.0198     0.2139    0.2915
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80       362       78              0.1865    0.0190     0.1523    0.2272
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80       350      100              0.2404    0.0210     0.2022    0.2844
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80       314       84              0.2248    0.0216     0.1858    0.2706
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80       325       96              0.2430    0.0216     0.2037    0.2885
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80       384       83              0.1884    0.0186     0.1549    0.2281
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80       364       82              0.1948    0.0193     0.1600    0.2359
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80       321       73              0.1978    0.0207     0.1607    0.2423
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80       307       80              0.2204    0.0218     0.1811    0.2666
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80       215       55              0.2218    0.0264     0.1750    0.2788
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80       214       59              0.2332    0.0266     0.1858    0.2903
80+ male=0 
       0         0        0              0.0000         .          .         .
      80       149       21              0.1273    0.0259     0.0849    0.1885
80+ male=1 
       0         0        0              0.0000         .          .         .
      80       134       30              0.1935    0.0317     0.1395    0.2650
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. 
. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  C:\Users\ENCDHFOR\Documents\GitHub\school-age-children-and-covid\analysis\output/03_an_descriptive_tables.log
  log type:  text
 closed on:   7 Jul 2020, 13:30:25
-------------------------------------------------------------------------------------------------------------------------------------------
