-------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\ENCDHFOR\Documents\GitHub\school-age-children-and-covid\analysis\output/an_interaction_cox_models_covid_death_itu.log
  log type:  text
 opened on:   7 Jul 2020, 13:30:58

. 
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. stset
-> stset stime_covid_death_itu, id(patient_id) failure(covid_death_itu)
                                enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death_itu != 0 & covid_death_itu < .
obs. time interval:  (stime_covid_death_itu[_n-1], stime_covid_death_itu]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      5,028  total observations
          0  exclusions
------------------------------------------------------------------------------
      5,028  observations remaining, representing
      5,028  subjects
         12  failures in single-failure-per-subject data
    557,306  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       111

. 
. *Split data by time of study period: days to April 3rd (31 d March, 3d April)
. stsplit cat_time, at(0,34, 200)
(5,025 observations (episodes) created)

. recode cat_time 34=1 200=2 
(cat_time: 5025 changes made)

. recode `outcome' .=0 
(covid_death_itu: 5025 changes made)

. tab cat_time

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,028       50.01       50.01
          1 |      5,025       49.99      100.00
------------+-----------------------------------
      Total |     10,053      100.00

.  
. /*Overlapping time periods
> gen cat_time0=1 if cat==0
> gen cat_time1=1 if cat==0 | cat==0.25
> */
.         
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interaction(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.  stcox  `exposure' `age'                                        ///
>                         i.male                                                  ///
>                         i.obese4cat                                             ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                   ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                                ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabetes                                              ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.organ_trans                           ///
>                         i.asplenia                                              ///
>                         i.additional_people                             ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                  ///
>                         `interaction'                                                   ///
>                         , strata(stp) vce(cluster household_size)
  7.         timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. foreach int_type in age66 male cat_time shield {
  2. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  3. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  4. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
  5. if _rc==0{
  6. testparm 1.`int_type'#i.`exposure_type'
  7. di _n "`exposure_type' <66" _n "****************"
  8. lincom 2.`exposure_type', eform
  9. di "`exposure_type' 66+" _n "****************"
 10. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 11. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth, repla
> ce
 12. }
 13. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 14. 
. }
 15. 
. /*Age interactions with 4-level vars: NOT in protocol - do not run
> foreach exposure_type in gp_number_kids {
> basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  bp("i.htdiag_or_highbp") ethnicity(0) interaction(1.`int_type'#1.`exposur
> e_type' 1.`int_type'#2.`exposure_type' 1.`int_type'#3.`exposure_type' 1.`int_type'#4.`exposure_type')
> if _rc==0{
> testparm 1.`int_type'#i.`exposure_type'
> di _n "`exposure_type' <66" _n "****************"
> lincom 2.`exposure_type', eform
> lincom 3.`exposure_type', eform
> lincom 4.`exposure_type', eform
> di "`exposure_type' 66+" _n "****************"
> lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
> lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
> lincom 4.`exposure_type' + 1.`int_type'#4.`exposure_type', eform
> estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth, replace
> }
> else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
> }
> */
. 
. }
variable additional_people not found
r(111);

end of do-file
r(111);

end of do-file

r(111);

. tab add
variable add not found
r(111);

