------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\ENCDHFOR\Documents\GitHub\school-age-children-and-covid\analysis\log
> \01_cr_create_analysis_dataset.log
  log type:  text
 opened on:  26 Jun 2020, 15:39:07

. 
. **************************** HOUSEHOLD VARS*******************************************
. 
. *No kids/kids under 11/up to 18
. *Identify kids under 11, or kids under 18
. gen kids=1 if age<11
(3,680 missing values generated)

. recode kids .=2 if age<18 
(kids: 0 changes made)

. bysort household_id: egen min_kids=min(kids) 
(3680 missing values generated)

. gen kids_cat3=min_kids
variable kids_cat3 already defined
r(110);

end of do-file

r(110);

. tab ckd

    Chronic |
     kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
     No CKD |      2,916       79.24       79.24
        CKD |        764       20.76      100.00
------------+-----------------------------------
      Total |      3,680      100.00

. exit, clear
