-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\ENCDHFOR\Documents\GitHub\school-age-children-and-covid\analy
> sis\log\02_an_data_checks.log
  log type:  text
 opened on:   6 Jul 2020, 17:03:50

. 
. * Open Stata dataset
. use $tempdir\analysis_dataset, clear

. 
. *run ssc install - retain as it seems the server needs to reinstall each time
. ssc install datacheck 
checking datacheck consistency and verifying not already installed...
all files already exist and are up to date.

. 
. *Duplicate patient check
. datacheck _n==1, by(patient_id) nol

. 
. 
. /* CHECK INCLUSION AND EXCLUSION CRITERIA=====================================*/ 
. 
. * DATA STRUCTURE: Confirm one row per patient 
. duplicates tag patient_id, generate(dup_check)

Duplicates in terms of patient_id

. assert dup_check == 0 

. drop dup_check

. 
. * INCLUSION 1: >=18 and <=110 at 1 March 2020 
. assert age < .

. assert age >= 18 

. assert age <= 110

.  
. * INCLUSION 2: M or F gender at 1 March 2020 
. assert inlist(sex, "M", "F")

. 
. * EXCLUDE 1:  MISSING IMD
. assert inlist(imd, 1, 2, 3, 4, 5)

. 
. * EXCLUDE 2:  HH with more than 10 people
. datacheck inlist(household_size, 1, 2, 3, 4, 5,6, 7, 8, 9, 10), nol

 (113 contradictions)

. 
. /* EXPECTED VALUES============================================================*/ 
. 
. *HH
. datacheck kids_cat3<., nol

. datacheck inlist(kids_cat3, 0,1, 2), nol

. 
. datacheck number_kids<., nol

. datacheck inlist(number_kids, 0,1,2,3,4,5,6,7,8,9), nol

. 
. * Age
. datacheck age<., nol

. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6), nol

 (308 contradictions)

. datacheck inlist(age66, 0, 1), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. datacheck inlist(obese4cat, 1, 2, 3, 4), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

. datacheck inlist(smoke_nomiss, 1, 2, 3), nol 

. 
. 
. * Check date ranges for all comorbidities 
. 
. foreach var of varlist  chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabetes                                 
>                ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                         
>        ///
>                                         perm_immunodef  ///
>                                         temp_immunodef  ///
>                                         organ_trans                     /// 
>                                         asplenia                        /// 
>                                         hypertension                            /
> //
>                                         {
  2.                                                 
.         summ `var'_date, format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_r~te |        940   05feb1995    5169.817  15jan1970  15jan2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_c~te |        966   14apr1995     5311.55  15jan1970  15jan2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diabetes_d~e |        954   29nov1995    5167.766  15jan1970  15jan2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_l~te |        940   27aug1995     5304.15  15jan1970  15jan2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_neur~e |        981   12mar1995    5311.404  15jan1970  15jan2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stroke_dem~e |        963   01sep1994    5237.755  15jan1970  15jan2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ra_sle_pso~e |        951   16jun1994    5320.436  15jan1970  15nov2019

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
perm_immun~e |        938   13aug1994    5233.379  15jan1970  15jan2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
temp_immun~e |        972   13aug2019    95.55405  15mar2019  15jan2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
organ_tran~e |        914   18feb1995    5265.372  15jan1970  15dec2019

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
asplenia_d~e |        937   21nov1993    5290.188  15jan1970  15dec2019

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hypertensi~e |        935   06jul1994        5337  15jan1970  15jun2020

. 
. foreach comorb in $varlist { 
  2. 
.         local comorb: subinstr local comorb "i." ""
  3.         tab `comorb', m
  4.         
. }

. 
. * Outcome dates
. summ  date_covid_death_itu  date_covid_tpp_prob_or_susp, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~u |         14   08apr2020    33.78308  21feb2020  30may2020
date_covid~p |      1,699   15apr2020    45.19484  15feb2020  15jul2020

. summ  date_covid_death_itu  date_covid_tpp_prob, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~u |         14   08apr2020    33.78308  21feb2020  30may2020
date_covid~b |        955   18apr2020    44.90722  15feb2020  15jul2020

. 
. /* LOGICAL RELATIONSHIPS======================================================*/ 
. 
. *HH variables
. tab kids_cat3 additional

  Presence of |
  children or |
 young people |
       in the |        Number of additional people in household
    household |         0          1          2          3          4 |     Total
--------------+-------------------------------------------------------+----------
      No kids |        88         54         64         66        252 |       524 
Kids under 12 |         0         10         23         47      3,802 |     3,882 
Kids under 18 |         0          9          5         25        322 |       361 
--------------+-------------------------------------------------------+----------
        Total |        88         73         92        138      4,376 |     4,767 

. tab number_kids add

 Number of |
  children |
aged 1-<12 |
  years in |        Number of additional people in household
 household |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
         0 |        88         63         70         98        666 |       985 
         1 |         0         10         20         34      1,104 |     1,168 
         2 |         0          0          2          5      1,061 |     1,068 
         3 |         0          0          0          1        778 |       779 
         4 |         0          0          0          0        422 |       422 
         5 |         0          0          0          0        253 |       253 
         6 |         0          0          0          0         76 |        76 
         7 |         0          0          0          0         10 |        10 
         8 |         0          0          0          0          6 |         6 
-----------+-------------------------------------------------------+----------
     Total |        88         73         92        138      4,376 |     4,767 

. tab add kids_cat3

 Number of |
additional |  Presence of children or young
 people in |     people in the household
 household |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 |        88          0          0 |        88 
         1 |        54         10          9 |        73 
         2 |        64         23          5 |        92 
         3 |        66         47         25 |       138 
         4 |       252      3,802        322 |     4,376 
-----------+---------------------------------+----------
     Total |       524      3,882        361 |     4,767 

. 
. * BMI
. bysort bmicat: summ bmi

-----------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         26    16.98055    .9891318   15.13177   18.45977

-----------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        110    22.37422    1.767188   18.58771   24.90192

-----------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        154    27.43597    1.428676    25.0106   29.89441

-----------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        176    32.54232    1.334429   30.00033   34.89174

-----------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        168    37.39115    1.486354    35.0543    39.9736

-----------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        224    44.08654    2.689923   40.00714   49.96836

-----------------------------------------------------------------------------------
-> bmicat = Unknown (.u)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. tab bmicat obese4cat, m

                     |     Evidence of obesity (4 categories)
         Grouped BMI | No record  Obese I (  Obese II   Obese III |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |        26          0          0          0 |        26 
  Normal (18.5-24.9) |       110          0          0          0 |       110 
Overweight (25-29.9) |       154          0          0          0 |       154 
   Obese I (30-34.9) |         0        176          0          0 |       176 
  Obese II (35-39.9) |         0          0        168          0 |       168 
     Obese III (40+) |         0          0          0        224 |       224 
        Unknown (.u) |     3,909          0          0          0 |     3,909 
---------------------+--------------------------------------------+----------
               Total |     4,199        176        168        224 |     4,767 

. 
. * Age
. bysort agegroup: summ age

-----------------------------------------------------------------------------------
-> agegroup = 18-<30

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        963    23.74351    3.474536         18         29

-----------------------------------------------------------------------------------
-> agegroup = 30-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        791     34.6574    2.887808         30         39

-----------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        723    44.72614    2.805262         40         49

-----------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        827    54.42805    2.844746         50         59

-----------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        685    64.53431    2.852219         60         69

-----------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        470    73.72979     2.84297         70         79

-----------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        308     85.3539    4.893133         80        108


. tab agegroup age66, m

   Grouped |  66 years and older
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       963          0 |       963 
    30-<40 |       791          0 |       791 
    40-<50 |       723          0 |       723 
    50-<60 |       827          0 |       827 
    60-<70 |       473        212 |       685 
    70-<80 |         0        470 |       470 
       80+ |         0        308 |       308 
-----------+----------------------+----------
     Total |     3,777        990 |     4,767 

. 
. * Smoking
. tab smoke smoke_nomiss, m

             |  Smoking status (missing set to
     Smoking |               non)
      status |     Never     Former    Current |     Total
-------------+---------------------------------+----------
       Never |       196          0          0 |       196 
      Former |         0         91          0 |        91 
     Current |         0          0        595 |       595 
Unknown (.u) |     3,885          0          0 |     3,885 
-------------+---------------------------------+----------
       Total |     4,081         91        595 |     4,767 

. 
. * Diabetes
. *tab diabcat diabetes, m
. 
. * CKD
. tab reduced egfr_cat, m

       Reduced kidney |               Calculated eGFR
             function |        30         45         60          . |     Total
----------------------+--------------------------------------------+----------
                 None |         0          0      4,444        262 |     4,706 
Stage 3a/3b egfr 30-6 |         1         60          0          0 |        61 
----------------------+--------------------------------------------+----------
                Total |         1         60      4,444        262 |     4,767 

. 
. 
. /* EXPECTED RELATIONSHIPS=====================================================*/ 
. 
. /*  Relationships between demographic/lifestyle variables  */
. tab agegroup bmicat,    row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |                      Grouped BMI
       age | Underweig  Normal (1  Overweigh  Obese I (  Obese II  |     Total
-----------+-------------------------------------------------------+----------
    18-<30 |         5         25         20         29         23 |       136 
           |      3.68      18.38      14.71      21.32      16.91 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 |         8         26         26         31         36 |       159 
           |      5.03      16.35      16.35      19.50      22.64 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 |         2         12         19         26         26 |       109 
           |      1.83      11.01      17.43      23.85      23.85 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 |         6         18         29         26         31 |       160 
           |      3.75      11.25      18.13      16.25      19.38 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 |         3         18         22         28         23 |       132 
           |      2.27      13.64      16.67      21.21      17.42 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 |         2          8         26         23         13 |       102 
           |      1.96       7.84      25.49      22.55      12.75 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |         0          3         12         13         16 |        60 
           |      0.00       5.00      20.00      21.67      26.67 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |        26        110        154        176        168 |       858 
           |      3.03      12.82      17.95      20.51      19.58 |    100.00 


           |  Grouped
   Grouped |    BMI
       age | Obese III |     Total
-----------+-----------+----------
    18-<30 |        34 |       136 
           |     25.00 |    100.00 
-----------+-----------+----------
    30-<40 |        32 |       159 
           |     20.13 |    100.00 
-----------+-----------+----------
    40-<50 |        24 |       109 
           |     22.02 |    100.00 
-----------+-----------+----------
    50-<60 |        50 |       160 
           |     31.25 |    100.00 
-----------+-----------+----------
    60-<70 |        38 |       132 
           |     28.79 |    100.00 
-----------+-----------+----------
    70-<80 |        30 |       102 
           |     29.41 |    100.00 
-----------+-----------+----------
       80+ |        16 |        60 
           |     26.67 |    100.00 
-----------+-----------+----------
     Total |       224 |       858 
           |     26.11 |    100.00 

. tab agegroup smoke,     row  

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |          Smoking status
       age |     Never     Former    Current |     Total
-----------+---------------------------------+----------
    18-<30 |        38         15        135 |       188 
           |     20.21       7.98      71.81 |    100.00 
-----------+---------------------------------+----------
    30-<40 |        35         12        101 |       148 
           |     23.65       8.11      68.24 |    100.00 
-----------+---------------------------------+----------
    40-<50 |        28         15         98 |       141 
           |     19.86      10.64      69.50 |    100.00 
-----------+---------------------------------+----------
    50-<60 |        38         24        106 |       168 
           |     22.62      14.29      63.10 |    100.00 
-----------+---------------------------------+----------
    60-<70 |        22          7         76 |       105 
           |     20.95       6.67      72.38 |    100.00 
-----------+---------------------------------+----------
    70-<80 |        18         11         59 |        88 
           |     20.45      12.50      67.05 |    100.00 
-----------+---------------------------------+----------
       80+ |        17          7         20 |        44 
           |     38.64      15.91      45.45 |    100.00 
-----------+---------------------------------+----------
     Total |       196         91        595 |       882 
           |     22.22      10.32      67.46 |    100.00 

. tab agegroup ethnicity, row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |            Ethnicity
       age |     White  Asian or       Other |     Total
-----------+---------------------------------+----------
    18-<30 |       567         68         76 |       711 
           |     79.75       9.56      10.69 |    100.00 
-----------+---------------------------------+----------
    30-<40 |       498         50         53 |       601 
           |     82.86       8.32       8.82 |    100.00 
-----------+---------------------------------+----------
    40-<50 |       444         66         38 |       548 
           |     81.02      12.04       6.93 |    100.00 
-----------+---------------------------------+----------
    50-<60 |       486         69         48 |       603 
           |     80.60      11.44       7.96 |    100.00 
-----------+---------------------------------+----------
    60-<70 |       384         54         74 |       512 
           |     75.00      10.55      14.45 |    100.00 
-----------+---------------------------------+----------
    70-<80 |       288         45         25 |       358 
           |     80.45      12.57       6.98 |    100.00 
-----------+---------------------------------+----------
       80+ |       189         26         17 |       232 
           |     81.47      11.21       7.33 |    100.00 
-----------+---------------------------------+----------
     Total |     2,856        378        331 |     3,565 
           |     80.11      10.60       9.28 |    100.00 

. tab agegroup imd,               row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Index of Multiple Deprivation
   Grouped |              (IMD)
       age | 1 least d          4  5 most de |     Total
-----------+---------------------------------+----------
    18-<30 |       694        167        102 |       963 
           |     72.07      17.34      10.59 |    100.00 
-----------+---------------------------------+----------
    30-<40 |       559        157         75 |       791 
           |     70.67      19.85       9.48 |    100.00 
-----------+---------------------------------+----------
    40-<50 |       494        148         81 |       723 
           |     68.33      20.47      11.20 |    100.00 
-----------+---------------------------------+----------
    50-<60 |       567        182         78 |       827 
           |     68.56      22.01       9.43 |    100.00 
-----------+---------------------------------+----------
    60-<70 |       486        136         63 |       685 
           |     70.95      19.85       9.20 |    100.00 
-----------+---------------------------------+----------
    70-<80 |       326        100         44 |       470 
           |     69.36      21.28       9.36 |    100.00 
-----------+---------------------------------+----------
       80+ |       217         60         31 |       308 
           |     70.45      19.48      10.06 |    100.00 
-----------+---------------------------------+----------
     Total |     3,343        950        474 |     4,767 
           |     70.13      19.93       9.94 |    100.00 

. tab agegroup shield,    row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Probable shielding
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       178        785 |       963 
           |     18.48      81.52 |    100.00 
-----------+----------------------+----------
    30-<40 |       141        650 |       791 
           |     17.83      82.17 |    100.00 
-----------+----------------------+----------
    40-<50 |       152        571 |       723 
           |     21.02      78.98 |    100.00 
-----------+----------------------+----------
    50-<60 |       159        668 |       827 
           |     19.23      80.77 |    100.00 
-----------+----------------------+----------
    60-<70 |       131        554 |       685 
           |     19.12      80.88 |    100.00 
-----------+----------------------+----------
    70-<80 |        86        384 |       470 
           |     18.30      81.70 |    100.00 
-----------+----------------------+----------
       80+ |        54        254 |       308 
           |     17.53      82.47 |    100.00 
-----------+----------------------+----------
     Total |       901      3,866 |     4,767 
           |     18.90      81.10 |    100.00 

. 
. tab bmicat smoke,                row   

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |          Smoking status
         Grouped BMI |     Never     Former    Current |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |         0          0          5 |         5 
                     |      0.00       0.00     100.00 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |         3          2          9 |        14 
                     |     21.43      14.29      64.29 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |         8          2         18 |        28 
                     |     28.57       7.14      64.29 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |         3          2         32 |        37 
                     |      8.11       5.41      86.49 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |         6          7         18 |        31 
                     |     19.35      22.58      58.06 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |        11          4         29 |        44 
                     |     25.00       9.09      65.91 |    100.00 
---------------------+---------------------------------+----------
               Total |        31         17        111 |       159 
                     |     19.50      10.69      69.81 |    100.00 

. tab bmicat ethnicity,    row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |            Ethnicity
         Grouped BMI |     White  Asian or       Other |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |        13          4          2 |        19 
                     |     68.42      21.05      10.53 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |        66         13          5 |        84 
                     |     78.57      15.48       5.95 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |        91         15         13 |       119 
                     |     76.47      12.61      10.92 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |       112         16         12 |       140 
                     |     80.00      11.43       8.57 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |        92         11         16 |       119 
                     |     77.31       9.24      13.45 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |       137         18         18 |       173 
                     |     79.19      10.40      10.40 |    100.00 
---------------------+---------------------------------+----------
               Total |       511         77         66 |       654 
                     |     78.13      11.77      10.09 |    100.00 

. tab bmicat imd,                  row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Index of Multiple Deprivation
                     |              (IMD)
         Grouped BMI | 1 least d          4  5 most de |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |        13          9          4 |        26 
                     |     50.00      34.62      15.38 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |        81         24          5 |       110 
                     |     73.64      21.82       4.55 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |       115         27         12 |       154 
                     |     74.68      17.53       7.79 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |       116         42         18 |       176 
                     |     65.91      23.86      10.23 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |       123         30         15 |       168 
                     |     73.21      17.86       8.93 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |       162         44         18 |       224 
                     |     72.32      19.64       8.04 |    100.00 
---------------------+---------------------------------+----------
               Total |       610        176         72 |       858 
                     |     71.10      20.51       8.39 |    100.00 

. tab bmicat hypertension, row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |       Diagnosed
                     |     hypertension
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |        22          4 |        26 
                     |     84.62      15.38 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |        91         19 |       110 
                     |     82.73      17.27 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |       135         19 |       154 
                     |     87.66      12.34 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |       139         37 |       176 
                     |     78.98      21.02 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |       136         32 |       168 
                     |     80.95      19.05 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |       178         46 |       224 
                     |     79.46      20.54 |    100.00 
---------------------+----------------------+----------
               Total |       701        157 |       858 
                     |     81.70      18.30 |    100.00 

. tab bmicat shield,    row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Probable shielding
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |         5         21 |        26 
                     |     19.23      80.77 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |        16         94 |       110 
                     |     14.55      85.45 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |        28        126 |       154 
                     |     18.18      81.82 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |        29        147 |       176 
                     |     16.48      83.52 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |        37        131 |       168 
                     |     22.02      77.98 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |        50        174 |       224 
                     |     22.32      77.68 |    100.00 
---------------------+----------------------+----------
               Total |       165        693 |       858 
                     |     19.23      80.77 |    100.00 

. 
.                             
. tab smoke ethnicity,    row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |            Ethnicity
      status |     White  Asian or       Other |     Total
-------------+---------------------------------+----------
       Never |       127         12         14 |       153 
             |     83.01       7.84       9.15 |    100.00 
-------------+---------------------------------+----------
      Former |        50          8          3 |        61 
             |     81.97      13.11       4.92 |    100.00 
-------------+---------------------------------+----------
     Current |       350         53         46 |       449 
             |     77.95      11.80      10.24 |    100.00 
-------------+---------------------------------+----------
       Total |       527         73         63 |       663 
             |     79.49      11.01       9.50 |    100.00 

. tab smoke imd,                  row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Index of Multiple Deprivation
     Smoking |              (IMD)
      status | 1 least d          4  5 most de |     Total
-------------+---------------------------------+----------
       Never |       137         40         19 |       196 
             |     69.90      20.41       9.69 |    100.00 
-------------+---------------------------------+----------
      Former |        67         20          4 |        91 
             |     73.63      21.98       4.40 |    100.00 
-------------+---------------------------------+----------
     Current |       422        117         56 |       595 
             |     70.92      19.66       9.41 |    100.00 
-------------+---------------------------------+----------
       Total |       626        177         79 |       882 
             |     70.98      20.07       8.96 |    100.00 

. tab smoke hypertension, row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       151         45 |       196 
             |     77.04      22.96 |    100.00 
-------------+----------------------+----------
      Former |        65         26 |        91 
             |     71.43      28.57 |    100.00 
-------------+----------------------+----------
     Current |       483        112 |       595 
             |     81.18      18.82 |    100.00 
-------------+----------------------+----------
       Total |       699        183 |       882 
             |     79.25      20.75 |    100.00 

. tab smoke shield,    row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Probable shielding
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |        38        158 |       196 
             |     19.39      80.61 |    100.00 
-------------+----------------------+----------
      Former |        11         80 |        91 
             |     12.09      87.91 |    100.00 
-------------+----------------------+----------
     Current |       111        484 |       595 
             |     18.66      81.34 |    100.00 
-------------+----------------------+----------
       Total |       160        722 |       882 
             |     18.14      81.86 |    100.00 

.                       
. tab ethnicity imd,              row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |  Index of Multiple Deprivation
                      |              (IMD)
            Ethnicity | 1 least d          4  5 most de |     Total
----------------------+---------------------------------+----------
                White |     1,997        569        290 |     2,856 
                      |     69.92      19.92      10.15 |    100.00 
----------------------+---------------------------------+----------
Asian or Asian Britis |       273         75         30 |       378 
                      |     72.22      19.84       7.94 |    100.00 
----------------------+---------------------------------+----------
                Other |       232         65         34 |       331 
                      |     70.09      19.64      10.27 |    100.00 
----------------------+---------------------------------+----------
                Total |     2,502        709        354 |     3,565 
                      |     70.18      19.89       9.93 |    100.00 

. tab shield imd,                 row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Index of Multiple Deprivation
  Probable |              (IMD)
 shielding | 1 least d          4  5 most de |     Total
-----------+---------------------------------+----------
         0 |       649        178         74 |       901 
           |     72.03      19.76       8.21 |    100.00 
-----------+---------------------------------+----------
         1 |     2,694        772        400 |     3,866 
           |     69.68      19.97      10.35 |    100.00 
-----------+---------------------------------+----------
     Total |     3,343        950        474 |     4,767 
           |     70.13      19.93       9.94 |    100.00 

. 
. tab shield ethnicity,           row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Probable |            Ethnicity
 shielding |     White  Asian or       Other |     Total
-----------+---------------------------------+----------
         0 |       561         65         65 |       691 
           |     81.19       9.41       9.41 |    100.00 
-----------+---------------------------------+----------
         1 |     2,295        313        266 |     2,874 
           |     79.85      10.89       9.26 |    100.00 
-----------+---------------------------------+----------
     Total |     2,856        378        331 |     3,565 
           |     80.11      10.60       9.28 |    100.00 

. 
. 
. 
. * Relationships with age
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabetes                                 
>                ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                         
>        ///
>                                         other_immuno                            /
> //
>                                         organ_trans                     /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                        
>                        ///
>                                         cancer_haem_cat                          
>                        ///
>                                         reduced_kidney_function_cat ///
>                                         hypertension            ///             
>                                                                                 {
  2. 
.                 
.         tab agegroup `var', row 
  3.  }

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |    Asthma category
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       882         81 |       963 
           |     91.59       8.41 |    100.00 
-----------+----------------------+----------
    30-<40 |       734         57 |       791 
           |     92.79       7.21 |    100.00 
-----------+----------------------+----------
    40-<50 |       666         57 |       723 
           |     92.12       7.88 |    100.00 
-----------+----------------------+----------
    50-<60 |       768         59 |       827 
           |     92.87       7.13 |    100.00 
-----------+----------------------+----------
    60-<70 |       648         37 |       685 
           |     94.60       5.40 |    100.00 
-----------+----------------------+----------
    70-<80 |       434         36 |       470 
           |     92.34       7.66 |    100.00 
-----------+----------------------+----------
       80+ |       279         29 |       308 
           |     90.58       9.42 |    100.00 
-----------+----------------------+----------
     Total |     4,411        356 |     4,767 
           |     92.53       7.47 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       768        195 |       963 
           |     79.75      20.25 |    100.00 
-----------+----------------------+----------
    30-<40 |       638        153 |       791 
           |     80.66      19.34 |    100.00 
-----------+----------------------+----------
    40-<50 |       600        123 |       723 
           |     82.99      17.01 |    100.00 
-----------+----------------------+----------
    50-<60 |       660        167 |       827 
           |     79.81      20.19 |    100.00 
-----------+----------------------+----------
    60-<70 |       562        123 |       685 
           |     82.04      17.96 |    100.00 
-----------+----------------------+----------
    70-<80 |       361        109 |       470 
           |     76.81      23.19 |    100.00 
-----------+----------------------+----------
       80+ |       238         70 |       308 
           |     77.27      22.73 |    100.00 
-----------+----------------------+----------
     Total |     3,827        940 |     4,767 
           |     80.28      19.72 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       765        198 |       963 
           |     79.44      20.56 |    100.00 
-----------+----------------------+----------
    30-<40 |       629        162 |       791 
           |     79.52      20.48 |    100.00 
-----------+----------------------+----------
    40-<50 |       581        142 |       723 
           |     80.36      19.64 |    100.00 
-----------+----------------------+----------
    50-<60 |       657        170 |       827 
           |     79.44      20.56 |    100.00 
-----------+----------------------+----------
    60-<70 |       545        140 |       685 
           |     79.56      20.44 |    100.00 
-----------+----------------------+----------
    70-<80 |       376         94 |       470 
           |     80.00      20.00 |    100.00 
-----------+----------------------+----------
       80+ |       248         60 |       308 
           |     80.52      19.48 |    100.00 
-----------+----------------------+----------
     Total |     3,801        966 |     4,767 
           |     79.74      20.26 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |       Diabetes
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       770        193 |       963 
           |     79.96      20.04 |    100.00 
-----------+----------------------+----------
    30-<40 |       631        160 |       791 
           |     79.77      20.23 |    100.00 
-----------+----------------------+----------
    40-<50 |       583        140 |       723 
           |     80.64      19.36 |    100.00 
-----------+----------------------+----------
    50-<60 |       637        190 |       827 
           |     77.03      22.97 |    100.00 
-----------+----------------------+----------
    60-<70 |       570        115 |       685 
           |     83.21      16.79 |    100.00 
-----------+----------------------+----------
    70-<80 |       370        100 |       470 
           |     78.72      21.28 |    100.00 
-----------+----------------------+----------
       80+ |       252         56 |       308 
           |     81.82      18.18 |    100.00 
-----------+----------------------+----------
     Total |     3,813        954 |     4,767 
           |     79.99      20.01 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Chronic liver disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       769        194 |       963 
           |     79.85      20.15 |    100.00 
-----------+----------------------+----------
    30-<40 |       627        164 |       791 
           |     79.27      20.73 |    100.00 
-----------+----------------------+----------
    40-<50 |       594        129 |       723 
           |     82.16      17.84 |    100.00 
-----------+----------------------+----------
    50-<60 |       656        171 |       827 
           |     79.32      20.68 |    100.00 
-----------+----------------------+----------
    60-<70 |       554        131 |       685 
           |     80.88      19.12 |    100.00 
-----------+----------------------+----------
    70-<80 |       374         96 |       470 
           |     79.57      20.43 |    100.00 
-----------+----------------------+----------
       80+ |       253         55 |       308 
           |     82.14      17.86 |    100.00 
-----------+----------------------+----------
     Total |     3,827        940 |     4,767 
           |     80.28      19.72 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Neurological disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       766        197 |       963 
           |     79.54      20.46 |    100.00 
-----------+----------------------+----------
    30-<40 |       629        162 |       791 
           |     79.52      20.48 |    100.00 
-----------+----------------------+----------
    40-<50 |       579        144 |       723 
           |     80.08      19.92 |    100.00 
-----------+----------------------+----------
    50-<60 |       644        183 |       827 
           |     77.87      22.13 |    100.00 
-----------+----------------------+----------
    60-<70 |       542        143 |       685 
           |     79.12      20.88 |    100.00 
-----------+----------------------+----------
    70-<80 |       378         92 |       470 
           |     80.43      19.57 |    100.00 
-----------+----------------------+----------
       80+ |       248         60 |       308 
           |     80.52      19.48 |    100.00 
-----------+----------------------+----------
     Total |     3,786        981 |     4,767 
           |     79.42      20.58 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Stroke or dementia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       799        164 |       963 
           |     82.97      17.03 |    100.00 
-----------+----------------------+----------
    30-<40 |       623        168 |       791 
           |     78.76      21.24 |    100.00 
-----------+----------------------+----------
    40-<50 |       582        141 |       723 
           |     80.50      19.50 |    100.00 
-----------+----------------------+----------
    50-<60 |       645        182 |       827 
           |     77.99      22.01 |    100.00 
-----------+----------------------+----------
    60-<70 |       544        141 |       685 
           |     79.42      20.58 |    100.00 
-----------+----------------------+----------
    70-<80 |       369        101 |       470 
           |     78.51      21.49 |    100.00 
-----------+----------------------+----------
       80+ |       242         66 |       308 
           |     78.57      21.43 |    100.00 
-----------+----------------------+----------
     Total |     3,804        963 |     4,767 
           |     79.80      20.20 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Autoimmune disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       768        195 |       963 
           |     79.75      20.25 |    100.00 
-----------+----------------------+----------
    30-<40 |       648        143 |       791 
           |     81.92      18.08 |    100.00 
-----------+----------------------+----------
    40-<50 |       570        153 |       723 
           |     78.84      21.16 |    100.00 
-----------+----------------------+----------
    50-<60 |       654        173 |       827 
           |     79.08      20.92 |    100.00 
-----------+----------------------+----------
    60-<70 |       547        138 |       685 
           |     79.85      20.15 |    100.00 
-----------+----------------------+----------
    70-<80 |       381         89 |       470 
           |     81.06      18.94 |    100.00 
-----------+----------------------+----------
       80+ |       248         60 |       308 
           |     80.52      19.48 |    100.00 
-----------+----------------------+----------
     Total |     3,816        951 |     4,767 
           |     80.05      19.95 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
   Grouped |      algorithm)
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       611        352 |       963 
           |     63.45      36.55 |    100.00 
-----------+----------------------+----------
    30-<40 |       492        299 |       791 
           |     62.20      37.80 |    100.00 
-----------+----------------------+----------
    40-<50 |       469        254 |       723 
           |     64.87      35.13 |    100.00 
-----------+----------------------+----------
    50-<60 |       527        300 |       827 
           |     63.72      36.28 |    100.00 
-----------+----------------------+----------
    60-<70 |       429        256 |       685 
           |     62.63      37.37 |    100.00 
-----------+----------------------+----------
    70-<80 |       303        167 |       470 
           |     64.47      35.53 |    100.00 
-----------+----------------------+----------
       80+ |       198        110 |       308 
           |     64.29      35.71 |    100.00 
-----------+----------------------+----------
     Total |     3,029      1,738 |     4,767 
           |     63.54      36.46 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |      Solid organ
   Grouped |      transplant
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       759        204 |       963 
           |     78.82      21.18 |    100.00 
-----------+----------------------+----------
    30-<40 |       636        155 |       791 
           |     80.40      19.60 |    100.00 
-----------+----------------------+----------
    40-<50 |       596        127 |       723 
           |     82.43      17.57 |    100.00 
-----------+----------------------+----------
    50-<60 |       686        141 |       827 
           |     82.95      17.05 |    100.00 
-----------+----------------------+----------
    60-<70 |       551        134 |       685 
           |     80.44      19.56 |    100.00 
-----------+----------------------+----------
    70-<80 |       374         96 |       470 
           |     79.57      20.43 |    100.00 
-----------+----------------------+----------
       80+ |       251         57 |       308 
           |     81.49      18.51 |    100.00 
-----------+----------------------+----------
     Total |     3,853        914 |     4,767 
           |     80.83      19.17 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |       Asplenia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       802        161 |       963 
           |     83.28      16.72 |    100.00 
-----------+----------------------+----------
    30-<40 |       620        171 |       791 
           |     78.38      21.62 |    100.00 
-----------+----------------------+----------
    40-<50 |       594        129 |       723 
           |     82.16      17.84 |    100.00 
-----------+----------------------+----------
    50-<60 |       651        176 |       827 
           |     78.72      21.28 |    100.00 
-----------+----------------------+----------
    60-<70 |       546        139 |       685 
           |     79.71      20.29 |    100.00 
-----------+----------------------+----------
    70-<80 |       372         98 |       470 
           |     79.15      20.85 |    100.00 
-----------+----------------------+----------
       80+ |       245         63 |       308 
           |     79.55      20.45 |    100.00 
-----------+----------------------+----------
     Total |     3,830        937 |     4,767 
           |     80.34      19.66 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |          Non-haematological cancer
       age |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
    18-<30 |       759          5         10        189 |       963 
           |     78.82       0.52       1.04      19.63 |    100.00 
-----------+--------------------------------------------+----------
    30-<40 |       637          2         15        137 |       791 
           |     80.53       0.25       1.90      17.32 |    100.00 
-----------+--------------------------------------------+----------
    40-<50 |       571          1         13        138 |       723 
           |     78.98       0.14       1.80      19.09 |    100.00 
-----------+--------------------------------------------+----------
    50-<60 |       645          3         15        164 |       827 
           |     77.99       0.36       1.81      19.83 |    100.00 
-----------+--------------------------------------------+----------
    60-<70 |       549          4         10        122 |       685 
           |     80.15       0.58       1.46      17.81 |    100.00 
-----------+--------------------------------------------+----------
    70-<80 |       368          4          4         94 |       470 
           |     78.30       0.85       0.85      20.00 |    100.00 
-----------+--------------------------------------------+----------
       80+ |       251          1          3         53 |       308 
           |     81.49       0.32       0.97      17.21 |    100.00 
-----------+--------------------------------------------+----------
     Total |     3,780         20         70        897 |     4,767 
           |     79.30       0.42       1.47      18.82 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |            Haematological cancer
       age |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
    18-<30 |       765          8         13        177 |       963 
           |     79.44       0.83       1.35      18.38 |    100.00 
-----------+--------------------------------------------+----------
    30-<40 |       635          3         14        139 |       791 
           |     80.28       0.38       1.77      17.57 |    100.00 
-----------+--------------------------------------------+----------
    40-<50 |       577          5         14        127 |       723 
           |     79.81       0.69       1.94      17.57 |    100.00 
-----------+--------------------------------------------+----------
    50-<60 |       649          3         15        160 |       827 
           |     78.48       0.36       1.81      19.35 |    100.00 
-----------+--------------------------------------------+----------
    60-<70 |       549          1          5        130 |       685 
           |     80.15       0.15       0.73      18.98 |    100.00 
-----------+--------------------------------------------+----------
    70-<80 |       377          0          4         89 |       470 
           |     80.21       0.00       0.85      18.94 |    100.00 
-----------+--------------------------------------------+----------
       80+ |       250          0          4         54 |       308 
           |     81.17       0.00       1.30      17.53 |    100.00 
-----------+--------------------------------------------+----------
     Total |     3,802         20         69        876 |     4,767 
           |     79.76       0.42       1.45      18.38 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Reduced kidney
   Grouped |       function
       age |      None  Stage 3a/ |     Total
-----------+----------------------+----------
    18-<30 |       962          1 |       963 
           |     99.90       0.10 |    100.00 
-----------+----------------------+----------
    30-<40 |       789          2 |       791 
           |     99.75       0.25 |    100.00 
-----------+----------------------+----------
    40-<50 |       721          2 |       723 
           |     99.72       0.28 |    100.00 
-----------+----------------------+----------
    50-<60 |       818          9 |       827 
           |     98.91       1.09 |    100.00 
-----------+----------------------+----------
    60-<70 |       675         10 |       685 
           |     98.54       1.46 |    100.00 
-----------+----------------------+----------
    70-<80 |       453         17 |       470 
           |     96.38       3.62 |    100.00 
-----------+----------------------+----------
       80+ |       288         20 |       308 
           |     93.51       6.49 |    100.00 
-----------+----------------------+----------
     Total |     4,706         61 |     4,767 
           |     98.72       1.28 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
   Grouped |     hypertension
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       762        201 |       963 
           |     79.13      20.87 |    100.00 
-----------+----------------------+----------
    30-<40 |       637        154 |       791 
           |     80.53      19.47 |    100.00 
-----------+----------------------+----------
    40-<50 |       580        143 |       723 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
    50-<60 |       675        152 |       827 
           |     81.62      18.38 |    100.00 
-----------+----------------------+----------
    60-<70 |       548        137 |       685 
           |     80.00      20.00 |    100.00 
-----------+----------------------+----------
    70-<80 |       379         91 |       470 
           |     80.64      19.36 |    100.00 
-----------+----------------------+----------
       80+ |       251         57 |       308 
           |     81.49      18.51 |    100.00 
-----------+----------------------+----------
     Total |     3,832        935 |     4,767 
           |     80.39      19.61 |    100.00 

. 
. 
.  * Relationships with sex
. foreach var of varlist asthma                                           ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabetes                                 
>                ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                         
>        ///
>                                         other_immuno                            /
> //
>                                         organ_trans                     /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                        
>                        ///
>                                         cancer_haem_cat                          
>                        ///
>                                         reduced_kidney_function_cat ///
>                                         hypertension                     ///    
>                                                                                 {
  2.                                                 
.         tab male `var', row 
  3. }

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Asthma category
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,239        188 |     2,427 
           |     92.25       7.75 |    100.00 
-----------+----------------------+----------
         1 |     2,172        168 |     2,340 
           |     92.82       7.18 |    100.00 
-----------+----------------------+----------
     Total |     4,411        356 |     4,767 
           |     92.53       7.47 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,964        463 |     2,427 
           |     80.92      19.08 |    100.00 
-----------+----------------------+----------
         1 |     1,863        477 |     2,340 
           |     79.62      20.38 |    100.00 
-----------+----------------------+----------
     Total |     3,827        940 |     4,767 
           |     80.28      19.72 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,964        463 |     2,427 
           |     80.92      19.08 |    100.00 
-----------+----------------------+----------
         1 |     1,837        503 |     2,340 
           |     78.50      21.50 |    100.00 
-----------+----------------------+----------
     Total |     3,801        966 |     4,767 
           |     79.74      20.26 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diabetes
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,949        478 |     2,427 
           |     80.30      19.70 |    100.00 
-----------+----------------------+----------
         1 |     1,864        476 |     2,340 
           |     79.66      20.34 |    100.00 
-----------+----------------------+----------
     Total |     3,813        954 |     4,767 
           |     79.99      20.01 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Chronic liver disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,966        461 |     2,427 
           |     81.01      18.99 |    100.00 
-----------+----------------------+----------
         1 |     1,861        479 |     2,340 
           |     79.53      20.47 |    100.00 
-----------+----------------------+----------
     Total |     3,827        940 |     4,767 
           |     80.28      19.72 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Neurological disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,930        497 |     2,427 
           |     79.52      20.48 |    100.00 
-----------+----------------------+----------
         1 |     1,856        484 |     2,340 
           |     79.32      20.68 |    100.00 
-----------+----------------------+----------
     Total |     3,786        981 |     4,767 
           |     79.42      20.58 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Stroke or dementia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,947        480 |     2,427 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
         1 |     1,857        483 |     2,340 
           |     79.36      20.64 |    100.00 
-----------+----------------------+----------
     Total |     3,804        963 |     4,767 
           |     79.80      20.20 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Autoimmune disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,947        480 |     2,427 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
         1 |     1,869        471 |     2,340 
           |     79.87      20.13 |    100.00 
-----------+----------------------+----------
     Total |     3,816        951 |     4,767 
           |     80.05      19.95 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
           |      algorithm)
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,544        883 |     2,427 
           |     63.62      36.38 |    100.00 
-----------+----------------------+----------
         1 |     1,485        855 |     2,340 
           |     63.46      36.54 |    100.00 
-----------+----------------------+----------
     Total |     3,029      1,738 |     4,767 
           |     63.54      36.46 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |      Solid organ
           |      transplant
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,945        482 |     2,427 
           |     80.14      19.86 |    100.00 
-----------+----------------------+----------
         1 |     1,908        432 |     2,340 
           |     81.54      18.46 |    100.00 
-----------+----------------------+----------
     Total |     3,853        914 |     4,767 
           |     80.83      19.17 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Asplenia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,939        488 |     2,427 
           |     79.89      20.11 |    100.00 
-----------+----------------------+----------
         1 |     1,891        449 |     2,340 
           |     80.81      19.19 |    100.00 
-----------+----------------------+----------
     Total |     3,830        937 |     4,767 
           |     80.34      19.66 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |          Non-haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 |     1,924         11         39        453 |     2,427 
           |     79.27       0.45       1.61      18.67 |    100.00 
-----------+--------------------------------------------+----------
         1 |     1,856          9         31        444 |     2,340 
           |     79.32       0.38       1.32      18.97 |    100.00 
-----------+--------------------------------------------+----------
     Total |     3,780         20         70        897 |     4,767 
           |     79.30       0.42       1.47      18.82 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |            Haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 |     1,911         13         33        470 |     2,427 
           |     78.74       0.54       1.36      19.37 |    100.00 
-----------+--------------------------------------------+----------
         1 |     1,891          7         36        406 |     2,340 
           |     80.81       0.30       1.54      17.35 |    100.00 
-----------+--------------------------------------------+----------
     Total |     3,802         20         69        876 |     4,767 
           |     79.76       0.42       1.45      18.38 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Reduced kidney
           |       function
      Male |      None  Stage 3a/ |     Total
-----------+----------------------+----------
         0 |     2,368         59 |     2,427 
           |     97.57       2.43 |    100.00 
-----------+----------------------+----------
         1 |     2,338          2 |     2,340 
           |     99.91       0.09 |    100.00 
-----------+----------------------+----------
     Total |     4,706         61 |     4,767 
           |     98.72       1.28 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
           |     hypertension
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,938        489 |     2,427 
           |     79.85      20.15 |    100.00 
-----------+----------------------+----------
         1 |     1,894        446 |     2,340 
           |     80.94      19.06 |    100.00 
-----------+----------------------+----------
     Total |     3,832        935 |     4,767 
           |     80.39      19.61 |    100.00 

. 
.  * Relationships with smoking
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabetes                                 
>                ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                         
>        ///
>                                         other_immuno                            /
> //
>                                         organ_trans                     /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                        
>                        ///
>                                         cancer_haem_cat                          
>                        ///
>                                         reduced_kidney_function_cat ///
>                                         hypertension                            /
> //
>                                         {
  2.         
.         tab smoke `var', row 
  3. }

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |    Asthma category
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       182         14 |       196 
             |     92.86       7.14 |    100.00 
-------------+----------------------+----------
      Former |        80         11 |        91 
             |     87.91      12.09 |    100.00 
-------------+----------------------+----------
     Current |       559         36 |       595 
             |     93.95       6.05 |    100.00 
-------------+----------------------+----------
       Total |       821         61 |       882 
             |     93.08       6.92 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Chronic Respiratory
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       155         41 |       196 
             |     79.08      20.92 |    100.00 
-------------+----------------------+----------
      Former |        76         15 |        91 
             |     83.52      16.48 |    100.00 
-------------+----------------------+----------
     Current |       487        108 |       595 
             |     81.85      18.15 |    100.00 
-------------+----------------------+----------
       Total |       718        164 |       882 
             |     81.41      18.59 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    Chronic Cardiac
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       162         34 |       196 
             |     82.65      17.35 |    100.00 
-------------+----------------------+----------
      Former |        69         22 |        91 
             |     75.82      24.18 |    100.00 
-------------+----------------------+----------
     Current |       460        135 |       595 
             |     77.31      22.69 |    100.00 
-------------+----------------------+----------
       Total |       691        191 |       882 
             |     78.34      21.66 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |       Diabetes
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       158         38 |       196 
             |     80.61      19.39 |    100.00 
-------------+----------------------+----------
      Former |        76         15 |        91 
             |     83.52      16.48 |    100.00 
-------------+----------------------+----------
     Current |       474        121 |       595 
             |     79.66      20.34 |    100.00 
-------------+----------------------+----------
       Total |       708        174 |       882 
             |     80.27      19.73 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Chronic liver disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       155         41 |       196 
             |     79.08      20.92 |    100.00 
-------------+----------------------+----------
      Former |        76         15 |        91 
             |     83.52      16.48 |    100.00 
-------------+----------------------+----------
     Current |       468        127 |       595 
             |     78.66      21.34 |    100.00 
-------------+----------------------+----------
       Total |       699        183 |       882 
             |     79.25      20.75 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Neurological disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       153         43 |       196 
             |     78.06      21.94 |    100.00 
-------------+----------------------+----------
      Former |        71         20 |        91 
             |     78.02      21.98 |    100.00 
-------------+----------------------+----------
     Current |       479        116 |       595 
             |     80.50      19.50 |    100.00 
-------------+----------------------+----------
       Total |       703        179 |       882 
             |     79.71      20.29 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Stroke or dementia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       149         47 |       196 
             |     76.02      23.98 |    100.00 
-------------+----------------------+----------
      Former |        78         13 |        91 
             |     85.71      14.29 |    100.00 
-------------+----------------------+----------
     Current |       468        127 |       595 
             |     78.66      21.34 |    100.00 
-------------+----------------------+----------
       Total |       695        187 |       882 
             |     78.80      21.20 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Autoimmune disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       147         49 |       196 
             |     75.00      25.00 |    100.00 
-------------+----------------------+----------
      Former |        73         18 |        91 
             |     80.22      19.78 |    100.00 
-------------+----------------------+----------
     Current |       473        122 |       595 
             |     79.50      20.50 |    100.00 
-------------+----------------------+----------
       Total |       693        189 |       882 
             |     78.57      21.43 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Immunosuppressed
             |     (combination
     Smoking |      algorithm)
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       120         76 |       196 
             |     61.22      38.78 |    100.00 
-------------+----------------------+----------
      Former |        61         30 |        91 
             |     67.03      32.97 |    100.00 
-------------+----------------------+----------
     Current |       368        227 |       595 
             |     61.85      38.15 |    100.00 
-------------+----------------------+----------
       Total |       549        333 |       882 
             |     62.24      37.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |      Solid organ
     Smoking |      transplant
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       153         43 |       196 
             |     78.06      21.94 |    100.00 
-------------+----------------------+----------
      Former |        72         19 |        91 
             |     79.12      20.88 |    100.00 
-------------+----------------------+----------
     Current |       475        120 |       595 
             |     79.83      20.17 |    100.00 
-------------+----------------------+----------
       Total |       700        182 |       882 
             |     79.37      20.63 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |       Asplenia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       149         47 |       196 
             |     76.02      23.98 |    100.00 
-------------+----------------------+----------
      Former |        71         20 |        91 
             |     78.02      21.98 |    100.00 
-------------+----------------------+----------
     Current |       491        104 |       595 
             |     82.52      17.48 |    100.00 
-------------+----------------------+----------
       Total |       711        171 |       882 
             |     80.61      19.39 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |          Non-haematological cancer
      status |     Never  Last year  2-5 years   5+ years |     Total
-------------+--------------------------------------------+----------
       Never |       164          0          4         28 |       196 
             |     83.67       0.00       2.04      14.29 |    100.00 
-------------+--------------------------------------------+----------
      Former |        71          1          1         18 |        91 
             |     78.02       1.10       1.10      19.78 |    100.00 
-------------+--------------------------------------------+----------
     Current |       481          3         11        100 |       595 
             |     80.84       0.50       1.85      16.81 |    100.00 
-------------+--------------------------------------------+----------
       Total |       716          4         16        146 |       882 
             |     81.18       0.45       1.81      16.55 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |            Haematological cancer
      status |     Never  Last year  2-5 years   5+ years |     Total
-------------+--------------------------------------------+----------
       Never |       167          0          2         27 |       196 
             |     85.20       0.00       1.02      13.78 |    100.00 
-------------+--------------------------------------------+----------
      Former |        73          1          1         16 |        91 
             |     80.22       1.10       1.10      17.58 |    100.00 
-------------+--------------------------------------------+----------
     Current |       473          3          9        110 |       595 
             |     79.50       0.50       1.51      18.49 |    100.00 
-------------+--------------------------------------------+----------
       Total |       713          4         12        153 |       882 
             |     80.84       0.45       1.36      17.35 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    Reduced kidney
     Smoking |       function
      status |      None  Stage 3a/ |     Total
-------------+----------------------+----------
       Never |       194          2 |       196 
             |     98.98       1.02 |    100.00 
-------------+----------------------+----------
      Former |        89          2 |        91 
             |     97.80       2.20 |    100.00 
-------------+----------------------+----------
     Current |       588          7 |       595 
             |     98.82       1.18 |    100.00 
-------------+----------------------+----------
       Total |       871         11 |       882 
             |     98.75       1.25 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       151         45 |       196 
             |     77.04      22.96 |    100.00 
-------------+----------------------+----------
      Former |        65         26 |        91 
             |     71.43      28.57 |    100.00 
-------------+----------------------+----------
     Current |       483        112 |       595 
             |     81.18      18.82 |    100.00 
-------------+----------------------+----------
       Total |       699        183 |       882 
             |     79.25      20.75 |    100.00 

. 
. 
. /* SENSE CHECK OUTCOMES=======================================================*/
. 
. tab covid_death_itu covid_tpp_prob_or_susp  , row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |   Failure/censoring
  outcome: |     indicator for
     covid |    outcome: covid
 death/ITU |    prob/susp. case
      adm. |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,123      1,630 |     4,753 
           |     65.71      34.29 |    100.00 
           |     99.74      99.63 |     99.71 
-----------+----------------------+----------
         1 |         8          6 |        14 
           |     57.14      42.86 |    100.00 
           |      0.26       0.37 |      0.29 
-----------+----------------------+----------
     Total |     3,131      1,636 |     4,767 
           |     65.68      34.32 |    100.00 
           |    100.00     100.00 |    100.00 

. tab covid_death_itu covid_tpp_prob  , row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |   Failure/censoring
  outcome: |     indicator for
     covid |  outcome: covid prob
 death/ITU |         case
      adm. |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,843        910 |     4,753 
           |     80.85      19.15 |    100.00 
           |     99.71      99.67 |     99.71 
-----------+----------------------+----------
         1 |        11          3 |        14 
           |     78.57      21.43 |    100.00 
           |      0.29       0.33 |      0.29 
-----------+----------------------+----------
     Total |     3,854        913 |     4,767 
           |     80.85      19.15 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  C:\Users\ENCDHFOR\Documents\GitHub\school-age-children-and-covid\analy
> sis\log\02_an_data_checks.log
  log type:  text
 closed on:   6 Jul 2020, 17:03:51
-----------------------------------------------------------------------------------
