-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/07d_an_multivariable_cox_models_covid_icu_Sense5_ti
> me_ints.log
  log type:  text
 opened on:  21 Oct 2020, 08:05:40

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_0.dta", clea
> r

. *make vars binary
. gen anyreduced_kidney_function = reduced_kidney_function_cat>=2

. gen anyobesity = obese4cat>=2

. gen highimd = imd>=3

. gen anydiab= diabcat>=2

. 
. stsplit timeperiod, at(60 90)
(18,198,217 observations (episodes) created)

. 
. /*Age and sex adjusted
> stcox i.kids_cat3 age1 age2 age3 i.male, strata(stp) vce(cluster household_id
> )
> estimates
> estimates save ./output/an_univariable_cox_models_`outcome'_AGESEX_time_int_a
> geband_0, replace                                          
> 
> *Minimally adjusted
> stcox   i.kids_cat3     ///
>                         age1 age2 age3          ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                           ///
>                 60.timeperiod#1.anyobesity                                   
>                    ///
>                         90.timeperiod#1.anyobesity                           
>                    ///
>                 60.timeperiod#3.smoke_nomiss                                 
>            ///
>                         90.timeperiod#3.smoke_nomiss                         
>            ///
>                 60.timeperiod#1.highimd                                      
>                    ///
>                         90.timeperiod#1.highimd                              
>                    ///
>                         , strata(stp) vce(cluster household_id)
> estimates
> estimates save ./output/an_multivariate_cox_models_`outcome'_kids_cat3_DEMOGA
> DJ_time_int_ageband_0, replace
> estat phtest, d
> */
. 
. *Fully adjusted
.  stcox  i.kids_cat3      ///
>                         age1 age2 age3          ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                           ///
>                         i.ethnicity ///
>                         $comordidadjlist        ///     
>                 60.timeperiod#1.anyobesity                                   
>                    ///
>                         90.timeperiod#1.anyobesity                           
>                    ///
>                 60.timeperiod#3.smoke_nomiss                                 
>            ///
>                         90.timeperiod#3.smoke_nomiss                         
>            ///
>                 60.timeperiod#1.highimd                                      
>                    ///
>                         90.timeperiod#1.highimd                              
>                    ///
>                 60.timeperiod#1.anydiab                                 ///
>                         90.timeperiod#1.anydiab                              
>    ///             
>                 60.timeperiod#1.chronic_liver_disease                        
>    ///
>                         90.timeperiod#1.chronic_liver_disease                
>    ///
>                 60.timeperiod#1.cancer_exhaem_cat                            
>            ///
>                         90.timeperiod#1.cancer_exhaem_cat                    
>            ///
>                 60.timeperiod#1.asplenia                                     
>            ///
>                         90.timeperiod#1.asplenia                             
>                    ///
>                 60.timeperiod#1.other_immuno                                 
>            ///
>                         90.timeperiod#1.other_immuno                         
>            ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  covid_icu
   analysis time _t:  (stime_covid_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -18960.146
Iteration 1:   log pseudolikelihood =  -18522.01
Iteration 2:   log pseudolikelihood = -17471.837
Iteration 3:   log pseudolikelihood = -17383.126
Iteration 4:   log pseudolikelihood = -17373.102
Iteration 5:   log pseudolikelihood = -17372.479
Iteration 6:   log pseudolikelihood = -17372.474
Iteration 7:   log pseudolikelihood = -17372.474
Refining estimates:
Iteration 0:   log pseudolikelihood = -17372.474

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,157,814             Number of obs    =  27,356,031
No. of failures      =        1,471
Time at risk         =   1672853208
                                                Wald chi2(60)    =     4522.03
Log pseudolikelihood =   -17372.474             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,740,058 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .9818691   .0748562    -0.24   0.810     .8455889    1.140113
Kids unde..  |   1.079378    .097385     0.85   0.397      .904431    1.288166
             |
        age1 |   1.083456   .0240417     3.61   0.000     1.037345    1.131617
        age2 |    1.02409   .0531826     0.46   0.647     .9249835    1.133816
        age3 |    .855201   .1122601    -1.19   0.233     .6612004    1.106123
      1.male |   2.319516   .1336459    14.60   0.000     2.071824     2.59682
             |
   obese4cat |
Obese I ..)  |   2.344284   .2441816     8.18   0.000     1.911388    2.875225
Obese II..)  |   3.252285   .3761021    10.20   0.000     2.592708    4.079657
Obese II..)  |    4.65838   .5929441    12.09   0.000     3.629856    5.978339
             |
smoke_nomiss |
     Former  |   1.021374   .0584623     0.37   0.712     .9129839    1.142633
    Current  |   .2440429   .0509555    -6.75   0.000     .1620831    .3674469
             |
         imd |
          2  |    1.13634   .1123248     1.29   0.196     .9362003    1.379265
          3  |   .9156758   .1182985    -0.68   0.495     .7108416    1.179534
          4  |   1.058541   .1314881     0.46   0.647     .8298021    1.350333
5 most de..  |   1.116521   .1435566     0.86   0.391     .8678079    1.436515
             |
   ethnicity |
      Mixed  |   3.207907   .5088724     7.35   0.000     2.350689    4.377725
Asian or ..  |    3.11807   .2624597    13.51   0.000     2.643851    3.677348
      Black  |   3.235491   .3288786    11.55   0.000      2.65105    3.948776
      Other  |   3.229887    .418149     9.06   0.000     2.506044    4.162804
             |
1.htdiag_o~p |   1.445914   .0888999     6.00   0.000     1.281763    1.631088
1.~y_disease |   2.316865   .2430103     8.01   0.000     1.886342    2.845648
    1.asthma |   1.287979    .085671     3.80   0.000     1.130551    1.467327
1.~c_disease |   1.093077   .1026608     0.95   0.343     .9092991    1.313998
             |
     diabcat |
T1DM, con..  |   1.696156   .7872091     1.14   0.255     .6829858    4.212307
T1DM, unc..  |   2.636769    .659654     3.88   0.000     1.614815     4.30548
T2DM, con..  |   1.585754   .1971345     3.71   0.000     1.242848    2.023269
T2DM, unc..  |   2.413246   .2995264     7.10   0.000     1.892136    3.077873
Diabetes,..  |   3.136719   1.436269     2.50   0.013     1.278556    7.695403
             |
cancer_exh~t |
  Last year  |   1.136352    .491744     0.30   0.768     .4865915    2.653757
2-5 years..  |   .9388941   .3263387    -0.18   0.856     .4750704    1.855561
   5+ years  |   .6469674   .2022872    -1.39   0.164     .3505398    1.194064
             |
cancer_hae~t |
  Last year  |   4.696515   2.391268     3.04   0.002     1.731329    12.74007
2-5 years..  |   3.732727    1.26025     3.90   0.000     1.925936    7.234532
   5+ years  |   2.477136   .6824567     3.29   0.001     1.443583    4.250674
             |
1.~r_disease |   .5043546   .2925292    -1.18   0.238     .1618204     1.57195
1.stroke_d~a |   1.655391   .2343864     3.56   0.000     1.254236    2.184852
1.other_ne~o |   1.168265    .281275     0.65   0.518     .7287918    1.872747
             |
reduced_ki~t |
Stage 3a/..  |   1.621386   .1989122     3.94   0.000     1.274855    2.062111
Stage 4/5..  |   1.488223   .4182892     1.41   0.157     .8578748    2.581737
             |
      1.esrd |   4.940072   1.189752     6.63   0.000      3.08129    7.920162
1.other_tr~t |   .6692137   .4948389    -0.54   0.587     .1570934    2.850832
  1.asplenia |   2.025382   1.447122     0.99   0.323     .4992629     8.21646
1.ra_sle_p~s |   1.290165   .1295516     2.54   0.011     1.059674    1.570791
1.other_im~o |   .2911847   .2919334    -1.23   0.218     .0408111    2.077585
             |
  timeperiod#|
  anyobesity |
       60 1  |   .7120953   .0889007    -2.72   0.007     .5575334    .9095056
       90 1  |    .647996   .1103931    -2.55   0.011      .464046    .9048647
             |
  timeperiod#|
smoke_nomiss |
 60#Current  |   .9685684   .2520512    -0.12   0.902     .5815962    1.613017
 90#Current  |   2.329637   .6575127     3.00   0.003      1.33982    4.050698
             |
  timeperiod#|
     highimd |
       60 1  |   1.502687   .1989801     3.08   0.002     1.159193    1.947966
       90 1  |   2.163902   .4235192     3.94   0.000     1.474485    3.175666
             |
  timeperiod#|
     anydiab |
       60 1  |   1.109199   .1517788     0.76   0.449     .8482696     1.45039
       90 1  |   1.187775   .2228881     0.92   0.359     .8222516    1.715788
             |
  timeperiod#|
chronic_l~se |
       60 1  |   1.562075    1.06173     0.66   0.512     .4122371    5.919116
       90 1  |   7.143434   4.674815     3.00   0.003       1.9809    25.76033
             |
  timeperiod#|
cancer_exh~t |
   60#Never  |   1.186771   .4247322     0.48   0.632     .5884792    2.393329
   90#Never  |   .7799905   .3415863    -0.57   0.570     .3306108    1.840185
             |
  timeperiod#|
    asplenia |
       60 1  |   1.233418   1.072817     0.24   0.809      .224255    6.783885
       90 1  |    2.63179   2.423395     1.05   0.293     .4329632    15.99748
             |
  timeperiod#|
other_immuno |
       60 1  |   7.121854   7.439579     1.88   0.060     .9192152    55.17838
       90 1  |    7.53179   8.414228     1.81   0.071     .8432735    67.27102
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,157,814             Number of obs    =  27,356,031
No. of failures      =        1,471
Time at risk         =   1672853208
                                                Wald chi2(60)    =     4522.03
Log pseudolikelihood =   -17372.474             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,740,058 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .9818691   .0748562    -0.24   0.810     .8455889    1.140113
Kids unde..  |   1.079378    .097385     0.85   0.397      .904431    1.288166
             |
        age1 |   1.083456   .0240417     3.61   0.000     1.037345    1.131617
        age2 |    1.02409   .0531826     0.46   0.647     .9249835    1.133816
        age3 |    .855201   .1122601    -1.19   0.233     .6612004    1.106123
      1.male |   2.319516   .1336459    14.60   0.000     2.071824     2.59682
             |
   obese4cat |
Obese I ..)  |   2.344284   .2441816     8.18   0.000     1.911388    2.875225
Obese II..)  |   3.252285   .3761021    10.20   0.000     2.592708    4.079657
Obese II..)  |    4.65838   .5929441    12.09   0.000     3.629856    5.978339
             |
smoke_nomiss |
     Former  |   1.021374   .0584623     0.37   0.712     .9129839    1.142633
    Current  |   .2440429   .0509555    -6.75   0.000     .1620831    .3674469
             |
         imd |
          2  |    1.13634   .1123248     1.29   0.196     .9362003    1.379265
          3  |   .9156758   .1182985    -0.68   0.495     .7108416    1.179534
          4  |   1.058541   .1314881     0.46   0.647     .8298021    1.350333
5 most de..  |   1.116521   .1435566     0.86   0.391     .8678079    1.436515
             |
   ethnicity |
      Mixed  |   3.207907   .5088724     7.35   0.000     2.350689    4.377725
Asian or ..  |    3.11807   .2624597    13.51   0.000     2.643851    3.677348
      Black  |   3.235491   .3288786    11.55   0.000      2.65105    3.948776
      Other  |   3.229887    .418149     9.06   0.000     2.506044    4.162804
             |
1.htdiag_o~p |   1.445914   .0888999     6.00   0.000     1.281763    1.631088
1.~y_disease |   2.316865   .2430103     8.01   0.000     1.886342    2.845648
    1.asthma |   1.287979    .085671     3.80   0.000     1.130551    1.467327
1.~c_disease |   1.093077   .1026608     0.95   0.343     .9092991    1.313998
             |
     diabcat |
T1DM, con..  |   1.696156   .7872091     1.14   0.255     .6829858    4.212307
T1DM, unc..  |   2.636769    .659654     3.88   0.000     1.614815     4.30548
T2DM, con..  |   1.585754   .1971345     3.71   0.000     1.242848    2.023269
T2DM, unc..  |   2.413246   .2995264     7.10   0.000     1.892136    3.077873
Diabetes,..  |   3.136719   1.436269     2.50   0.013     1.278556    7.695403
             |
cancer_exh~t |
  Last year  |   1.136352    .491744     0.30   0.768     .4865915    2.653757
2-5 years..  |   .9388941   .3263387    -0.18   0.856     .4750704    1.855561
   5+ years  |   .6469674   .2022872    -1.39   0.164     .3505398    1.194064
             |
cancer_hae~t |
  Last year  |   4.696515   2.391268     3.04   0.002     1.731329    12.74007
2-5 years..  |   3.732727    1.26025     3.90   0.000     1.925936    7.234532
   5+ years  |   2.477136   .6824567     3.29   0.001     1.443583    4.250674
             |
1.~r_disease |   .5043546   .2925292    -1.18   0.238     .1618204     1.57195
1.stroke_d~a |   1.655391   .2343864     3.56   0.000     1.254236    2.184852
1.other_ne~o |   1.168265    .281275     0.65   0.518     .7287918    1.872747
             |
reduced_ki~t |
Stage 3a/..  |   1.621386   .1989122     3.94   0.000     1.274855    2.062111
Stage 4/5..  |   1.488223   .4182892     1.41   0.157     .8578748    2.581737
             |
      1.esrd |   4.940072   1.189752     6.63   0.000      3.08129    7.920162
1.other_tr~t |   .6692137   .4948389    -0.54   0.587     .1570934    2.850832
  1.asplenia |   2.025382   1.447122     0.99   0.323     .4992629     8.21646
1.ra_sle_p~s |   1.290165   .1295516     2.54   0.011     1.059674    1.570791
1.other_im~o |   .2911847   .2919334    -1.23   0.218     .0408111    2.077585
             |
  timeperiod#|
  anyobesity |
       60 1  |   .7120953   .0889007    -2.72   0.007     .5575334    .9095056
       90 1  |    .647996   .1103931    -2.55   0.011      .464046    .9048647
             |
  timeperiod#|
smoke_nomiss |
 60#Current  |   .9685684   .2520512    -0.12   0.902     .5815962    1.613017
 90#Current  |   2.329637   .6575127     3.00   0.003      1.33982    4.050698
             |
  timeperiod#|
     highimd |
       60 1  |   1.502687   .1989801     3.08   0.002     1.159193    1.947966
       90 1  |   2.163902   .4235192     3.94   0.000     1.474485    3.175666
             |
  timeperiod#|
     anydiab |
       60 1  |   1.109199   .1517788     0.76   0.449     .8482696     1.45039
       90 1  |   1.187775   .2228881     0.92   0.359     .8222516    1.715788
             |
  timeperiod#|
chronic_l~se |
       60 1  |   1.562075    1.06173     0.66   0.512     .4122371    5.919116
       90 1  |   7.143434   4.674815     3.00   0.003       1.9809    25.76033
             |
  timeperiod#|
cancer_exh~t |
   60#Never  |   1.186771   .4247322     0.48   0.632     .5884792    2.393329
   90#Never  |   .7799905   .3415863    -0.57   0.570     .3306108    1.840185
             |
  timeperiod#|
    asplenia |
       60 1  |   1.233418   1.072817     0.24   0.809      .224255    6.783885
       90 1  |    2.63179   2.423395     1.05   0.293     .4329632    15.99748
             |
  timeperiod#|
other_immuno |
       60 1  |   7.121854   7.439579     1.88   0.060     .9192152    55.17838
       90 1  |    7.53179   8.414228     1.81   0.071     .8432735    67.27102
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save "./output/an_sense_`outcome'_time_int_ageband_0", replace
(note: file ./output/an_sense_covid_icu_time_int_ageband_0.ster not found)
file ./output/an_sense_covid_icu_time_int_ageband_0.ster saved

. estat phtest, d

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |     -0.02279         0.89        1         0.3446
      2.kids_cat3 |     -0.04112         2.95        1         0.0859
      age1        |      0.01197         0.22        1         0.6393
      age2        |     -0.02257         0.81        1         0.3691
      age3        |      0.02338         0.86        1         0.3541
      0b.male     |            .            .        1             .
      1.male      |     -0.10417        18.88        1         0.0000
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00718         0.09        1         0.7614
      3.obese4cat |     -0.00857         0.13        1         0.7204
      4.obese4cat |      0.00469         0.04        1         0.8392
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.02741         1.25        1         0.2627
      3.smoke_no~s|     -0.01585         0.42        1         0.5166
      1b.imd      |            .            .        1             .
      2.imd       |      0.02739         1.22        1         0.2695
      3.imd       |     -0.02016         0.72        1         0.3963
      4.imd       |      0.03079         1.59        1         0.2080
      5.imd       |      0.04242         3.14        1         0.0766
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.02298         0.93        1         0.3344
      3.ethnicity |      0.01136         0.27        1         0.6037
      4.ethnicity |     -0.07481        10.06        1         0.0015
      5.ethnicity |     -0.04029         2.60        1         0.1071
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.05507         5.94        1         0.0148
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.04426         4.18        1         0.0408
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.01755         0.55        1         0.4569
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00884         0.16        1         0.6902
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01319         0.29        1         0.5889
      3.diabcat   |      0.02388         0.91        1         0.3392
      4.diabcat   |      0.00492         0.04        1         0.8337
      5.diabcat   |     -0.00623         0.08        1         0.7793
      6.diabcat   |      0.01762         0.51        1         0.4764
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.02700         1.14        1         0.2855
      3.cancer_e~t|     -0.00564         0.06        1         0.7995
      4.cancer_e~t|     -0.01644         0.51        1         0.4764
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.02960         1.48        1         0.2244
      3.cancer_h~t|      0.00207         0.01        1         0.9335
      4.cancer_h~t|      0.02153         0.81        1         0.3685
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.00751         0.10        1         0.7575
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.00496         0.05        1         0.8303
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00784         0.10        1         0.7476
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.01435         0.40        1         0.5278
      3.reduced_~t|      0.01342         0.45        1         0.5018
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.00342         0.03        1         0.8618
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.00863         0.14        1         0.7035
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00426         0.03        1         0.8598
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.03647         2.27        1         0.1315
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.00891         0.16        1         0.6881
      60bn.timep~y|     -0.00241         0.01        1         0.9173
      90.timeper~y|      0.01882         0.70        1         0.4021
      60bn.timep~s|      0.03021         1.53        1         0.2166
      90.timeper~s|      0.01023         0.18        1         0.6725
      60bn.timep~d|      0.00110         0.00        1         0.9642
      90.timeper~d|      0.00399         0.03        1         0.8652
      60bn.timep~b|      0.00080         0.00        1         0.9728
      90.timeper~b|     -0.02805         1.64        1         0.1998
      60bn.timep~a|      0.01083         0.20        1         0.6565
      90.timeper~a|      0.02457         1.03        1         0.3097
      60bn.timep~t|     -0.00092         0.00        1         0.9682
      90.timeper~t|      0.00287         0.02        1         0.9014
      60bn.timep~a|      0.00310         0.02        1         0.8987
      90.timeper~a|      0.00846         0.13        1         0.7169
      60bn.timep~o|     -0.00556         0.06        1         0.8038
      90.timeper~o|      0.00571         0.06        1         0.8001
      ------------+---------------------------------------------------
      global test |                     80.64       60         0.0390
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_1.dta", clea
> r

. stsplit timeperiod, at(60 90)
(5,084,035 observations (episodes) created)

. 
. *make vars binary
. gen anyreduced_kidney_function = reduced_kidney_function_cat>=2

. gen anyobesity = obese4cat>=2

. gen highimd = imd>=3

. gen anydiab= diabcat>=2

. 
. /*
> *Age and sex adjusted
> stcox i.kids_cat3 age1 age2 age3 i.male, strata(stp) vce(cluster household_id
> )
> estimates
> estimates save ./output/an_univariable_cox_models_`outcome'_AGESEX_time_int_a
> geband_1, replace                                          
> 
> *Minimally adjusted
> stcox   i.kids_cat3     ///
>                         age1 age2 age3          ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                           ///
>                 60.timeperiod#1.male                                         
>            ///
>                         90.timeperiod#1.male                                 
>            ///
>                         , strata(stp) vce(cluster household_id)
> estimates
> estimates save ./output/an_multivariate_cox_models_`outcome'_kids_cat3_DEMOGA
> DJ_time_int_ageband_1, replace
> estat phtest, d
> */
. 
. 
. *Fully adjusted
. stcox   i.kids_cat3      ///
>                         age1 age2 age3          ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                           ///
>                         i.ethnicity ///
>                         `comordidadjlist'       ///     
>                 60.timeperiod#1.male                                         
>            ///
>                         90.timeperiod#1.male                                 
>            ///
>                 60.timeperiod#3.anyreduced_kidney_function                   
>                            ///
>                         90.timeperiod#3.anyreduced_kidney_function           
>                            ///
>                         , strata(stp) vce(cluster household_id)

         failure _d:  covid_icu
   analysis time _t:  (stime_covid_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 60.timeperiod#3.anyreduced_kidney_function identifies no observations in 
> the sample
note: 90.timeperiod#3.anyreduced_kidney_function identifies no observations in 
> the sample
Iteration 0:   log pseudolikelihood = -7804.7348
Iteration 1:   log pseudolikelihood = -7568.3462
Iteration 2:   log pseudolikelihood = -7547.6193
Iteration 3:   log pseudolikelihood = -7545.7458
Iteration 4:   log pseudolikelihood = -7545.6879
Iteration 5:   log pseudolikelihood = -7545.6878
Refining estimates:
Iteration 0:   log pseudolikelihood = -7545.6878

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,567,671             Number of obs    =   7,651,706
No. of failures      =          675
Time at risk         =    466817777
                                                Wald chi2(21)    =      432.02
Log pseudolikelihood =   -7545.6878             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,011,759 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .9733133   .1973841    -0.13   0.894     .6540821    1.448348
Kids unde..  |   1.235619   .3426839     0.76   0.446     .7174875    2.127919
             |
        age1 |   .9481176   .0319818    -1.58   0.114     .8874616    1.012919
        age2 |    1.30157    .268909     1.28   0.202     .8681726    1.951321
        age3 |    .396194   .1926048    -1.90   0.057     .1527942    1.027328
      1.male |    3.40582    .490049     8.52   0.000     2.568893    4.515413
             |
   obese4cat |
Obese I ..)  |   1.552453   .1429408     4.78   0.000     1.296119    1.859483
Obese II..)  |   2.227089   .2799499     6.37   0.000     1.740763    2.849282
Obese II..)  |    1.84717   .3904435     2.90   0.004     1.220633    2.795301
             |
smoke_nomiss |
     Former  |   1.545045   .1348447     4.98   0.000     1.302123    1.833286
    Current  |   .5083771   .1054383    -3.26   0.001     .3385675    .7633554
             |
         imd |
          2  |   1.013827   .1254758     0.11   0.912     .7954549    1.292149
          3  |   1.179412   .1435608     1.36   0.175     .9290844    1.497186
          4  |   1.251613   .1576831     1.78   0.075     .9777603    1.602167
5 most de..  |   1.198457   .1636176     1.33   0.185     .9170927    1.566143
             |
   ethnicity |
      Mixed  |   2.706008   1.055977     2.55   0.011     1.259392    5.814293
Asian or ..  |   2.728844   .4124647     6.64   0.000     2.029175    3.669761
      Black  |   3.786662   .7849825     6.42   0.000     2.522324    5.684762
      Other  |   3.209082   .7921755     4.72   0.000     1.978145    5.205992
             |
  timeperiod#|
        male |
       60 1  |    .774424   .1493104    -1.33   0.185     .5307201    1.130036
       90 1  |   .7205753   .1710559    -1.38   0.167     .4524957    1.147478
             |
  timeperiod#|
anyreduced~n |
       60 3  |          1  (empty)
       90 3  |          1  (empty)
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,567,671             Number of obs    =   7,651,706
No. of failures      =          675
Time at risk         =    466817777
                                                Wald chi2(21)    =      432.02
Log pseudolikelihood =   -7545.6878             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,011,759 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .9733133   .1973841    -0.13   0.894     .6540821    1.448348
Kids unde..  |   1.235619   .3426839     0.76   0.446     .7174875    2.127919
             |
        age1 |   .9481176   .0319818    -1.58   0.114     .8874616    1.012919
        age2 |    1.30157    .268909     1.28   0.202     .8681726    1.951321
        age3 |    .396194   .1926048    -1.90   0.057     .1527942    1.027328
      1.male |    3.40582    .490049     8.52   0.000     2.568893    4.515413
             |
   obese4cat |
Obese I ..)  |   1.552453   .1429408     4.78   0.000     1.296119    1.859483
Obese II..)  |   2.227089   .2799499     6.37   0.000     1.740763    2.849282
Obese II..)  |    1.84717   .3904435     2.90   0.004     1.220633    2.795301
             |
smoke_nomiss |
     Former  |   1.545045   .1348447     4.98   0.000     1.302123    1.833286
    Current  |   .5083771   .1054383    -3.26   0.001     .3385675    .7633554
             |
         imd |
          2  |   1.013827   .1254758     0.11   0.912     .7954549    1.292149
          3  |   1.179412   .1435608     1.36   0.175     .9290844    1.497186
          4  |   1.251613   .1576831     1.78   0.075     .9777603    1.602167
5 most de..  |   1.198457   .1636176     1.33   0.185     .9170927    1.566143
             |
   ethnicity |
      Mixed  |   2.706008   1.055977     2.55   0.011     1.259392    5.814293
Asian or ..  |   2.728844   .4124647     6.64   0.000     2.029175    3.669761
      Black  |   3.786662   .7849825     6.42   0.000     2.522324    5.684762
      Other  |   3.209082   .7921755     4.72   0.000     1.978145    5.205992
             |
  timeperiod#|
        male |
       60 1  |    .774424   .1493104    -1.33   0.185     .5307201    1.130036
       90 1  |   .7205753   .1710559    -1.38   0.167     .4524957    1.147478
             |
  timeperiod#|
anyreduced~n |
       60 3  |          1  (empty)
       90 3  |          1  (empty)
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save "./output/an_sense_`outcome'_time_int_ageband_1", replace
(note: file ./output/an_sense_covid_icu_time_int_ageband_1.ster not found)
file ./output/an_sense_covid_icu_time_int_ageband_1.ster saved

. 
. estat phtest, d

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.03773         1.02        1         0.3122
      2.kids_cat3 |     -0.03363         0.89        1         0.3461
      age1        |     -0.05655         2.33        1         0.1268
      age2        |      0.06089         2.77        1         0.0962
      age3        |     -0.06265         3.02        1         0.0822
      0b.male     |            .            .        1             .
      1.male      |     -0.01814         0.24        1         0.6220
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.00665         0.03        1         0.8559
      3.obese4cat |     -0.04015         1.24        1         0.2653
      4.obese4cat |      0.01771         0.23        1         0.6348
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.00007         0.00        1         0.9985
      3.smoke_no~s|      0.05451         2.16        1         0.1417
      1b.imd      |            .            .        1             .
      2.imd       |      0.01362         0.14        1         0.7133
      3.imd       |     -0.00046         0.00        1         0.9900
      4.imd       |      0.04466         1.51        1         0.2186
      5.imd       |      0.07744         4.48        1         0.0343
      1b.ethnicity|            .            .        1             .
      2.ethnicity |      0.06067         2.79        1         0.0950
      3.ethnicity |      0.14209        15.23        1         0.0001
      4.ethnicity |      0.01249         0.12        1         0.7323
      5.ethnicity |     -0.00749         0.04        1         0.8363
      60bn.timep~e|      0.01762         0.23        1         0.6323
      90.timeper~e|     -0.00928         0.06        1         0.8005
      60bno.time~_|            .            .        1             .
      90o.timepe~_|            .            .        1             .
      ------------+---------------------------------------------------
      global test |                     38.24       21         0.0121
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/log/07d_an_multivariable_cox_models_covid_icu_Sense5_ti
> me_ints.log
  log type:  text
 closed on:  21 Oct 2020, 20:31:17
-------------------------------------------------------------------------------
